{"abstract":"Wireless Communication technology such as LTE/NR is developed to cope with the increasing demand for better Quality of service (QoS) and the emergence of bandwidth consuming multimedia applications. Scheduling paradigms such as Round Robin, Best Channel Quality Condition and Proportional Fair are commonly adopted in current LTE downlink scheduling algorithms. Major drawback of the existing schedulers is that every TTI MAC has to decide the resource allocation for each user even if the data to be scheduled and channel condition of the users are not varying. Optimization of scheduling algorithm is required to reduce the processing time simultaneously performs to schedule the user based on the Quality of Service (QoS). Therefore, we are motivated to propose this novel approach of MAC scheduling algorithm. In fact, many machine learning algorithm are available which can perform time series forecasting but the most appropriate Machine Learning (ML) model for downlink scheduling purpose is Autoregressive Integrated Moving Average (ARIMA) because of its novel short term estimating technique that predict the future trend accurately. In this work, a novel and practically feasible scheduling algorithm is proposed in order to save PDCCH resources and resource allocation time for UE scheduling. In this proposed algorithm, a specific time series forecasting machine learning technique known as Autoregressive Integrated Moving Average (ARIMA) is used, this learns the data usage pattern & channel quality of every UE and develop prediction pattern of scheduling. Resource allocation calculated using ARIMA algorithm can be modified when reported CQI/Data differs by configurable threshold. In this case ARIMA modules re-learn and re-calculate new resource. ARIMA model is best to predict future values of time/frequency resource required for scheduling a UE. The proposed prediction based scheduling algorithm based on ARIMA model is implemented and study its positive impact on the existing LTE downlink scheduling performance in terms of saving resources and processing time (Roughly periodicity of 5ms for 2 UEs out of 4 can save 30% to 35% of PDCCH resource)."}