{"abstract":"As a result of current dearth of medical physicians and medical resources in some countries, and also due to the growth of the Internet, an increasing number of people are holding medical question-and-answer sessions online. The goal of this research is to create a medical question-answering system based on a knowledge graph that will allow individuals to acquire answers to medical queries rapidly on the computer. To accomplish it, we propose a new mechanism of intent recognition and entity linking on a medical knowledge graph. After these processes, the system uses Cypher language to search the knowledge graph for the answer based on the extracted query-intent and entity, using the specified rule template that was formed during slot filling. Two models are used in this study to fulfill the tasks of intent recognition and named entity recognition, and the system also enhanced the model's results with information from the knowledge graph using the template matching method. Additionally, the entity linking procedure has been finished in order to better integrate models into a question-and-answer system. The entity linking function can link non-standard words in user questions to common disease names on the knowledge graph, to better obtain answers from the knowledge graph. The intent recognition used the BERT-TextCNN model, and the accuracy obtained on the CMID public dataset was 0.67. The named entity recognition used the BiLSTM-CRF model, and the accuracy obtained on the cMedQANER public dataset was 0.96. The entity linking process used the ESIM model, and the accuracy obtained on the Yidu-N7K public dataset was 0.96. The system used the above trained models and template matching methods to answer a total of 13 types of questions: ‘Definition’, ‘Cause’, ‘Prevention’, ‘Disease manifestations’, ‘Associated conditions’, ‘Treatment’, ‘Department’, ‘Infectious’, ‘Cure rate’, ‘Taboo’, ‘Physical Examination Program’, ‘Treatment time’ and ‘Food recommend’. To compare the effectiveness of this system with the system that only uses the template matching method, the experiment was designed with 200 questions divided into four groups. ‘whether the question uses the standard entity names in the knowledge graph’ and ‘whether the question uses the feature words in the intent template’ were controlled separately in different groups. The experimental results demonstrate that the correct answer rate of this system is much higher than that of the system based on template matching only when users enter questions without using standard entity names from the knowledge graph or without using feature words from the intent template."}