{"abstract":"Data imputation has been extensively explored to solve the missing data problem. The dramatically increasing volume of incomplete data makes the imputation models computationally infeasible in many real-life applications. In this paper, we propose an effective scalable imputation system named <inline-formula><tex-math notation=\"LaTeX\">${\\sf SCIS}$</tex-math><alternatives><mml:math><mml:mi mathvariant=\"sans-serif\">SCIS</mml:mi></mml:math><inline-graphic xlink:href=\"miao-ieq1-3293129.gif\"/></alternatives></inline-formula> to significantly speed up the training of the differentiable generative adversarial imputation models under accuracy-guarantees for large-scale incomplete data. <inline-formula><tex-math notation=\"LaTeX\">${\\sf SCIS}$</tex-math><alternatives><mml:math><mml:mi mathvariant=\"sans-serif\">SCIS</mml:mi></mml:math><inline-graphic xlink:href=\"miao-ieq2-3293129.gif\"/></alternatives></inline-formula> consists of two modules, <italic>differentiable imputation modeling</italic> (DIM) and <italic>sample size estimation</italic> (SSE). DIM leverages a new <italic>masking Sinkhorn</italic> divergence function to make an arbitrary generative adversarial imputation model differentiable, while for such a differentiable imputation model, SSE can estimate an appropriate sample size to ensure the user-specified imputation accuracy of the final model. Moreover, <inline-formula><tex-math notation=\"LaTeX\">${\\sf SCIS}$</tex-math><alternatives><mml:math><mml:mi mathvariant=\"sans-serif\">SCIS</mml:mi></mml:math><inline-graphic xlink:href=\"miao-ieq3-3293129.gif\"/></alternatives></inline-formula> can also accelerate the autoencoder based imputation models. Extensive experiments upon several real-life large-scale datasets demonstrate that, our proposed system can accelerate the generative adversarial model training by 6.23x. Using around 1.27% samples, <inline-formula><tex-math notation=\"LaTeX\">${\\sf SCIS}$</tex-math><alternatives><mml:math><mml:mi mathvariant=\"sans-serif\">SCIS</mml:mi></mml:math><inline-graphic xlink:href=\"miao-ieq4-3293129.gif\"/></alternatives></inline-formula> yields competitive accuracy with the state-of-the-art imputation methods in much shorter computation time."}