{"abstract":"Quantitative electroencephalography (QEEG) analysis is commonly adopted for the investigation of various neurological disorders, revealing electroencephalogram (EEG) features associated with specific dysfunctions. Conventionally, topographies are widely utilized for spatial representation of EEG characteristics at specific frequencies or frequency bands. However, multiple topographies at various frequency bands are required for a complete description of brain activity. In consequence, use of topographies for the training of deep learning algorithms is often challenging. The present study describes the development and application of a novel QEEG feature image that integrates all required spatial and spectral information within a single image, overcoming conventional obstacles. EEG powers recorded at 19 channels defined by the international 10–20 system were pre-processed using the EEG auto-analysis system iSyncBrain®, removing the artifact components selected through independent component analysis (ICA) and rejecting bad epochs. Hereafter, spectral powers computed through fast Fourier transform (FFT) were standardized into Z-scores through iMediSync, Inc.’s age- and sex-specific normative database. The standardized spectral powers for each channel were subsequently rearranged and concatenated into a rectangular feature matrix, in accordance with their spatial location on the scalp surface. Application of various feature engineering techniques on the established feature matrix yielded multiple types of feature images. Such feature images were utilized in the deep learning classification of Alzheimer’s disease dementia (ADD) and non-Alzheimer’s disease dementia (NADD) data, in order to validate the use of our novel feature images. The resulting classification accuracy was 97.4%. The Classification criteria were further inferred through an explainable artificial intelligence (XAI) algorithm, which complied with the conventionally known EEG characteristics of AD. Such outstanding classification performance bolsters the potential of our novel QEEG feature images in broadening QEEG utility."}