{"abstract":"This book presents an in-depth technical understanding of 6G wireless networks. It not only discusses cutting-edge wireless services and technologies, but also sheds light on the network requirements, capabilities, and applications. Following in the footsteps of 5G, the goal of 6G mobile networks is to usher in an era of ubiquitous intelligence. 6G will act as a liaison between the physical world and the networked world. This objective is ambitious and will have a significant impact on our culture and economy. Part I of this book provides a brief history of mobile communications, tracing its development from 2G to 6G networks as well as addressing six key technological trends for the future of linked intelligence. Part II investigates potential 6G use cases with the specific performance criteria, such as lower latency, greater reliability, and larger capacity. The authors categorize typical use cases into six groups, each with its own chapter. Part III studies the breadth and limits of 6G design, looks into a range of supporting technologies that have the ability to meet key performance indicators (KPIs), and then covers the theoretical basics of 6G radio and network technologies. Part IV examines the future International Mobile Telecommunications (IMT) spectrum from the standpoint of communications and sensing, as well as the associated channel modeling methods and some sample channel measurements. Part V presents the design principles and potential enabling technologies for 6G air interfaces. In particular, it highlights the paradigm shifts of air interface building in comparison to 5G and previous generations with detailed discussions on a variety of enabling technologies. Part VI investigates the design concepts and enabler technologies for 6G network architectures. In particular, it starts with a discussion of paradigm changes in network architecture design, followed by a number of the novel technologies featured in 6G networks. Part VII (Chapter 33) ends the book by summarizing the present worldwide state of the 6G ecosystem, including research initiatives, platforms, workshops and publications on 6G, and then forecasting a possible path until 2030. In conclusion, this book presents an overview of 6G from the perspective of intelligence-of-everything, which includes drivers, essential capabilities, use cases, key performance indicators, and technological breakthroughs. The authors emphasize recent advances such as immersive human-centric communications, sensing, location, imaging, linked machine learning and networked artificial intelligence, Industry 4.0 and beyond, etc. This book can serve as a good reference for practitioners and researchers in the field, in a bid to get an idea of the current and future research focus in this emerging area."}