{"abstract":"Objective. Channel selection in the electroencephalogram (EEG)-based brain–computer interface (BCI) has been extensively studied for over two decades, with the goal being to select optimal subject-specific channels that can enhance the overall decoding efficacy of the BCI. With the emergence of deep learning (DL)-based BCI models, there arises a need for fresh perspectives and novel techniques to conduct channel selection. In this regard, subject-independent channel selection is relevant, since DL models trained using cross-subject data offer superior performance, and the impact of inherent inter-subject variability of EEG characteristics on subject-independent DL training is not yet fully understood. Approach. Here, we propose a novel methodology for implementing subject-independent channel selection in DL-based motor imagery (MI)-BCI, using layer-wise relevance propagation (LRP) and neural network pruning. Experiments were conducted using Deep ConvNet and 62-channel MI data from the Korea University EEG dataset. Main Results. Using our proposed methodology, we achieved a 61% reduction in the number of channels without any significant drop (p = 0.09) in subject-independent classification accuracy, due to the selection of highly relevant channels by LRP. LRP relevance-based channel selections provide significantly better accuracies compared to conventional weight-based selections while using less than 40% of the total number of channels, with differences in accuracies ranging from 5.96% to 1.72%. The performance of the adapted sparse-LRP model using only 16% of the total number of channels is similar to that of the adapted baseline model (p = 0.13). Furthermore, the accuracy of the adapted sparse-LRP model using only 35% of the total number of channels exceeded that of the adapted baseline model by 0.53% (p = 0.81). Analyses of channels chosen by LRP confirm the neurophysiological plausibility of selection, and emphasize the influence of motor, parietal, and occipital channels in MI-EEG classification. Significance. The proposed method addresses a traditional issue in EEG-BCI decoding, while being relevant and applicable to the latest developments in the field of BCI. We believe that our work brings forth an interesting and important application of model interpretability as a problem-solving technique."}