{"abstract":"Virtual reality is a field that can be widely explored for sustainability requirements. In this work, a virtual city environment was developed with intend to help city navigation especially by personnel with special abilities, mainly while traveling. They may need assistance to perform such daily tasks. The goal is to build an agent that can be trained to help guide daily commute from a given source to destination, optimizing for a minimum possible time as well as avoiding multiple obstacles. Real-time traffic and crowd were simulated to train learning agents. Apart from using the shortest path, factors such as following traffic rules and avoiding accidents with obstacles are also considered. The agent must be trained in order to avoid heavy traffic and change its path to reach the goal taking minimum time, not just the shortest distance. By using machine learning gents and simulations, training of the agent using reinforcement learning has been achieved. Identification of certain unsafe paths and behaviors have also been considered for simulation and learning purposes. Custom scenarios to mitigate the risks before actual accidents happen have been created for understanding and further resolution. Agent-based learning for successful space exploration is established on the relationship parameter between actions and the virtual environment. Initially, the agent explores the virtual city on its own and interacts with numerous components of the environment. The main objective of the agent is to reach its goal following the reward system, as used in a game environment. Maximization of the score using these parameters helps in training the agent. Route learning is also considered to facilitate backtracking wherein the obstacles are placed in the route. The virtual environment, so created, then has an agent that depicts that shorted, safe and accident-free path for a person to reach his or her destination from a given source point. The city has numerous parameters of an actual live city of building, paths, and unruly movements, amongst others."}