{"abstract":"We are entering the age of robots where autonomous robots will drive our cars, milk cows, drill for oil, invest in stock, mine coal, build houses, pick strawberries, and work as surgeons. Robots, in mimicking the work of humans, will also mimic their legal liability. But how do you sue a robot? The current answer is that you cannot. Robots are property. They are not entities with a legal status that would make them amendable to sue or be sued. If a robot causes harm, you have to sue its owner. Corporations used to be like this for many procedural purposes. They were similarly tethered to human owners. Over time, courts and legislators abandoned the model of treating corporations solely as property and increasingly treated them as an independent artificial person for litigation purposes. Robots might also make a transition along those lines. If they do, which legal model should we adopt for robots? Are they more like an employee, a franchisee, a slave, a subsidiary, a child, an animal, a subcontractor, an agent, or something else altogether? Given the inherent path-dependence of procedural law, picking the right model will have important consequences and will be difficult to reverse. This Article lays the groundwork for this fundamental decision. It explains the urgency and importance of this decision and presents three analytical frameworks (ontological, deontological, and functional) for how we can approach the question of robots in civil litigation. Often unnoticed and unarticulated, these analytical frameworks structure important doctrinal and normative positions. The Article then applies these analytical frameworks to evaluate numerous concrete contestant models for treating robots as litigation entities. The resulting taxonomy exposes the weaknesses of analogizing robots to established models—none fits, and all would have negative practical consequences. Instead of utilizing an existing model, this Article argues that we must treat robots as a new litigation category that borrows insights selectively and partially from a range of the existing models. For example, we must craft a new in robotam personal jurisdiction doctrine to supplement the old in personam jurisdiction doctrine. Doing otherwise would expose procedure to doctrinal incoherence, legislation to policy mayhem, and parties injured by robots to unnecessary costs and insurmountable procedural hurdles. * © 2018 Roger Michalski. Associate Professor at the University of Oklahoma College of Law. I am grateful to Steven Gensler, Joshua Sellers, and above all Melissa Mortazavi for their helpful comments, suggestions, and insights. 1022 UTAH LAW REVIEW [NO. 5 TABLE OF CONTENTS INTRODUCTION ............................................................................................... 1022 I. THE ROBOTS ARE COMING.......................................................................... 1033 A. Moving Beyond Factories .................................................................... 1033 B. More Autonomously ............................................................................ 1035 C. New Social, Political, and Economic Issues ......................................... 1038 D. Responses from Substantive Law ......................................................... 1040 II. ANALYTICAL FRAMEWORKS ...................................................................... 1042 A. Ontological ......................................................................................... 1043 B. Deontological...................................................................................... 1046 C. Functional .......................................................................................... 1049 III. POSSIBLE MODELS.................................................................................... 1052 A. The Default: Robots as Property or Things .......................................... 1053 B. Corporate Variations .......................................................................... 1055 C. Vicarious Entities ................................................................................ 1058 D. Slaves ................................................................................................. 1060 E. Children, Incompetents, and Animals .................................................. 1061 F. The Faustian Bargain .......................................................................... 1062 IV. THE PROPOSED SOLUTION, TIMING, PROBLEMS, AND GRAY SPACES ......... 1063 A. Solution: Split the bundle..................................................................... 1064 B. Timing Questions ................................................................................ 1066 C. Problems and Gray spaces .................................................................. 1067 D. In the Crystal Ball ............................................................................... 1070 CONCLUSION .................................................................................................. 1071"}