{"abstract":"Smart cities have been envisioned during the last decade. Moreover, various projects have been initiated to bring this concept into reality. Smart city is basically an emergence of the existing and new Information and Communications Technologies (ICT) to make our living standard more safe and digitized. Wireless communications, such as sensors, actuators, intelligent transportation systems, and smart grids, have played a vital role in the dissemination of information under the given circumstances. Similarly, it is hard to declare any city as a smart city without taking benefits from wireless sensor networks (WSNs). However, with new requirements and delay sensitive applications, the existing WSN requires significant alterations at several layers. In this paper, a new time division multiple access (TDMA)-based medium access control (MAC) protocol, called bitmap-assisted efficient and scalable TDMA-based MAC (BEST-MAC), is proposed for adaptive traffic in hierarchical WSNs that can be deployed in the smart cities. BEST-MAC is specifically designed to improve the quality control of such smart cities applications, where diverse traffic is required and loss or delay in data traffic is unacceptable. The main contributions of BEST-MAC include: 1) it uses small size time slots; 2) the number of those time slots is more than the number of member nodes; 3) knapsack algorithm is used to schedule time slots; and 4) short node address (1 B) is proposed to identify the member nodes. First two contributions of BEST-MAC handle adaptive traffic loads of all members in an efficient manner. The knapsack algorithm not only reduces the job completion time of a node but also minimizes the average packet delay with better link utilization. The short node address reduces the control overhead that improves the energy efficiency. The simulation results verify that the proposed BEST-MAC transmits more data with less delay and energy consumption compared with the existing MAC protocols."}