{"abstract":"Objective. Brain activity signals are possible biomarkers for personal authentication. However, they are inherently variable due to measurement-environment factors and subject-dependent factors; electroencephalography (EEG) signals could be different in days even for the same task, subject, and experimental settings. This variability could cause loss of consistency of the signals across multiple measurements of a single subject, and hence decrease the performance of EEG-based personal identification. In this study, we evaluated the influence of the variability on personal EEG features by using our original EEG dataset. Approach. We collected EEG signals in twenty subjects across four rounds (morning and afternoon daily for two days). At each round, we reinstalled an EEG cap on the subjects’ scalps. To extract personal EEG features that were invariant across the sessions, we proposed unsupervised learning methods; common dictionary learning and t-distributed stochastic neighbor embedding. To assess the performance of personal identification, we compared two different experimental settings; test data recorded in the same round as the training data (Setting SR) and test data recorded in different rounds (Setting DR). Main results. The performance in SR was better than that in DR, suggesting that features dependent on the rounds were dominant. However, the 40% accuracy rate in DR, which is significantly higher than the chance level, suggests that our proposed method robustly extracted the personal features against the variability, in most cases. Furthermore, we also evaluated the performance of a problem, which involved detecting individuals who were not registered in the authentication system. In this problem, we obtained a similar result that the variability for the rounds influenced the performance. However, we obtained a good performance in the detection of some unknown subjects even in DR. Significance. We found the variability in EEG data actually affected the personal features that were used for personal identification. Even considering the variability in EEG data, however, we found our proposed method is applicable in personal authentication scenarios, i.e. personal identification and unknown detection."}