{"abstract":"The Ontology for General Medical Science (OGMS) complemented with the Computer-Based Patient Record Ontology (CPR)is based on several upper ontologies which may have formal ontological relations according to the OBO Foundry principles. These ontologies accordant to the underlying Ontological Realism render a structure with reasoning capabilities that reach further than those possible with logical formalisms alone. We propose to extend carefully the OGMS taking into account the diverse ontological relations found in the recently proposed Basic Formal Ontology V2, FMA and SNOMED-CT as foundational ontologies in order to extract axioms for ontology enrichment from natural language text. With these cautions in mind, using careful instantiation we improve largely the reasoning capabilities over the resulting OWL knowledge base. Most of the clinical practice knowledge is currently recorded in SOAP text format. We extend the OGMS with the CPR structure into an Ontology for General Clinical Practice (OGCP) for the generation of adequate ontologically rich axioms from the SOAP text segments. 1 Motivation and Research questions: Originally our research intention was the development of personal CDS1 tools to help the healthcare professionals in scarce resource countries like most in Africa and Asia. After evaluating the State-of-theArt presented ahead we found that relevant work is yet to be done in the KR2 area regarding the Clinical Practice domain. We believe that some developments that have been achieved recently motivate us to incorporate our expertise in NLP3 into effective ontology population. Our main intention is to be able to automatically produce clinical practice knowledge bases extracting from healthcare reports text. Research questions Ontologies in the sub-domain of Clinical Medicine4 are lacking some thorough study. These can be stated as current problems for the effectiveness of using them as knowledge support for clinical reasoning. Problems found in current ontologies and enumerated in literature (Hoehndorf et al., 2011) that lead to reasoning hurdles are: Lack of adequate modularization to achieve the mini1Clinical Decision Support 2Knowledge Representation 3Natural Language Processing 4The study of disease by direct examination of the living patient mum amount of implicit differentiation among primitive concepts. Inadequate clear separation of digital entities from the reality they represent. Inability to avoid the knowledge acquisition bottleneck (Wong et al., 2012) in order to speed start any automatic enrichment. In our work we try to overcome the different issues identified by the several experts in (Brochhausen et al., 2011). In order to maximize the reasoning capabilities based in our extended OGMS(OGMS, 2010) ontology, different considerations in the referred work by Brochhausen et al. were taken into good account. We complemented the OGMS ontology with the CPR into what we call the OGCP that is intended to be a more supportive structure for representation of clinical practice while, at the same time, embodies a formal medical theory of disease and healthcare."}