{"abstract":"Federated learning (FL) is rapidly gaining popularity and enables multiple data owners (<italic>a.k.a.</italic> FL participants) to collaboratively train machine learning models in a privacy-preserving way. A key unaddressed scenario is that these FL participants are in a competitive market, where market shares represent their competitiveness. Although they are interested to enhance the performance of their respective models through FL, market leaders (who are often data owners who can contribute significantly to building high performance FL models) want to avoid losing their market shares by enhancing their competitors’ models. Currently, there is no modeling tool to analyze such scenarios and support informed decision-making. In this paper, we bridge this gap by proposing the <underline>mar</underline>ket <underline>s</underline>hare-based decision support framework for participation in <underline>FL</underline> (MarS-FL). We introduce <italic>two notions of <inline-formula><tex-math notation=\"LaTeX\">$\\delta$</tex-math><alternatives><mml:math><mml:mi>δ</mml:mi></mml:math><inline-graphic xlink:href=\"wu-ieq1-3186991.gif\"/></alternatives></inline-formula>-stable market</italic> and <italic>friendliness</italic> to measure the viability of FL and the market acceptability of FL. The FL participants’ behaviours can then be predicted using game theoretic tools (i.e., their optimal strategies concerning participation in FL). If the market <inline-formula><tex-math notation=\"LaTeX\">$\\delta$</tex-math><alternatives><mml:math><mml:mi>δ</mml:mi></mml:math><inline-graphic xlink:href=\"wu-ieq2-3186991.gif\"/></alternatives></inline-formula>-stability is achievable, the final model performance improvement of each FL-PT shall be bounded, which relates to the market conditions of FL applications. We provide tight bounds and quantify the friendliness, <inline-formula><tex-math notation=\"LaTeX\">$\\kappa$</tex-math><alternatives><mml:math><mml:mi>κ</mml:mi></mml:math><inline-graphic xlink:href=\"wu-ieq3-3186991.gif\"/></alternatives></inline-formula>, of given market conditions to FL. Experimental results show the viability of FL in a wide range of market conditions. Our results are useful for identifying the market conditions under which collaborative FL model training is viable among competitors, and the requirements that have to be imposed while applying FL under these conditions."}