{"abstract":"BackgroundThree-directional phase velocity mapping (PVM) is capable of measuring longitudinal, radial and circumferential regional myocardial velocities. Current techniques use Cartesian k-space coverage and navigator-gated high spatial and high temporal resolution acquisitions are long. In addition, prospective ECG-gating means that analysis of the full cardiac cycle is not possible. The aim of this study is to develop a high temporal and high spatial resolution PVM technique using efficient spiral k-space coverage and retrospective ECG-gating. Detailed analysis of regional motion over the entire cardiac cycle, including atrial systole for the first time using MR, is presented in 10 healthy volunteers together with a comprehensive assessment of reproducibility.MethodsA navigator-gated high temporal (21 ms) and spatial (1.4 × 1.4 mm) resolution spiral PVM sequence was developed, acquiring three-directional velocities in 53 heartbeats (100% respiratory-gating efficiency). Basal, mid and apical short-axis slices were acquired in 10 healthy volunteers on two occasions. Regional and transmural early systolic, early diastolic and atrial systolic peak longitudinal, radial and circumferential velocities were measured, together with the times to those peaks (TTPs). Reproducibilities were determined as mean ± SD of the signed differences between measurements made from acquisitions performed on the two days.ResultsAll slices were acquired in all volunteers on both occasions with good image quality. The high temporal resolution allowed consistent detection of fine features of motion, while the high spatial resolution allowed the detection of statistically significant regional and transmural differences in motion. Colour plots showing the regional variations in velocity over the entire cardiac cycle enable rapid interpretation of the regional motion within any given slice. The reproducibility of peak velocities was high with the reproducibility of early systolic, early diastolic and atrial systolic peak radial velocities in the mid slice (for example) being −0.01 ± 0.36, 0.20 ± 0.56 and 0.14 ± 0.42 cm/s respectively. Reproducibility of the corresponding TTP values, when normalised to a fixed systolic and diastolic length, was also high (−13.8 ± 27.4, 1.3 ± 21.3 and 3.0 ± 10.9 ms for early systolic, early diastolic and atrial systolic respectively).ConclusionsRetrospectively gated spiral PVM is an efficient and reproducible method of acquiring 3-directional, high resolution velocity data throughout the entire cardiac cycle, including atrial systole."}