{"abstract":"Data sparsity has been a long-standing issue for accurate and trustworthy recommendation systems (RS). To alleviate the problem, many researchers pay much attention to cross-domain recommendation (CDR), which aims at transferring rich knowledge from related source domains to enhance the recommendation performance of sparse target domain. To reach the knowledge transferring purpose, recent CDR works always focus on designing different pairwise directed or undirected information transferring strategies between source and target domains. However, such pairwise transferring idea is difficult to adapt to multi-target CDR scenarios directly, e.g., transferring knowledge between multiple domains and improving their performance simultaneously, as such strategies may lead the following issues: (1) When the number of domains increases, the number of transferring modules will grow exponentially, which causes heavy computation complexity. (2) A single pairwise transferring module could only capture the relevant information of two domains, but ignores the correlated information of other domains, which may limit the transferring effectiveness. (3) When a sparse domain serves as the source domain during the pairwise transferring, it would easily leads the negative transfer problem, and the untrustworthy information may hurt the target domain recommendation performance. In this article, we consider the key challenge of the multi-target CDR task: How to identify the most valuable trustworthy information over multiple domains and transfer such information efficiently to avoid the negative transfer problem? To fulfill the above challenge, we propose a novel end-to-end model termed as DR-MTCDR, standing for Disentangled Representations learning for Multi-Target CDR. DR-MTCDR aims at transferring the trustworthy domain-shared information across domains, which has the two major advantages in both efficiency and effectiveness: (1) For efficiency, DR-MTCDR utilizes a unified module on all domains to capture disentangled domain-shared information and domain-specific information, which could support all domain recommendation and be insensitive to the number of domains. (2) For effectiveness, based on the disentangled domain-shared and domain-specific information, DR-MTCDR has the capability to lead positive effect and make trustworthy recommendation for each domain. Empirical evaluations on datasets from both public datasets and real-world large-scale financial datasets have shown that the proposed framework outperforms other state-of-the-art baselines."}