{"abstract":"The determination of subsurface elastic property models is crucial in quantitative seismic data processing and interpretation. This problem is commonly solved by deterministic physical methods, such as tomography or full-waveform inversion. However, these methods are entirely local and require accurate initial models. Deep learning represents a plausible class of methods for seismic inversion, which may avoid some of the issues of purely descent-based approaches. However, any generic deep learning network capable of relating each elastic property cell value to each sample in a seismic data set would require a very large number of degrees of freedom. Two approaches might be taken to train such a network: first, by invoking a massive and exhaustive training data set and, second, by working to reduce the degrees of freedom by enforcing physical constraints on the model-data relationship. The second approach is referred to as “physics-guiding.” Based on recent progress in wave theory-designed (i.e., physics-based) networks, we have developed a hybrid network design, involving deterministic, physics-based modeling and data-driven deep learning components. From an optimization standpoint, a data-driven model misfit (i.e., standard deep learning) and now a physics-guided data residual (i.e., a wave propagation network) are simultaneously minimized during the training of the network. An experiment is carried out to analyze the trade-off between two types of losses. Synthetic velocity building is used to examine the potential of hybrid training. Comparisons demonstrate that, given the same training data set, the hybrid-trained network outperforms the traditional fully data-driven network. In addition, we perform a comprehensive error analysis to quantitatively compare the fully data-driven and hybrid physics-guided approaches. The network is applied to the SEG salt model data, and the uncertainty is analyzed, to further examine the benefits of hybrid training."}