{"abstract":"For the sixth-generation (6G) mobile networks, in-situ model downloading has emerged as an important use case to enable real-time adaptive artificial intelligence (AI) on edge devices. However, the simultaneous downloading of diverse and high-dimensional models to multiple devices over wireless links presents a significant communication bottleneck. To overcome the bottleneck, we propose the framework of model broadcasting and assembling (MBA), which represents the first attempt on leveraging reusable knowledge, referring to shared parameters among tasks/models, to enable parameter broadcasting to reduce communication overhead or latency. The MBA framework comprises two key components. The first, the MBA protocol, defines the system operations including parameter selection from an AI library, power control for broadcasting, and model assembling at devices. The protocol features the use of Shapley value as a metric for measuring parameters’ reusability. The second component is the joint design of parameter-selection-and-power-control (PS-PC), which provides guarantees on devices’ model performance and aims to minimize the downloading latency. The corresponding optimization problem is simplified by decomposition into the sequential PS and PC sub-problems without compromising its optimality. The PS sub-problem is solved efficiently by designing two efficient algorithms. On one hand, the low-complexity algorithm of greedy parameter selection features the construction of task-oriented candidate model sets and a greedy selection metric for choosing the sets of model blocks for broadcasting, both of which are designed under the criterion of maximum reusable knowledge among tasks. On the other hand, the optimal tree-search algorithm gains its efficiency via the proposed construction of a compact binary tree pruned using model architecture constraints and an intelligent branch-and-bound search on the tree that fathoms nodes via solving a linear program that integer-relaxes the PS sub-problem. Last, given optimal PS, the optimal PC policy is derived in closed form by transforming the PC sub-problem into the conventional problem of energy-efficient transmission. Through extensive experiments conducted on real-world datasets, our results demonstrate the substantial reduction in downloading latency achieved by the proposed MBA design compared to traditional unicasting-based model downloading."}