{"abstract":"Resilience ranks high on the environmentally oriented research agenda on sustainable urban and regional development. The annual “Global Forum on Urban Resilience and Adaptation” has become a meeting point for academia and practice. The United Nations 2030 Agenda for Sustainable Development uses the term in two of their 17 Sustainable Development Goals, i.e., in Goal No. 9 on infrastructure as a basis for economic development and No. 11 on cities and human settlements. Moreover, resilience has become a prominent topic in the New Urban Agenda. Against this background, the article provides an overview of recent discussion on resilience. It scrutinizes how the concept has been used by different researchers from diverse disciplines with special reference to urban, regional and environmental studies. A systematic literature review on resilience was carried out in order to shed light on recent developments of thought and practice. All in all, 650 articles were reviewed. Following an introduction into the topic and description of the applied methodological approach, different facets of the debate on resilience are presented, and conclusions are drawn. It can be seen that the discussion of resilience needs more specificity, transdisciplinary approaches, and regional contextualization, especially in urban and regional development studies in the countries of the global south.ZusammenfassungResilienz ist zu einem Schlüsselbegriff in umweltorientierten Studien zur nachhaltigen Stadt- und Regionalentwicklung geworden. Das jährlich stattfindende „Global Forum on Urban Resilience and Adaptation“ ist inzwischen zu einer wichtigen Plattform von Wissenschaft und Praxis geworden. Die Agenda 2030 der Vereinten Nationen für nachhaltige Entwicklung benutzt den Resilienzbegriff bei zwei der 17 Nachhaltigkeitszielen: in Ziel 9 zum Aufbau einer belastbaren Infrastruktur als Basis für eine nachhaltige wirtschaftliche Entwicklung und in Ziel 11 zur nachhaltigen Entwicklung von Städten und Gemeinden. Darüber hinaus spielt Resilienz auch in der Neuen Urbanen Agenda eine große Rolle. Vor diesem Hintergrund gibt der Beitrag einen Überblick über die jüngere Diskussion zum Thema Resilienz. Er untersucht, wie das Resilienzkonzept von verschiedenen Wissenschaftlern aus unterschiedlichen Disziplinen verwendet worden ist. Dabei wird Studien zur Stadt‑, Regional- und Umweltentwicklung eine besondere Beachtung geschenkt. Grundlage der Arbeit ist eine systematische Literaturanalyse, bei der 650 Artikel inhaltlich ausgewertet wurden. Nach einer Einführung in das Thema und einer Erläuterung des methodischen Ansatzes der Studie werden unterschiedliche Facetten der Resilienzdiskussion und Schlussfolgerungen für die zukünftige Arbeit gezogen. Dabei zeigt sich, dass die Diskussion in Zukunft spezifischer geführt werden sollte. Sie braucht mehr Transdisziplinarität. Und sie benötigt eine stärkere ‚regionale‘ Kontextualisierung, insbesondere in Bezug auf Studien zur Stadt- und Regionalentwicklung in den Ländern des Globalen Südens."}