{"abstract":"\nPurpose\nThe dissemination of fake news has accelerated with social media and this has important implications for both organizations and their stakeholders alike. Hence, the purpose of this study is to shed light on the effectiveness of the crisis response strategies of denial and attack in addressing rumors about consumer privacy when non-profit organizations are targeted on social media.\n\n\nDesign/methodology/approach\nTo test the hypotheses, a 2 (response type: denial vs attack) × 2 (privacy concerns: low vs high), between-group online experiment was conducted via Qualtrics.\n\n\nFindings\nThe results indicated that one’s involvement level in the issue determines the effectiveness of the crisis response strategy. Data showed that attacking the source of fake news (as a crisis response) reduces the message’s credibility more than denying fake news. Furthermore, highly involved individuals are more likely to centrally process information and develop positive supportive intentions toward the affected non-profit brand. High issue involvement also predicted organizational and response credibility. Conversely, an attack rebuttal message increased the credibility of the circulated malicious rumors for low involved individuals.\n\n\nResearch limitations/implications\nThe findings suggest that issue involvement plays a key role in message perceptions of false information regarding consumer privacy in social media.\n\n\nPractical implications\nPractically, this study offers insights for organizations that are developing response strategies in the current environment of fake news. Findings from this study suggest that organizations need to consider the degree to which audiences are currently involved in an issue before deciding how aggressively to respond to perpetrators of fake news.\n\n\nOriginality/value\nThe present study examines the intersection of fake news and crisis management in the non-profit sector, with an emphasis on various response strategies and issue involvement. This is one of the first attempts to experimentally investigate how social media strategies can defend and protect non-profit reputation in the fake news era.\n"}