{"abstract":"Mindset reading of a student towards technology is a challenging task. The student’s demographic features prediction has a significant aspect for the learning activities in educational institutions. The current studies predicted the student’s native place based on technological awareness having various features such as development, availability, usability, educational benefits, etc. However,these studies have not explored the identification of sentiment identification about the technology through ML,optimization,etc.Motivated from these facts,in this paper, we propose a machine learning (ML) model with optimizing techniques to tune the hyper-parameters. In the proposed model, a primary dataset gathered from Indian and Hungarian universities, which analyzed with a Multi-Layer-Perceptron (MLP) with three popular optimization algorithms, such as Adaptive Moment Estimation (Adam), Stochastic Gradient Descent (SGD), Limited-memory Broyden-Fletcher-Goldfarb-Shanno (LBFGS). The optimized MLP has compared with the Support Vector Machine (SVM). Besides, numerous testing methods and to select the most prominent features, Principal Component Analysis (PCA) trained both models. Association of the Adam optimizer with the ReLu activation function in the MLP proved significant play in prediction with regularization. The PCA components covering most of the variance improved the optimized MLP accuracy with 2.3% and boosted the accuracy of the SVM with 2.9%. The Gain-ratio and the Info-gain suggested 11 features with significant weights. Both predictive models are found not only competitive but also outperformed with an identical prediction accuracy of 94% to identify the native place of the student. The Statistical t-test supported the equal predictive strength of both models and proved the significant enhancement in the SVM performance using the PCA components. Further, a considerable reduction is also achieved in the prediction error and prediction time to support the institute’s web-based real-time system. Based on deep experiments, we recommend the optimistic native identification models for the higher educational institutions to analyze the attitude and technical awareness among students based on their native place."}