{"abstract":"In this paper, a semantic communication framework for image data transmission is developed. In the investigated framework, a set of servers cooperatively transmit image data to a set of users utilizing semantic communication techniques, which enable servers to transmit only the semantic information that accurately captures the meaning of images. To evaluate the performance of studied semantic communication system, a multimodal metric called image-to-graph semantic similarity (ISS) is proposed to measure the correlation between the extracted semantic information and the original image. To meet the ISS requirement of each user, each server must jointly determine the semantic information to be transmitted and the resource blocks (RBs) used for semantic information transmission. Due to the co-channel interference among users associated with different servers, each server must cooperate with other servers to find a globally optimal semantic oriented RB allocation. We formulate this problem as an optimization problem whose goal is to minimize the sum of the average transmission latency of each server while reaching the ISS requirement. To solve this problem, we propose a value decomposition based entropy-maximized multi-agent reinforcement learning (RL) algorithm. The proposed algorithm enables each server to coordinate with other servers in training stage and execute RB allocation in a distributed manner to approach to a globally optimal performance with less training iterations. Compared to traditional multi-agent RL algorithms, the proposed RL framework improves the exploration of valuable action of servers and the probability of finding a globally optimal RB allocation policy based on local observation of wireless and semantic communication environments. Simulation results show that the proposed algorithm can reduce the transmission delay by up to 16.1% and improve the convergence speed by up to 100% compared to the traditional multi-agent RL algorithms."}