{"abstract":"In response to various privacy risks, researchers and practitioners have been exploring different paradigms that can leverage the\nincreased computational capabilities of consumer devices to train machine (ML) learning models in a distributed fashion without\nrequiring the uploading of the training data from individual devices to central facilities. For this purpose, federated learning (FL)\nwas proposed as a technique that can learn a global machine model at a central master node by the aggregation of models trained\nlocally using private data. However, organizations may be reluctant to train models locally and to share these local ML models\ndue to required computational resources for model training at their end and due to privacy risks that may result from adversaries\ninverting these models to infer information about the private training data. Incentive mechanisms have been proposed to motivate\nend users to participate in collaborative training of ML models (using their local data) in return for certain rewards. However, the\ndesign of an optimal incentive mechanism for FL is challenging due to its distributed nature and the fact that the central server\nhas no access to clients’ hyperparameters information and the amount/quality data used for training, which makes the task of\ndetermining the reward based on the contribution of individual clients in FL environment difficult. Even though several incentive\nmechanisms have been proposed for FL, a thorough up-to-date systematic review is missing and this paper fills this gap. According\nto the best of our knowledge, this paper is the first systematic review that comprehensively enlists the design principles required for\nimplementing these incentive mechanisms and then categorizes various incentive mechanisms according to their design principles.\nIn addition, we also provide a comprehensive overview of security challenges associated with incentive-driven FL. Finally, we\nhighlight the limitations and pitfalls of these incentive schemes and elaborate upon open-research issues that required further\nresearch attention."}