{"abstract":"Semantic communication (SC) is an effective approach to communicate reliably with minimal data transfer while simultaneously providing seamless connectivity. In this paper, a novel emergent SC (ESC) framework is proposed. This ESC system is composed of two key components: A signaling game for emergent language design and a neuro-symbolic (NeSy) artificial intelligence (AI) approach for causal reasoning. In order to design the language, the signaling game is solved using an alternating maximization between the transmit and receive nodes utilities. The generalized Nash equilibrium is characterized, and it is shown that the resulting transmit and receive signaling strategies lead to a local equilibrium solution. As such, the emergent language not only creates an efficient (in physical bits transmitted) transmit vocabulary dependent on communication contexts but it also aids the reasoning process (and enables generalization to unseen scenarios) by splitting complex received messages into simpler reasoning tasks for the receiver. The causal description (symbolic component) at the transmitter is then modeled using the emerging AI framework of generative flow networks (GFlowNets), whose parameters are optimized for higher semantic reliability. Using the reconstructed causal state, the receiver evaluates a set of logical formulas (symbolic part) to execute its task. This evaluation of logical formulas is done by combining GFlowNet, with the logical expressiveness of the symbolic structure, inspired from logical neural networks. The ESC system is also designed to enhance the novel semantic metrics of information, reliability, distortion and similarity that are designed using rigorous algebraic properties from category theory thereby generalizing the metrics beyond Shannon’s notion of uncertainty. Simulation results confirm that the ESC system effectively communicates with reduced bits and achieves superior semantic reliability compared to conventional wireless systems and state-of-the-art SC systems lacking causal reasoning capabilities. Additionally, the overhead involved in language creation diminishes over time, validating the system’s ability to generalize across multiple tasks."}