{"abstract":"The appearance of the 2019 novel coronavirus (Covid-19), for which there is no treatment or a vaccine, formed a sense of necessity for new drug discovery advances. The pandemic of NCOV-19 (novel coronavirus-19) has been engaged as a public health disaster of overall distress by the World Health Organization. Different pandemic models for NCOV-19 are being exploited by researchers all over the world to acquire experienced assessments and impose major control measures. Among the standard techniques for NCOV-19 global outbreak prediction, epidemiological and simple statistical techniques have attained more concern by researchers. Insufficiency and deficiency of health tests for identifying a solution became a major difficulty in controlling the spread of NCOV-19. To solve this problem, deep learning has emerged as a novel solution over a dozen of machine learning techniques. Deep learning has attained advanced performance in medical applications. Deep learning has the capacity of recognizing patterns in large complex datasets. They are identified as an appropriate method for analyzing affected patients of NCOV-19. Conversely, these techniques for disease recognition focus entirely on enhancing the accurateness of forecasts or classifications without the ambiguity measure in a decision. Knowing how much assurance present in a computer-based health analysis is necessary for gaining clinicians’ expectations in the technology and progress treatment consequently. Today, NCOV-19 diseases are the main healthcare confront throughout the world. Detecting NCOV-19 in X-ray images is vital for diagnosis, treatment, and evaluation. Still, analytical ambiguity in a report is a difficult yet predictable task for radiologists. In this paper, an in-depth analysis has been performed on the significance of deep learning for Covid-19 and as per the standard search database, this is the first review research work ever made concentrating particularly on Deep Learning for NCOV-19. The main aim behind this research work is to inspire the research community and to innovate novel research using deep learning. Moreover, the outcome of this detailed structured review on the impact of deep learning in covid-19 analysis will be helpful for further investigations on various modalities of diseases detection, prevention and finding novel solutions."}