{"abstract":"Blockchain technology is affected by massive limitations in scalability with consequent repercussions on performance. This discussion aims at analyzing the state of the art of current available Layer II solutions to overcome these limitations, both focusing on theoretical and practical aspects and highlighting the main differences among the examined frameworks. The structure of the work is based on three major sections. In particular, the first one is an introductory part about the technology, the scalability issue and Layer II as a solution. The second section represents the core of the discussion and consists of three different subsections, each with a detailed examination of the respective solution (Lightning Network, Plasma, Rollups); the analysis of each solution is based on how it affects five key aspects of blockchain technology and Layer II: scalability, security, decentralization, privacy, fees and micropayments (the last two are analyzed together given their high correlation). Finally, the third section includes a tabular summary, followed by a detailed description of a use-case specifically thought for a practical evaluation of the presented frameworks. The results of the work met expectations: all solutions effectively contribute to increasing scalability. A crucial clarification is that none of the three dominates the others in all possible fields of application, and the consequences in adopting each, are different. Therefore, the choice depends on the application context, and a trade-off must be found between the aspects previously mentioned. ar X iv :2 10 7. 10 88 1v 1 [ cs .D C ] 2 2 Ju l 2 02 1 1 Blockchain Introduction In its most basic meaning, Blockchain technology consists of a decentralized public ledger capable of keeping a record of immutable (and linked) information. However, the original goal of this technology, as stated in the original Bitcoin white paper written by Satoshi Nakamoto, is to provide a trustless electronic payment system that does not rely on any third-party authority to manage disputes between actors. The trust, which is needed in traditional cash systems, can be replaced by cryptographic proofs. Such a system can be implemented as a peer-to-peer network of nodes, in which a certain number of transactions are periodically bundled into blocks. Blocks are hashed to generate timestamps and every block includes the hash of the previous block. This mechanism forms a chain of timestamped information that, in this context, is represented by transactions. All the generated blocks are propagated across the network and locally stored by each node; in this way every node can act as a validator of transactions, and the so-called double spending problem can be solved. To allow peer-to-peer direct payments, transactions must be computationally infeasible to reverse: this is allowed by the proof-of-work mechanism, in which every node interested in generating new blocks (also called miners) search for a value that, when hashed using a particular hash algorithm, has certain properties. For instance, as in the Bitcoin protocol, this could involve the fact that the resulting hash must have a certain number of leading zeros. Miners are then incentivized to sustain the network by collecting the fees that users spend to execute transactions, thus improving the global hashrate of the Blockchain. Thanks to this paradigm, combined with the fact that nodes consider the longest chain to be the valid state, once a block has been generated and the computation has been performed, changing the block would require redoing the proof-of-work for both the specific block and all subsequent ones. This system has proven to be secure as soon as honest nodes hold the majority of the network computational power: in this case, honest participants will generate the longest chain, which will be accepted as the true state of the Blockchain, not allowing attackers to create malicious blocks. It is common to identify three different generations of Blockchains: • First generation: Blockchains that allow decentralized monetary system and ledger of transactions. An example is the Bitcoin Blockchain. • Second generation: Blockchains with support for running smart contracts (e.g. Ethereum). These Blockchains are decentralized platforms which can be used to run programs in a decentralized fashion, to achieve complex functionalities without the need for a central authority (such as an Application Server)."}