{"abstract":"Objective: Physiological networks (PN) model couplings between organs in a high-dimensional parameter space. Machine learning methods, in particular artifical neural networks (ANNs), are powerful on high-dimensional classification tasks. However, lack of interpretability of the resulting models has been a drawback in research. We assess relevant PN topology changes in obstructive sleep apnea (OSA) by novel ANN interpretation techniques. Approach: ANNs are trained to classify OSA based on the PNs of 48 patients and 48 age and gender matched healthy controls. The PNs consisting of 2812 links are derived from overnight biosignal recordings. The interpretation technique DeepLift is applied to the resulting ANN models, enabling the determination of the relevant features for classification decisions on individual subjects. The mean relevance scores of the features are compared to other machine learning methods (decision tree and random forests) and statistical tests on group differences. Main results: The ANN interpretation results show good agreement with the compared methods and 87% of the samples could be correctly classified. OSA patients show a significantly higher coupling (p 0.001) in light sleep (N2) between breathing rate and EEG power in all electrode locations and to chin and leg muscular tone. In deep sleep (N3), OSA leads to significantly lower coupling (p 0.01) in lateral connections of EEG and power in central and frontal positions. Misclassified OSA patients had all mild/moderate AHIs and did not show PN topology changes. Both nights of these patients have been consistently misclassified as healthy. This may indicate, that the impact of respiratory events differs in subjects, thus forming different phenotypes. Significance: The proposed PN analysis provides a powerful and robust method to quantify a broad range of physiological interactions. Interpretability of the ANN make them a promising tool to identify new diagnostic markers in data-driven approaches."}