{"abstract":"Mindboggle (http://mindboggle.info) is an open source brain morphometry platform that takes in preprocessed T1-weighted MRI data and outputs volume, surface, and tabular data containing label, feature, and shape information for further analysis. In this article, we document the software and demonstrate its use in studies of shape variation in healthy and diseased humans. The number of different shape measures and the size of the populations make this the largest and most detailed shape analysis of human brains every conducted. Brain image morphometry shows great potential for providing much-needed biological markers for diagnosing, tracking, and predicting progression of mental health disorders. Very few software algorithms provide more than measures of volume and cortical thickness, and more subtle shape measures may provide more sensitive and specific biomarkers. Mindboggle computes a variety of (primarily surface-based) shapes: area, volume, thickness, curvature, depth, Laplace-Beltrami spectra, Zernike moments, etc. We evaluate Mindboggle’s algorithms using the largest set of manually labeled, publicly available brain images in the world and compare them against state-of-the-art algorithms where they exist. All data, code, and results of these evaluations are publicly available. Author Summary Brains vary in many ways, including their shape. Analysing differences in shape between brains or changes in brain shape over time has been used to characterize morphology of diseased brains, but these analyses conventionally rely on simple volumetric shape measures. We believe that access to a greater variety of shape measures could provide greater sensitivity and specificity to morphological disturbances, and could aid in diagnosis, tracking, and prediction of the progression of mental health disorders. Mindboggle is open source software that provides neuroscientists (and indeed, anyone interested in computing shapes) tools for computing a variety of shape measures, including area, volume, thickness, curvature, geodesic depth, travel depth, Laplace-Beltrami spectra, and Zernike moments. In addition to algorithmic contributions, we conducted evaluations and applied Mindboggle to conduct the most detailed shape analysis of human brains."}