{"abstract":"Accurate prediction of antibody-antigen complex structures holds significant potential for advancing biomedical research and the design of therapeutic antibodies. Currently, structure prediction for protein monomers has achieved considerable success, and promising progress has been made in extending this achievement to the prediction of protein complexes. However, despite these advancements, fast and accurate prediction of antibody-antigen complex structures remains a challenging and unresolved issue. Existing end-to-end prediction methods, which rely on homology and templates, exhibit sub-optimal accuracy due to the absence of co-evolutionary constraints. Meanwhile, conventional docking-based methods face difficulties in identifying the contact interface between the antigen and antibody and require known structures of individual components as inputs. In this study, we present a fully end-to-end approach for three-dimensional (3D) atomic-level structure predictions of antibodies and antibody-antigen complexes, referred to as tFold-Ab and tFold-Ag, respectively. tFold leverages a large protein language model to extract both intra-chain and inter-chain residue-residue contact information, as well as evolutionary relationships, avoiding the time-consuming multiple sequence alignment (MSA) search. Combined with specially designed modules such as the AI-driven flexible docking module, it achieves superior performance and significantly enhanced speed in predicting both antibody (1.6% RMSD reduction in the CDR-H3 region, thousand times faster) and antibody-antigen complex structures (37% increase in DockQ score, over 10 times faster), compared to AlphaFold-Multimer. Given the performance and speed advantages, we further extend the capability of tFold for structure-based virtual screening of binding antibodies, as well as de novo co-design of both structure and sequence for therapeutic antibodies. The experiment results demonstrate the potential of tFold as a high-throughput tool to enhance processes involved in these tasks. To facilitate public access, we release code and offer a web service for antibody and antigen-antibody complex structure prediction, which is available at https://drug.ai.tencent.com/en."}