{"abstract":"Accurate and timely air quality and weather predictions are of great importance to urban governance and human livelihood. Though many efforts have been made for air quality or weather prediction, most of them simply employ one another as feature input, which ignores the inner-connection between two predictive tasks. On one hand, the accurate prediction of one task can help improve another task's performance. On the other hand, geospatially distributed air quality and weather monitoring stations provide additional hints for city-wide spatiotemporal dependency modeling. Inspired by the above two insights, in this paper, we propose a multi-view multi-adversarial approach, entitled MasterGNN<inline-formula><tex-math notation=\"LaTeX\">$^{+}$</tex-math><alternatives><mml:math><mml:msup><mml:mrow/><mml:mo>+</mml:mo></mml:msup></mml:math><inline-graphic xlink:href=\"liu-ieq1-3236423.gif\"/></alternatives></inline-formula>, to jointly predict air quality and weather conditions. First, we devise a multi-view graph learning block to model spatial autocorrelation based on geographical distance and environmental context. Then, a dedicated evolved recurrent network is proposed to dynamically capture the long-range and independent temporal autocorrelation for each monitoring station and time slot. After that, we develop a multi-adversarial graph learning framework to against observation noise propagation introduced by spatiotemporal modeling. Moreover, we present an adaptive training strategy by formulating multi-adversarial learning as a multi-task learning problem. Finally, extensive experiments on two real-world datasets show that MasterGNN<inline-formula><tex-math notation=\"LaTeX\">$^{+}$</tex-math><alternatives><mml:math><mml:msup><mml:mrow/><mml:mo>+</mml:mo></mml:msup></mml:math><inline-graphic xlink:href=\"liu-ieq2-3236423.gif\"/></alternatives></inline-formula> achieves the best performance compared with seven baselines on both air quality and weather prediction tasks."}