{"abstract":"In lieu of an abstract, here is the entry's first paragraph: Robust statistics are procedures that maintain nominal Type I error rates and statistical power in the presence of violations of the assumptions that underpin parametric inferential statistics. Since George Box coined the term in 1953, research on robust statistics has centered on the assumption of normality, although the violation of other parametric assumptions (e.g., homogeneity of variance) has their own implications for the accuracy of parametric procedures. This entry looks at the importance of robust statistics in educational and social science research and explains the robustness argument. It then describes robust descriptive statistics, their inferential extensions, and two common resampling procedures that are robust alternatives to classic parametric methods. Disciplines Statistics and Probability Comments This is an entry in: Frey, B. (2018). The SAGE encyclopedia of educational research, measurement, and evaluation (Vols. 1-4). Thousand Oaks,, CA: SAGE Publications, Inc.: https://dx.doi.org/10.4135/ 9781506326139 © 2018 by SAGE Publications, republished with permission. Content may not be distributed, resold, repurposed, used for commercial MOOCs, nor any other commercial purposes without permission. Please contact SAGE for any further usage or questions. This article is available at Fisher Digital Publications: https://fisherpub.sjfc.edu/statistics_facpub/8 1434 Robust Statistics Couch, A., & Keniston, K. (1960). Yeasayers and naysayers: Agreeing response set as a personality variable. Journal of Abnormal and Social Psychology, 60, 151-174. Gosling, S. D., Rentfrow, P. ]., & Swann, W. B., Jr. (2003). A very brief measure of the Big-Five personality domains. Journal of Research in Personality, 37, 504-528. Llorente, E., Warren, C. S., de Eulate, L. P., & Gleaves, D. H. (2013 ). A Spanish version of the sociocultural attitudes towards appearance questionnaire-3 (SATAQ-3 ): Translation and psychometric evaluation. Journal of Clinical Psychology, 69(3 ), 240-251. doi: 10.1002/jclp.21944 Rodebaugh, T. L, Woods, C. M, Heimberg, R. G., Liebowitz, M. R., & Schneier, F. R. (2006). The factor structure and screening utility of the Social Interaction Anxiety Scale. Psychological Assessment, 18(2), 231-237. Tay, L., & Drasgow, F. (2012). Theoretical, statistical, and substantive issues in the assessment of construct dimensionality: Accounting for the item response process. Organizational Research Methods, 15(3), 363-384. VonSonderen, E., Sanderman, R., & Coyne, J.C. (2013). Ineffectiveness of reverse wording of questionnaire items: Let's learn from cows in the rain. PloSONE, 8(7), e68967. doi:l0.1371/journal.pone.0068967 Weijters, B., Baumgartner, H., & Schillewaet, N. (2013). Reversed item bias: An integrative model. Psychological Method, 18(3), 320-334. doi:l0.1037/"}