{"abstract":"Under debt obligation promises, small- and medium-sized enterprises (SMEs) can guarantee each other to enhance their financial security to get loans from commercial banks. When the economy rises, the banks may reduce the threshold to some extent, which may introduce default risk during the economy down period, especially when many SMEs bind together and form complex networks. The risk may diffuse across the guarantee network and may result in a financial crisis. Macroprudential oversight of the guarantee network to eliminate any potential systematics financial risk is the central task of the regulatory commission and the commercial banks. Based on our observation, the delinquent probability of an SME depends not only on self-financial status but also highly related to its temporal behaviors and structural position in networks. The classic approach for loan assessment criteria face challenges in extracting temporal and structural patterns from dynamic networks. To address these issues, we propose a temporal delinquent event prediction (TDEP) framework that preserves temporal network structures and credit behavior sequences in an end-to-end model. In particular, we first employ a graph attention layer to learn the representation of nodes in temporal guarantee networks. We then design a recursive and self-attention mechanism to integrate both credit behavior and network structure information. The learned attentional weights are leveraged to uncover high-risk guarantee patterns that effectively accelerate the risk assessment process. Afterward, we conduct extensive experiments in a real-world guaranteed-loan data set to evaluate its performance. The results show the effectiveness of our proposed approach compared with the state-of-the-art baselines. Finally, we integrate the proposed model in a real-world loan risk management system. We present the implementation details of each subcomponent of the system and report out the performance after online deployment."}