{"abstract":"Abstract A knowledge graph is a structured representation of data that can express entity and relational knowledge. More attention has been paid to the study of a clinical knowledge graph, especially in the field of chronic diseases. However, knowledge graph construction is based mainly on electronic medical records and other data sources, and the authority of the constructed knowledge graph presents some problems. Therefore, regarding the quality of evidence, this study, in combination with experimental research on system evaluation and meta-analysis presents some new information, On the basis of evidence-based medicine (EBM), the secondary results of systematic evaluation and meta-analyses of social, psychological, and behavioral aspects were extracted as data for the core nodes and edges of a knowledge graph to construct a graph of type 2 diabetes (T2D) and its complications. In this study, relevant life-style evidence that are factors for the risk of diabetic retinopathy (DR), diabetic nephropathy (DN), diabetic foot (DF), and diabetic depression (DD), and the results of several of the relevant clinical test, including bariatric surgery, myopia, lipid-lowering drugs, lipid-lowering drug duration, blood glucose control, disease course, glycosylated hemoglobin, fasting blood glucose, hypertension, sex, smoking and other common lifestyle characteristics were finally extracted. The evidence-based knowledge graph of the DM complications was constructed by extracting relevant disease, risk factors, risk outcomes, and other diabetes entities and the strength of the data for the odds ratio (OR) or relative risk (RR) correlations from clinical evidence. Moreover, the risk prediction models constructed using a logistic model were incorporated into the knowledge graph to visualize the risk score of DM complications for each user. In short, the EBM-powered construction of the knowledge graph could provide high-quality information to support decisions for the prevention and control of diabetes and its complications."}