{"abstract":"Precision medicine aims to provide diagnosis and treatment accounting for individual differences. To develop machine learning models in support of precision medicine, personalized models are expected to have better performance than one-model-fits-all approaches. A significant challenge, however, is the limited number of labeled samples that can be collected from each individual due to practical constraints. Transfer Learning (TL) addresses this challenge by leveraging the information of other patients with the same disease (i.e., the source domain) when building a personalized model for each patient (i.e., the target domain). We propose Weakly-Supervised Transfer Learning (WS-TL) to tackle two challenges that existing TL algorithms do not address well: (i) the target domain has only a few or even no labeled samples; (ii) how to integrate domain knowledge into the TL design. We design a novel mathematical framework of WS-TL to learn a model for the target domain based on paired samples whose order relationships are inferred from domain knowledge, while at the same time integrating labeled samples in the source domain for transfer learning. Also, we propose an efficient active sampling strategy to select informative paired samples. Theoretical properties were investigated. Finally, we present a real-world application in precision medicine of brain cancer, where WS-TL is used to build personalized patient models to predict Tumor Cell Density (TCD) distribution across the brain based on MRI images. WS-TL has the highest accuracy compared to a variety of existing TL algorithms. The predicted TCD map for each patient can help facilitate individually optimized treatment. Note to Practitioners—This work was motivated by Precision Medicine applications that need to build personalized machine learning models to account for individual differences. Due to limited data from each person, Transfer Learning (TL) provides a promising approach, which can leverage the information of other patients with the same disease (i.e., the source domain) when building a personalized model for each patient (i.e., the target domain). The proposed WS-TL model addresses the application scenarios with two unique properties: (i) the target domain has a few and even no labeled samples, which is a challenging situation that most existing TL methods do not address well; (ii) there is domain knowledge to provide weak labels for a large number of unlabeled samples in the form of order relationships, which provides an opportunity to integrate the domain knowledge into the TL design. We demonstrate WS-TL in a Precision Medicine application for brain cancer and show promising results. WS-TL has the potential of addressing a broad range of other application areas in building personalized models."}