{"abstract":"Diffusion magnetic resonance imaging (dMRI) provides a noninvasive method for measuring brain tissue microstructure. q-Space deep learning(q-DL) methods have been developed to accurately estimate tissue microstructure from dMRI scans acquired with a reduced number of diffusion gradients. In these methods, deep networks are trained to learn the mapping directly from diffusion signals to tissue microstructure. However, the quality of tissue microstructure estimation can be limited not only by the reduced number of diffusion gradients but also by the low spatial resolution of typical dMRI acquisitions. Therefore, in this work we extend q-DL to super-resolved tissue microstructure estimation and propose super-resolvedq-DL (SR-q-DL), where deep networks are designed to map low-resolution diffusion signals undersampled in the q-space to high-resolution tissue microstructure. Specifically, we use a patch-based strategy, where a deep network takes low-resolution patches of diffusion signals as input and outputs high-resolution tissue microstructure patches. The high-resolution patches are then combined to obtain the final high-resolution tissue microstructure map. Motivated by existing q-DL methods, we integrate the sparsity of diffusion signals in the network design, which comprises two functional components. The first component computes sparse representation of diffusion signals for the low-resolution input patch, and the second component maps the low-resolution sparse representation to high-resolution tissue microstructure. The weights in the two components are learned jointly and the trained network performs end-to-end tissue microstructure estimation. In addition to SR-q-DL, we further propose probabilistic SR-q-DL, which can quantify the uncertainty of the network output as well as achieve improved estimation accuracy. In probabilistic SR-q-DL, a deep ensemble strategy is used. Specifically, the deep network for SR-q-DL is revised to produce not only tissue microstructure estimates but also the uncertainty of the estimates. Then, multiple deep networks are trained and their results are fused for the final prediction of high-resolution tissue microstructure and uncertainty quantification. The proposed method was evaluated on two independent datasets of brain dMRI scans. Results indicate that our approach outperforms competing methods in terms of estimation accuracy. In addition, uncertainty measures provided by our method correlate with estimation errors, which indicates potential application of the proposed uncertainty quantification method in brain studies."}