{"abstract":"Objective. Attention-deficit/hyperactivity disorder (ADHD) is one of the most prevalent neurobehavioral disorders. Studies have tried to find the neural correlations of ADHD with electroencephalography (EEG). Due to the heterogeneity in the ADHD population, a multivariate EEG profile is useful, and the detection of a personalized abnormality in EEG is urgently needed. Deep learning algorithms, especially convolutional neural network (CNN), have made tremendous progress recently, and are expected to solve the problem. Approach. We adopted CNN techniques and a visualization technique named gradient-weighted class activation mapping (Grad-CAM) for detecting a personalized spatial-frequency abnormality in EEGs of ADHD children. A total of 50 children with ADHD (nine girls, mean age: 10.44  ±  0.75) and 57 controls who were matched for age and handedness were recruited. The power spectrum density of EEGs was used as input. We presented an intuitive form of representing multichannel EEG data that is trainable to CNN models. Personalized abnormalities were derived from ADHD children and were compared to the distributions of relative powers in different frequency bands. Main results. We demonstrated that applying CNN techniques to ADHD identification is feasible, with an accuracy of 90.29%  ±  0.58%. There were major differences in personalized spatial-frequency abnormalities between individuals affected by ADHD. The abnormalities were consistent with the power distributions in both group- and individual- level. Significance. This study provided a novel method for detecting personalized spatial-frequency abnormalities of children with ADHD at a precise spatial-frequency resolution. We proposed a new form of representation of multichannel EEG data that is compatible with mainstream CNN architectures. We ensured that CNN models were interpretable and reliable relating to clinical practice by visualizing the decision-making process. We expect that detection of personalized abnormalities using deep learning techniques can facilitate the identification of potential neural pathways and the planning of targeted treatments for children with ADHD."}