{"abstract":"“Social facilitation” refers to the enhancement or impairment of performance engendered by the mere presence of others. It has been demonstrated for a diversity of behaviors. This study assessed whether it also concerns attention and eye movements and if yes, which decision-making mechanisms it affects. Human volunteers were tested in three different tasks (saccades, visual search, and continuous performance) either alone or in the presence of a familiar peer. The results failed to reveal any significant peer influence on the visual search and continuous performance tasks. For saccades, by contrast, they showed a negative or positive peer influence depending on the complexity of the testing protocol. Pro-and anti-saccades were both inhibited when pseudorandomly mixed, and both facilitated when performed separately. Peer presence impaired or improved reaction times, i.e., the speed to initiate the saccade, as well as peak velocity, i.e., the driving force moving the eye toward the target. Effect sizes were large, with Cohen’s d-values ranging for reaction times (RTs) from 0.50 to 0.95. Analyzing RT distributions using the LATER (Linear Approach to Threshold with Ergodic Rate) model revealed that social inhibition of pro- and anti-saccades in the complex protocol was associated with a significant increase in the rate of rise. The present demonstration that the simple presence of a familiar peer can inhibit or facilitate saccades depending on task difficulty strengthens a growing body of evidence showing social modulations of eye movements and attention processes. The present lack of effect on visual search and continuous performance tasks contrasts with peer presence effects reported earlier using similar tasks, and future studies are needed to determine whether it is due to an intermediate level of difficulty maximizing individual variability. Together with an earlier study of the social inhibition of anti-saccades also using the LATER model, which showed an increase of the threshold, the present increase of the rate of rise suggests that peer presence can influence both the top-down and bottom-up attention-related processes guiding the decision to move the eyes."}