{"abstract":"Most SAR image target recognition is based on closed sets. However, in practical applications, the more extensive situations are open set recognition. In open set recognition, the categories of training data and testing data are not exactly the same, which requires the classifier to recognize the trained categories and mark the unseen categories as unknown. Existing open set recognition algorithms have a serious imbalance in the recognition rate of seen and unseen categories. Studies have shown that this imbalance situation comes from the distortion of imagination of unseen categories. Therefore, the counterfactual framework can be used to realize the fidelity of counterfactual generation based on sample features, which also avoids unrealistic imagination of unseen categories. The main part of the counterfactual generation framework is the counterfactual generation model, which generates images based on specific sample features instead of Gaussian noise. The loss function of the generation model is composed of reconstruction loss, contrastive loss, and KL divergence, which realizes the decoupling between sample features and category features. The contrastive loss function is used to measure the distance between images. A counterfactual image is generated by combining a certain sample feature with different categories. Therefore, the feature distance between a sample and its corresponding counterfactual image should be far. As a consequence, in the open set recognition, if the input sample is far away from the generated counterfactual sample, the sample is considered to belong to an unseen category, and it is marked as unknown. On the contrary, the classifier obtained by supervised learning is used to classify the seen sample and obtain its corresponding category. Experimental results show that the proposed method is better than other existing open set recognition algorithms, which can relieve the imbalance recognition rate of seen and unseen categories."}