{"abstract":"There are two traditional data trading modes, the hosting mode, and the aggregation mode, which depend on the trusted third parties to a large extent. The hosting mode is that the data are completely hosted in the data trading center, so the data trading center retains the data. On the surface, the aggregation mode is that the data trading center is not to retain the data of trading, but actually, it has the ability to retain the data. There is a fundamental difference between the ability to retain the data and the inability to retain the data. These two trading modes cause the data owners to be afraid to share data trading. In this paper, we propose a solution to the data trading mode based on the smart contract using blockchain and machine learning. Our solution takes advantage of the immutability, tamper-proof and traceability of blockchain, the programmability of smart contract, and the verification of data availability by the similarity learning to propose a challenge response mechanism between the data purchaser and the data owner, an off-chain download mechanism between the data purchaser and the data storage service provider, and an arbitration mechanism for the controversy resolution of the data trading. The challenge response mechanism is used to authenticate and authorize the data owner, the off-chain download mechanism is used to authenticate and authorize the data purchaser to download the purchased data, and the similarity learning is used to deal with the controversy over the data availability in the data trading. The design and implementation of data trading smart contract successfully achieved the goal of removing the trusted third party in the data trading, and thus, the problem that the data trading center has the ability to retain the data in the process of the data trading is solved, as well as the automatic payment by using the Ethereum encrypted currency among the trading participants is realized. This paper presents the whole process of smart contract from the design and implementation to the test completion and provides the security analysis and performance evaluation. The full code of smart contract and the ABI interface have been uploaded to the GitHub for the public release."}