{"abstract":"\nPurpose\nThe continuous spread of the corona virus disease 2019 (COVID-19) pandemic has generated public health concern with avalanche of information accompanied by series of fake news. Thus, this study examined the effect of Information Literacy Competency (ILC) in curtailing the spread of fake news among Library and Information Science (LIS) undergraduates in Nigeria.\n\n\nDesign/methodology/approach\nSurvey research design of the descriptive type was used to generate data from a group of LIS undergraduates online. The population of the study consisted of 138 LIS undergraduate students who participated in the survey (thus, n = 138). The data retrieved was subjected to descriptive analysis.\n\n\nFindings\nThe study revealed that the students had high level of ILC (x ¯ = 3.42), and there was low prevalence level of COVID-19 pandemic fake news (x ¯ = 2.35) among them. The major causes of COVID-19 fake news were too much information in circulation concerning COVID-19 (x ¯ = 3.44) and the resultant inability to discern or spot fake news from verified and authentic news (x ¯ = 3.28). The study also revealed that ILC had a significant effect in curtailing the spread of COVID-19 fake news with a grand mean of 3.28 against the criterion mean of 2.5. It is implied that LIS undergraduates are educationally position to acquire ILC which is crucial to their identification of fake news and helps to curtail its spread.\n\n\nResearch limitations/implications\nThe study is limited in its use of online group for data elicitation within a limited period of three weeks. Also, in its adoption of self-evaluation scale to measure ILC instead of standard information literacy test. Also, the high chances of social desirability bias in sections C and E serve as a limitation to the study.\n\n\nPractical implications\nThe study reinforces the need to enhance structures that flags fake news on social media platforms and integrating IL into schools’ curriculum at all levels.\n\n\nOriginality/value\nThis study seeks to pioneer a new area of focus on the relevance of ILC to different global issues that concern the health and well-being.\n"}