{"abstract":"Visual object tracking has played a crucial role in computer vision with many applications. Being intensively studied in recent decades, visual tracking has witnessed great advances in either speed (e.g., with correlation filters) or accuracy (e.g., with deep features). Real-time and high accuracy tracking algorithms, nevertheless, remain scarce. In this paper, we study the problem from a new perspective and present a novel <italic>parallel tracking and verifying</italic> (PTAV) framework, by taking advantage of the ubiquity of multi-thread techniques and borrowing ideas from the success of <italic>parallel tracking and mapping</italic> in visual SLAM. The proposed PTAV framework typically consists of two components, a (base) tracker <inline-formula> <tex-math notation=\"LaTeX\">$\\mathcal {T}$ </tex-math></inline-formula> and a verifier <inline-formula> <tex-math notation=\"LaTeX\">$\\mathcal {V}$ </tex-math></inline-formula>, working in parallel on two separate threads. The tracker <inline-formula> <tex-math notation=\"LaTeX\">$\\mathcal {T}$ </tex-math></inline-formula> aims at providing a super real-time tracking inference and is expected to perform well most of the time; by contrast, the verifier <inline-formula> <tex-math notation=\"LaTeX\">$\\mathcal {V}$ </tex-math></inline-formula> validates the tracking results and corrects <inline-formula> <tex-math notation=\"LaTeX\">$\\mathcal {T}$ </tex-math></inline-formula> when needed. The key innovation is that <inline-formula> <tex-math notation=\"LaTeX\">$\\mathcal {V}$ </tex-math></inline-formula> does not work on every frame but only upon the requests from <inline-formula> <tex-math notation=\"LaTeX\">$\\mathcal {T}$ </tex-math></inline-formula>; on the other end, <inline-formula> <tex-math notation=\"LaTeX\">$\\mathcal {T}$ </tex-math></inline-formula> may adjust the tracking according to the feedback from <inline-formula> <tex-math notation=\"LaTeX\">$\\mathcal {V}$ </tex-math></inline-formula>. With such collaboration, PTAV enjoys both high efficiencies provided by <inline-formula> <tex-math notation=\"LaTeX\">$\\mathcal {T}$ </tex-math></inline-formula> and strong discriminative power by <inline-formula> <tex-math notation=\"LaTeX\">$\\mathcal {V}$ </tex-math></inline-formula>. Meanwhile, in order to adapt <inline-formula> <tex-math notation=\"LaTeX\">$\\mathcal {V}$ </tex-math></inline-formula> to object appearance changes, we maintain a dynamic target template pool for adaptive verification, resulting in further improvement. In our extensive experiments on OTB2015, TC128, UAV20L, and VOT2016, PTAV achieves top tracking accuracy among all real-time trackers, and in fact, even outperforms many deep learning-based algorithms. Moreover, as a general framework, PTAV is very flexible with great potentials for future improvement and generalization."}