{"abstract":"As the total value of the global financial market outgrew the value of the real economy, financial institutions created a global web of interactions that embodies systemic risks. Understanding these networks requires new theoretical approaches and new tools for quantitative analysis. Statistical physics contributed significantly to this challenge by developing new metrics and models for the study of financial network structure, dynamics, and stability and instability. In this Review, we introduce network representations originating from different financial relationships, including direct interactions such as loans, similarities such as co-ownership and higher-order relations such as contracts involving several parties (for example, credit default swaps) or multilayer connections (possibly extending to the real economy). We then review models of financial contagion capturing the diffusion and impact of shocks across each of these systems. We also discuss different notions of ‘equilibrium’ in economics and statistical physics, and how they lead to maximum entropy ensembles of graphs, providing tools for financial network inference and the identification of early-warning signals of system-wide instabilities. The interconnectedness of the financial system is increasing over time, and modelling it as a network captures key interactions between financial institutions. This Review surveys the most successful applications of statistical physics and complex networks to the description and understanding of financial networks. Modelling the financial system as a network is crucial to capture the complex interactions between financial institutions. Such a network is naturally a time-dependent multiplex, because relationships between financial institutions are of many different kinds and keep changing. Models of financial contagion enable understanding of how shocks propagate from one financial institution to another. Missing information on financial networks can be ‘reconstructed’ using maximum entropy approaches borrowed from statistical mechanics. Techniques based on financial networks have been adopted by practitioners and policy institutions. Modelling the financial system as a network is crucial to capture the complex interactions between financial institutions. Such a network is naturally a time-dependent multiplex, because relationships between financial institutions are of many different kinds and keep changing. Models of financial contagion enable understanding of how shocks propagate from one financial institution to another. Missing information on financial networks can be ‘reconstructed’ using maximum entropy approaches borrowed from statistical mechanics. Techniques based on financial networks have been adopted by practitioners and policy institutions."}