{"abstract":"Mobile robots are expected to move safely and efficiently in socially-compliant ways in dense crowds. In this paper, a unified multiple-motion-mode framework is proposed to achieve socially-compliant navigation in dense crowds. The proposed framework consists of three successive phases, the identification of pedestrian groups and prediction of their trajectories, the generation of candidate local trajectories of the robot, and the determination of an optimal local trajectory. The pedestrians are grouped according to distances among pedestrians and their velocities and a predictor predicts the groups’ trajectories. Three robot motion modes, moving-solo, pedestrian-following, and courteous-stopping, are proposed based on a systematic analysis and classification of dense crowds and they are utilized to generate candidate local trajectories. A composite metric is proposed to determine the best local trajectory by simultaneously considering the robot motion safety, efficiency, and stability of the trajectory. The proposed robot navigation framework is evaluated both in simulations and real-world experiments with various scenarios. The results show that the proposed framework surpasses the state-of-the-art methods in terms of efficiency and social compliance. Note to Practitioners—This paper is motivated by the socially-compliant navigation problem of mobile robots in densely crowded environments such as hospitals and airports. Robots navigation in these scenes need to follow collective social conventions to ensure ordered and efficient public pedestrian traffics, and individual social conventions for acceptance by human society. Existing approaches generally consider only one type of social conventions cannot accomplish a truly socially-compliant navigation and cannot be naturally accepted in the human pedestrian environment. This paper proposes to imitate the pedestrian’s walking behavior for robot navigation by naturally choosing one of the three walking modes, moving-solo, following, and courteous-stopping. We construct the candidate trajectory sampling strategies for different motion modes based on the global path and the two types of social conventions. Experimental results show that the proposed framework can be applied in large-scale, densely crowded, unstructured, and human-robot coexisting environments for socially-compliant navigation. However, the proposed navigation framework has limited improvement in navigation efficiency in a highly crowded environment due to the limited feasible space. Even pedestrians are difficult to walk in these highly crowded environments. In future work, we will study how to auto-adjust the weights to steer the robot to efficient navigation in highly crowded environments."}