{"abstract":"Emotional intelligence (EI), a critical aspect of regulating emotions and behavior in daily life, holds paramount significance in both psychology research and real-world applications. Understanding and assessing EI are essential for informed decision-making, nurturing relationships, and facilitating efficient communication. As human–computer interaction (HCI) continues to evolve, there is a growing need to develop systems capable of comprehending human emotions, personality traits, and moods through recognition models. This research endeavors to explore the potential of recognizing EI in the context of effective HCI. To address this challenge, we have developed a novel computational model based on electroencephalogram (EEG) data. Our work encompasses a carefully curated EEG dataset, featuring recordings from 40 participants who were exposed to a set of 16 emotional video clips selected from distinct quadrants of the valence-arousal (VA) space. Participants’ emotional responses were meticulously annotated through self-assessment of emotional dimensions for each video stimulus. In addition, participants’ feedback on the big-five personality traits and their responses to the trait emotional intelligence questionnaire (TEIQue) served as our ground truth for further analysis. Our study includes a comprehensive correlation analysis, using Pearson correlations to establish the relationships between personality traits and EI. Furthermore, we conducted EEG-based analysis to uncover connections between EEG signals and emotional attributes. Remarkably, our analysis reveals that EEG signals excel at capturing differences in EI levels. Leveraging machine learning algorithms, we have constructed binary classification models that yield average $F1$ scores of 0.72, 0.71, and 0.62 for emotions, personality traits, and EI, respectively. These experimental outcomes underscore the potential of EEG signals in the recognition of EI, personality traits, and emotions. We envision our proposed model as a foundational element in the development of effective HCI systems, enabling a deeper and better understanding of human behavior."}