{"abstract":"Badland landscapes exhibit high erosion rates and represent the main source of fine sediments in some catchments. Advances in High Resolution Topographic methods allow analysis of topographic changes at high temporal and spatial scales. We apply the Mapping Geomorphic Processes in the Environment (MaGPiE) algorithm to infer the main geomorphic process signatures operating in two sub-humid badlands with contrasting morphometric attributes located in the Southern Pyrenees. By interrogating a five-year dataset of seasonal and annual topographic changes, we examine the variability of geomorphic processes at multiple temporal scales. The magnitude of geomorphic processes is linked to landform attributes and meteorological variables. Morphometric differences between both adjacent badlands allow analysing the role of landform attributes on main geomorphic process re-shaping landscapes subjected to the same external forcing (i.e. rainfall and temperature). The dominant geomorphic process signatures observed in both badlands are different, despite their close proximity and same rainfall and temperature regimes. Process signatures determining surface lowering in the gentle-sloping south-facing badland, characterised by lower connectivity and more vegetation cover, are driven by surface runoff-based processes, both diffuse, causing Sheet Washing , and concentrated, determining Cutting and Filling and Rilling and Gullying . The steeper and more connected north-facing slopes of the other badland are re-shaped by means of gravitational processes with Mass Wasting dominating topographic changes. In terms of processes determining surface raising, both Mass Wasting and Cutting and Filling are most frequently observed in both badlands. There is a clear near-balanced feedback between both surface-raising and lowering processes that becomes unbalanced at larger temporal scales due to the thresholds overcoming, as the volume associated with surface lowering becomes higher than that associated with raising-based processes. Rainfall variables control surface flow processes while those variables associated with low temperature have a significant relation with mass movement-based processes and other localised processes as Regolith Cohesion Loss . Finally, our results point out as morphometry (slope and connectivity) together with vegetation cover are key factors determining geomorphic processes and associated topographic changes. Our observations demonstrate that surveys at seasonal temporal scales allow depiction of specific geomorphological processes preparing and detaching sediments from the slopes, while annual temporal scales are required to estimate average values of erosion (i.e. denudation), masking the geomorphic processes responsible of long-term changes. in"}