{"abstract":"Objective. Parkinson’s disease (PD) is one of the most common neurodegenerative diseases, and early diagnosis is crucial to delay disease progression. The diagnosis of early PD has always been a difficult clinical problem due to the lack of reliable biomarkers. Electroencephalogram (EEG) is the most common clinical detection method, and studies have attempted to discover the EEG spectrum characteristics of early PD, but the reported conclusions are not uniform due to the heterogeneity of early PD patients. There is an urgent need for a more advanced algorithm to extract spectrum characteristics from EEG to satisfy the personalized requirements. Approach. The structured power spectral density with spatial distribution was used as the input of convolutional neural network (CNN). A visualization technique called gradient-weighted class activation mapping was used to extract the optimal frequency bands for identifying early PD. Based on the model visualization, we proposed a novel quantitative index of spectral characteristics, spatial-mapping relative power (SRP), to detect personalized abnormalities in the spatial spectral characteristics of EEG in early PD. Main results. We demonstrated the feasibility of applying CNN to identify the patients with early PD with an accuracy of 99.87% ± 0.03%. The models indicated the characteristic frequency bands (high-delta (3.5–4.5 Hz) and low-alpha (7.5–11 Hz) frequency bands) that are used to identify the early PD. The SRP of these two characteristic bands in early PD patients was significantly higher than that in the control group, and the abnormalities were consistent at the group and individual levels. Significance. This study provides a novel personalized detection algorithm based on deep learning to reveal the optimal frequency bands for identifying early PD and obtain the spatial frequency characteristics of early PD. The findings of this study will provide an effective reference for the auxiliary diagnosis of early PD in clinical practice."}