{"abstract":"Background Emerging research suggests that mobile apps can be used to effectively treat common mental illnesses like depression and anxiety. Despite promising efficacy results and ease of access to these interventions, adoption of mobile health (mHealth; mobile device–delivered) interventions for mental illness has been limited. More insight into patients’ perspectives on mHealth interventions is required to create effective implementation strategies and to adapt existing interventions to facilitate higher rates of adoption. Objective The aim of this study was to examine, from the patient perspective, current use and factors that may impact the use of mHealth interventions for mental illness. Methods This was a cross-sectional survey study of veterans who had attended an appointment at a single Veterans Health Administration facility in early 2016 that was associated with one of the following mental health concerns: unipolar depression, any anxiety disorder, or posttraumatic stress disorder. We used the Veteran Affairs Corporate Data Warehouse to create subsets of eligible participants demographically stratified by gender (male or female) and minority status (white or nonwhite). From each subset, 100 participants were selected at random and mailed a paper survey with items addressing the demographics, overall health, mental health, technology ownership or use, interest in mobile app interventions for mental illness, reasons for use or nonuse, and interest in specific features of mobile apps for mental illness. Results Of the 400 potential participants, 149 (37.3%, 149/400) completed and returned a survey. Most participants (79.9%, 119/149) reported that they owned a smart device and that they use apps in general (71.1%, 106/149). Most participants (73.1%, 87/149) reported interest in using an app for mental illness, but only 10.7% (16/149) had done so. Paired samples t tests indicated that ratings of interest in using an app recommended by a clinician were significantly greater than general interest ratings and even greater when the recommending clinician was a specialty mental health provider. The most frequent concerns related to using an app for mental illness were lacking proof of efficacy (71.8%, 107/149), concerns about data privacy (59.1%, 88/149), and not knowing where to find such an app (51.0%, 76/149). Participants expressed interest in a number of app features with particularly high-interest ratings for context-sensitive apps (85.2%, 127/149), and apps focused on the following areas: increasing exercise (75.8%, 113/149), improving sleep (73.2%, 109/149), changing negative thinking (70.5%, 105/149), and increasing involvement in activities (67.1%, 100/149). Conclusions Most respondents had access to devices to use mobile apps for mental illness, already used apps for other purposes, and were interested in mobile apps for mental illness. Key factors that may improve adoption include provider endorsement, greater publicity of efficacious apps, and clear messaging about efficacy and privacy of information. Finally, multifaceted apps that address a range of concerns, from sleep to negative thought patterns, may be best received."}