{"abstract":"Federated Learning (FL) has been an emerging trend in machine learning and artificial intelligence. It allows multiple participants to collaboratively train a better global model and offers a privacy-aware paradigm for model training since it does not require participants to release their original training data. However, existing FL solutions for vertically partitioned data or decision trees require heavy cryptographic operations. In this article, we propose a framework named <inline-formula><tex-math notation=\"LaTeX\">$\\mathsf {FederBoost}$</tex-math><alternatives><mml:math><mml:mi mathvariant=\"sans-serif\">FederBoost</mml:mi></mml:math><inline-graphic xlink:href=\"liu-ieq5-3276365.gif\"/></alternatives></inline-formula> for private federated learning of gradient boosting decision trees (GBDT). It supports running GBDT over both vertically and horizontally partitioned data. Vertical <inline-formula><tex-math notation=\"LaTeX\">$\\mathsf {FederBoost}$</tex-math><alternatives><mml:math><mml:mi mathvariant=\"sans-serif\">FederBoost</mml:mi></mml:math><inline-graphic xlink:href=\"liu-ieq6-3276365.gif\"/></alternatives></inline-formula> does <italic>not</italic> require any cryptographic operation and horizontal <inline-formula><tex-math notation=\"LaTeX\">$\\mathsf {FederBoost}$</tex-math><alternatives><mml:math><mml:mi mathvariant=\"sans-serif\">FederBoost</mml:mi></mml:math><inline-graphic xlink:href=\"liu-ieq7-3276365.gif\"/></alternatives></inline-formula> only requires lightweight secure aggregation. The key observation is that the whole training process of GBDT relies on the <italic>ordering</italic> of the data instead of the values. We fully implement <inline-formula><tex-math notation=\"LaTeX\">$\\mathsf {FederBoost}$</tex-math><alternatives><mml:math><mml:mi mathvariant=\"sans-serif\">FederBoost</mml:mi></mml:math><inline-graphic xlink:href=\"liu-ieq8-3276365.gif\"/></alternatives></inline-formula> and evaluate its utility and efficiency through extensive experiments performed on three public datasets. Our experimental results show that both vertical and horizontal <inline-formula><tex-math notation=\"LaTeX\">$\\mathsf {FederBoost}$</tex-math><alternatives><mml:math><mml:mi mathvariant=\"sans-serif\">FederBoost</mml:mi></mml:math><inline-graphic xlink:href=\"liu-ieq9-3276365.gif\"/></alternatives></inline-formula> achieve the same level of accuracy with centralized training where all data are collected in a central server; and they are 4-5 orders of magnitude faster than the state-of-the-art solutions for federated decision tree training; hence offering practical solutions for industrial applications."}