{"abstract":"Machine learning models have been shown to be vulnerable to adversarial examples. While most of the existing methods for adversarial attack and defense work on the 2D image domain, a few recent attempts have been made to extend them to 3D point cloud data. However, adversarial results obtained by these methods typically contain point outliers, which are both noticeable and easy to defend against using the simple techniques of outlier removal. Motivated by the different mechanisms by which humans perceive 2D images and 3D shapes, in this paper we propose the new design of <italic>geometry-aware objectives</italic>, whose solutions favor (the discrete versions of) the desired surface properties of smoothness and fairness. To generate adversarial point clouds, we use a targeted attack misclassification loss that supports continuous pursuit of increasingly malicious signals. Regularizing the targeted attack loss with our proposed geometry-aware objectives results in our proposed method, <italic>Geometry-Aware Adversarial Attack (<inline-formula><tex-math notation=\"LaTeX\">$GeoA^3$</tex-math><alternatives><mml:math><mml:mrow><mml:mi>G</mml:mi><mml:mi>e</mml:mi><mml:mi>o</mml:mi><mml:msup><mml:mi>A</mml:mi><mml:mn>3</mml:mn></mml:msup></mml:mrow></mml:math><inline-graphic xlink:href=\"wen-ieq1-3044712.gif\"/></alternatives></inline-formula>)</italic>. The results of <inline-formula><tex-math notation=\"LaTeX\">$GeoA^3$</tex-math><alternatives><mml:math><mml:mrow><mml:mi>G</mml:mi><mml:mi>e</mml:mi><mml:mi>o</mml:mi><mml:msup><mml:mi>A</mml:mi><mml:mn>3</mml:mn></mml:msup></mml:mrow></mml:math><inline-graphic xlink:href=\"wen-ieq2-3044712.gif\"/></alternatives></inline-formula> tend to be more harmful, arguably harder to defend against, and of the key adversarial characterization of being imperceptible to humans. While the main focus of this paper is to learn to generate adversarial point clouds, we also present a simple but effective algorithm termed <inline-formula><tex-math notation=\"LaTeX\">$Geo_{+}A^3$</tex-math><alternatives><mml:math><mml:mrow><mml:mi>G</mml:mi><mml:mi>e</mml:mi><mml:msub><mml:mi>o</mml:mi><mml:mo>+</mml:mo></mml:msub><mml:msup><mml:mi>A</mml:mi><mml:mn>3</mml:mn></mml:msup></mml:mrow></mml:math><inline-graphic xlink:href=\"wen-ieq3-3044712.gif\"/></alternatives></inline-formula>-IterNormPro, with Iterative Normal Projection (IterNorPro) that solves a new objective function <inline-formula><tex-math notation=\"LaTeX\">$Geo_{+}A^3$</tex-math><alternatives><mml:math><mml:mrow><mml:mi>G</mml:mi><mml:mi>e</mml:mi><mml:msub><mml:mi>o</mml:mi><mml:mo>+</mml:mo></mml:msub><mml:msup><mml:mi>A</mml:mi><mml:mn>3</mml:mn></mml:msup></mml:mrow></mml:math><inline-graphic xlink:href=\"wen-ieq4-3044712.gif\"/></alternatives></inline-formula>, towards surface-level adversarial attacks via generation of adversarial point clouds. We quantitatively evaluate our methods on both synthetic and physical objects in terms of attack success rate and geometric regularity. For a qualitative evaluation, we conduct subjective studies by collecting human preferences from Amazon Mechanical Turk. Comparative results in comprehensive experiments confirm the advantages of our proposed methods. Our source codes are publicly available at <uri>https://github.com/Yuxin-Wen/GeoA3</uri>."}