{"abstract":"Text is the most usual way to share information in society. Yet, if textual documents contain personal sensitive information, they cannot be shared with third parties or released publicly without adequate protection. Privacy-preserving mechanisms provide ways to sanitize data so that identities and/or confidential attributes are not disclosed. In the last twenty years, a great variety of mechanisms have been proposed to protect structured databases with numerical and categorical attributes; however, little attention has been devoted to unstructured textual data. In general, textual data protection requires first detecting pieces of text that may lead to disclosure of sensitive information and then masking those pieces via suppression or generalization. Current solutions rely on pre-trained classifiers that can recognize a fixed set of (allegedly disclosive) named entities, such as names or locations. Yet, such approaches fall short of providing adequate protection because in reality disclosive information is not limited to a predefined set of entity types, and not all the appearances of certain entity type result in disclosure. Besides, named entity recognition requires considerable manual effort to tag the training data needed to build classifiers. In this work we propose a more general and flexible solution for textual data protection. By means of word embeddings we build vectors that numerically capture the semantic relationships of the textual terms appearing in a collection of documents. Then we evaluate the disclosure caused by the textual terms on the entity to be protected (e.g., an individual’s identity or a confidential attribute) according to the similarity between their vector representations. Our method also limits the semantic loss (and, therefore, the utility loss) of the document by replacing (rather than just suppressing) disclosive terms with privacy-preserving generalizations. Empirical results show that our approach offers much more robust protection and greater utility preservation than methods based on named entity recognition, with the additional important advantage of avoiding the burden of manual data tagging."}