{"abstract":", Abstract. Nowadays, Semi-Supervised Object Detection (SSOD) is a hot topic, since, while it is rather easy to collect images for creating a new dataset, labeling them is still an expensive and time-consuming task. One of the successful methods to take advantage of raw images on a Semi-Supervised Learning (SSL) setting is the Mean Teacher technique [17], where the operations of pseudo-labeling by the Teacher and the Knowledge Transfer from the Student to the Teacher take place si-multaneously. However, the pseudo-labeling by thresholding is not the best solution since the conﬁdence value is not strictly related to the prediction uncertainty, not permitting to safely ﬁlter predictions. In this paper, we introduce an additional classiﬁcation task for bounding box localization to improve the ﬁltering of the predicted bounding boxes and obtain higher quality on Student training. Furthermore, we empirically prove that bounding box regression on the unsupervised part can equally contribute to the training as much as category classiﬁcation. Our experiments show that our IL-net (Improving Localization net) increases SSOD performance by 1.14% AP on COCO dataset in limited-annotation regime. The code is available at https://github. com/IMPLabUniPr/unbiased-teacher/tree/ilnet . the same hardware and hyper-parameters. When available, the original code released by the authors is used. Our code is developed on top of the Unbiased Teacher [10] source code. We perform the training on a single machine with 6 Tesla P100 GPUs with 12GB of memory. The train lasts 180,000 iterations with a batch size of 2 images per GPU for the supervised part and 2 images for the unsupervised part, with α set to 4. We use the Stochastic Gradient Descent (SGD) optimization algorithm with a learning rate of 0.0075, a weight decay of 0.0001, and a momentum of 0.9. The learning rate decays at iteration 179990 and 179995. We use the Faster R-CNN with FPN [7] and the ResNet 50 [2] backbone for the teacher and student models, initialized by pre-trained on ImageNet, and the same augmentation of Unbiased Teacher [10]."}