{"abstract":"Background In the intensive care unit (ICU), continuous patient monitoring is essential to detect critical changes in patients’ health statuses and to guide therapy. The implementation of digital health technologies for patient monitoring may further improve patient safety. However, most monitoring devices today are still based on technologies from the 1970s. Objective The aim of this study was to evaluate statements by ICU staff on the current patient monitoring systems and their expectations for future technological developments in order to investigate clinical requirements and barriers to the implementation of future patient monitoring. Methods This prospective study was conducted at three intensive care units of a German university hospital. Guideline-based interviews with ICU staff—5 physicians, 6 nurses, and 4 respiratory therapists—were recorded, transcribed, and analyzed using the grounded theory approach. Results Evaluating the current monitoring system, ICU staff put high emphasis on usability factors such as intuitiveness and visualization. Trend analysis was rarely used; inadequate alarm management as well as the entanglement of monitoring cables were rated as potential patient safety issues. For a future system, the importance of high usability was again emphasized; wireless, noninvasive, and interoperable monitoring sensors were desired; mobile phones for remote patient monitoring and alarm management optimization were needed; and clinical decision support systems based on artificial intelligence were considered useful. Among perceived barriers to implementation of novel technology were lack of trust, fear of losing clinical skills, fear of increasing workload, and lack of awareness of available digital technologies. Conclusions This qualitative study on patient monitoring involves core statements from ICU staff. To promote a rapid and sustainable implementation of digital health solutions in the ICU, all health care stakeholders must focus more on user-derived findings. Results on alarm management or mobile devices may be used to prepare ICU staff to use novel technology, to reduce alarm fatigue, to improve medical device usability, and to advance interoperability standards in intensive care medicine. For digital transformation in health care, increasing the trust and awareness of ICU staff in digital health technology may be an essential prerequisite. Trial Registration ClinicalTrials.gov NCT03514173; https://clinicaltrials.gov/ct2/show/NCT03514173 (Archived by WebCite at http://www.webcitation.org/77T1HwOzk)"}