{"abstract":"Recommender systems suggest items of interest to users based on their preferences. These preferences are typically generated from user ratings of the items. If there are no ratings for a certain user or item, it is said that there is a cold start problem, which leads to unreliable recommendations. Existing studies that reviewed and examined cold start in recommender systems have not explained the process of deriving and obtaining the auxiliary information needed for cold start recommendation. This study surveys the existing literature in order to explain the various approaches and techniques employed by researchers and the challenges associated with deriving and obtaining the auxiliary information necessary for cold start recommendation. Results show that auxiliary information for cold start recommendation is obtained by adapting traditional filtering and matrix factorization algorithms typically with machine learning algorithms to build learning prediction models. The understanding of similar or connected user profiles can be used as auxiliary information for building cold start user profile to enable similar recommendations in social networks. Similar users are clustered into sub-groups so that a cold start user could be allocated and inferred to a sub-group having similar profiles for recommendations. The key challenges of the process for obtaining the auxiliary information involve: (1) two separate recommendation processes of conversion from pure cold start to warm start before eliciting the auxiliary information; (2) the obtained implicit auxiliary information is usually ranked and sieved in order to select the top rated and reliable auxiliary information for the recommendation. This study also found that cold start user recommendation has frequently been researched in the entertainment domain, typically using music and movie data, while little research has been carried out in educational institutions and academia, or with cold start for mobile applications."}