{"abstract":"Abstract Timely and reliable land-use/land-cover (LULC) change dynamic monitoring is the basis of urban understanding and planning. However, either the training sample shortage or the error accumulation in the multi-temporal processing inevitably restricts the monitoring performance. In this paper, to overcome these problems, we present a label-noise robust active learning method, which automatically collects reliable and informative samples from the images and builds a unified classification system with these augmented samples. In more detail, a Bayesian sample collection process that fuses the unsupervised transition information and the multi-temporal land-cover information is designed to provide candidate samples with “from-to” labels. A reliability-based multi-classifier active learning method is then proposed to adaptively allocate the more reliable samples to the classes that are difficulty to classify. Finally, a fusion of the multiple multi-date classifications trained by the selected samples is implemented to identify the change type of interest. The dynamic monitoring results for Shanghai, Shenzhen, and Shiyan in China, two megacities with rapid and obvious urbanization and a small city with relatively slow urbanization, indicate that the proposed method achieves a significantly higher accuracy than the current state-of-the art methods. The sample accuracy verified by the high spatial resolution reference maps endorses the applicability of the sample collection, while the reliability-based active learning further ensures the robustness of the proposed method in the label-noise situation. The presented method was tested in two difficult situations (a small training sample case and a training sample set without joint labeling), so that the robustness and accuracy of the approach can be expected to be of a similar or better quality in cases with more training samples. Given its effectiveness and robustness, the proposed method could be widely applied in LULC change dynamic monitoring."}