{"abstract":"The distributed heterogeneous factory system is a typical scenario in the manufacturing industry. A distributed heterogeneous no-wait flowshop scheduling problem with sequence-dependent setup times (DHNWFSP-SDST) is studied in this paper. The differences in factory configuration and transportation time are considered in DHNWFSP-SDST. A mixed-integer linear programming (MILP) model is constructed and an artificial bee colony algorithm (ABC) with Q-learning (QABC) is proposed to address the DHNWFSP-SDST. Heuristic methods named NEH_H and DHHS are designed to construct potential initial candidates for the population. The neighborhood structures based on the job blocks are introduced in QABC to explore the solution space during the evolution processes. The Q-learning mechanism is employed to select neighborhood structures via empirical knowledge in the operation processes. The speed-up methods to accelerate the evaluation of the obtained neighborhood are designed to reduce the computation time of the QABC. The experimental results show that the QABC is a potential algorithm to address the DHNWFSP-SDST. Note to Practitioners—Distributed manufacturing under the heterogeneous environment generally exists in real manufacturing systems. The scheduling problem refers to the reasonable arrangement of production orders to optimize certain indicators under limited time, resources, and computing costs. Distributed heterogeneous no-wait flowshop scheduling problem with setup times is an important industrial scheduling problem in distributed heterogeneous manufacturing systems. The problem takes into account the differences in factory configuration and transportation time in distributed regions. The problem is a kind of NP-hard problem as the solution space is huge. A reinforcement learning driven artificial bee colony algorithm is designed to address the problem. Heuristic methods are utilized to construct potential initial solutions. Neighborhood structures are designed to further optimize the initial solution. The effective empirical guidance is provided by Q-learning for the selection of the neighborhood structure of the algorithm to avoid invalid search. The experimental results show that the QABC obtains a high-quality scheduling scheme in a reasonable time."}