{"abstract":"PurposeEmployee engagement has received a considerable amount of research attention over the last decade. However, most of the research has been on job or work engagement. Much less attention has been given to organization engagement, which is a distinct but related target of employee engagement. In this paper, we review the research on organization engagement and identify how it has been measured, its antecedents and consequences and how it compares to job engagement.Design/methodology/approachThis paper provides a narrative review of 40 studies that have measured organization engagement. Most of these studies have been published in the last five years, and they come from 20 different countries. The majority of studies also measured job or work engagement.FindingsMost studies used Saks' (2006) measure of organization engagement. Many antecedents have been found to be related to organization engagement; however, those most often studied and consistently related to organization engagement are organizational-related resources such as perceived organizational support (POS), justice perceptions, corporate social responsibility (CSR), organizational structural factors, organizational climate and HR practices. Organization engagement has been found to be positively related to job satisfaction, organizational commitment, organizational citizenship behavior (OCB), job performance and organizational performance and negatively related to intention to quit. Organization engagement has also been found to partially or fully mediate the relationship between antecedents and consequences. In comparison to job engagement, organization engagement scores tend to be lower, and there are meaningful differences in the antecedents and consequences of organization engagement and job engagement. A number of studies found that organization engagement was more strongly related to several of the consequences than job engagement.Practical implicationsThe results of this review indicate that organization engagement is as important if not more important than job engagement when it comes to its relationship to some of the consequences of employee engagement. Organizations should include a measure of organization engagement in employee surveys and focus on improving organization engagement by providing a supportive work environment, ensuring that employees have positive perceptions of justice, increasing CSR initiatives, providing a variety of human resources (HR) practices and improving organizational climate.Originality/valueThis paper provides the first comprehensive review of research on organization engagement and offers a new model of the antecedents and consequences of organization engagement and compares organization engagement to job engagement."}