{"abstract":"Entity-Relationship-Attribute ideas are commonly used to specify and de- sign information systems. They use a graphical technique for displaying the objects of the system and relationships among them. The design process can be enhanced by specifying constraints of the systemand the natural environm ent for these is the cat- egorical notion of sketch. Here we argue that the finite-limit, finite-sum sketches with a terminal node are the appropriate class and call them EA sketches. A model for an EA sketch in a lextensive category is a 'snapshot' of a database with values in that category. The category of models of an EA sketch is an object of models of the sketch in a 2-category of lextensive categories. Moreover, modelling the same sketch in certain objects in other 2-categories defines both the query language for the database and the updates (the dynamics) for the database. It should be said at the outset that there is a conflict between the terminology used in the study of databases and that used in category theory. Since this paper is an application of the latter to the former we find ourselves with several words that must be sorted out. Most troubling of these is 'model'. Because the primary audience for this paper is the category theory community we will use categorical terminology. In particular we will use 'model' as it is already understood in category theory and in Section 2 we will present a categorical generalization of the idea. Thus, other than in this paragraph, we will avoid speaking of 'information models' and 'entity-relationship-attribute models'. In (10) information models based on entity- relationship-attribute (ERA) diagrams were shown to be enhanced by the inclusion of commutative diagrams and specification of finite limits and finite sums to model con- straints and queries. In this article we extend that work by defining a class of sketches called EA sketches that are suitable for description of ERA models and their constraints. As the categorical reader may already suspect, 'ERA models' are more nearly described as 'ERA theories' from a categorical perspective. Still, we will try to avoid adding such new terminology. Early database writers used to exhort their readers to avoid confusing the formal 'database design' with particular instances or states of the database. For us the former is the sketch and the latter are its models. We will use 'database state' to mean a model The authors gratefully acknowledge financial support fromthe Australian Research Council and the Canadian NSERC. Diagrams typeset using M. Barr's diagram macros."}