{"abstract":"Small Unmanned Aircraft Systems (sUAS) have gained widespread adoption across a diverse range of applications. This has introduced operational complexities within shared airspaces and an increase in reported incidents, raising safety concerns. In response, the U.S. Federal Aviation Administration (FAA) is developing a UAS Traffic Management (UTM) system to control access to airspace based on an sUAS’s predicted ability to safely complete its mission. However, a fully automated system capable of swiftly approving or denying flight requests can be prone to bias and must consider safety, transparency, and fairness to diverse stakeholders. In this paper, we present an initial study that explores stakeholders’ perspectives on factors that should be considered in an automated system. Results indicate flight characteristics and environmental conditions were perceived as most important but pilot and drone capabilities should also be considered. Further, several respondents indicated an aversion to any AI-supported automation, highlighting the need for full transparency in automated decision-making. Results provide a societal perspective on the challenges of automating UTM flight authorization decisions and help frame the ongoing design of a solution acceptable to the broader sUAS community.CCS CONCEPTS• Software and its engineering → Requirements analysis.GENERAL ABSTRACTSmall Unmanned Aircraft Systems (sUAS), also called drones, are becoming increasingly popular due to their usefulness in applications such as emergency response, remote sensing, agriculture, and package delivery, as well as with hobbyists. With the rise of sUAS operations, there has been an inevitable corresponding rise in the number of incidents, such as crashes or airspace infringements with other aircraft or in no-fly zones. For example, a package delivery drone should not interfere with airplanes or first-responder drones. Developing, validating, and deploying an automated system to approve or reject such sUAS flight requests is a complex, multifaceted process that ultimately must balance competing concerns, including safety, transparency, and fairness to diverse stakeholders. This paper reports results from an initial survey we conducted with remote sUAS pilots, emergency responders, and members of the general public. The survey elicited their opinions about factors they perceive to be important in an automated authorization decision process. Survey results show that flight characteristics and environmental conditions were perceived as most important and that pilot and drone capabilities should also be considered. These results open up communication and help inform the human aspects inherent in the design and acceptance of such an automated system."}