{"abstract":"The growing understanding of the importance of involving patients with neurological diseases in their healthcare routine either for at-home management of their chronic conditions or after the hospitalization period has opened the research for new rehabilitation strategies to enhance patient engagement in neurorehabilitation. In addition, the use of new digital technologies in the neurorehabilitation field enables the implementation of telerehabilitation systems such as virtual reality interventions, video games, web-based interventions, mobile applications, web-based or telephonic telecoach programs, in order to facilitate the relationship between clinicians and patients, and to motivate and activate patients to continue with the rehabilitation process at home. Here we present a systematic review that aims at reviewing the effectiveness of different engagement strategies and the different engagement assessments while using telerehabilitation systems in patients with neurological disorders. We used PICO's format to define the question of the review, and the systematic review protocol was designed following the Preferred Reported Items for Systematic Reviews and Meta-Analysis (PRISMA) guidelines. Bibliographical data was collected by using the following bibliographic databases: PubMed, EMBASE, Scopus, and Web of Science. Eighteen studies were included in this systematic review for full-text analyses. Overall, the reviewed studies using engagement strategies through telerehabilitation systems in patients with neurological disorders were mainly focused on patient self-management and self-awareness, patient motivation, and patient adherence subcomponents of engagement, that are involved in by the behavioral, cognitive, and emotional dimensions of engagement. Conclusion: The studies commented throughout this systematic review pave the way for the design of new telerehabilitation protocols, not only focusing on measuring quantitative or qualitative measures but measuring both of them through a mixed model intervention design (1). The future clinical studies with a mixed model design will provide more abundant data regarding the role of engagement in telerehabilitation, leading to a possibly greater understanding of its underlying components."}