{"abstract":"AI-controlled characters in fighting games are expected to possess reasonably high skills and behave in a believable, human-like manner, exhibiting a diversity of play styles and strategies. Thus, the development of fighting game AI requires the ability to evaluate these properties. For instance, it should be possible to ensure that the characters created are believable and diverse. In this paper, we show how an automated procedure can be used to compare play styles of individual AIand human-controlled characters, and to assess human-likeness and diversity of game participants. INTRODUCTION Fighting games provide a variety of interesting challenges for AI research and development. Fighting is often seen as a purely arcade fun, emphasizing fast reaction and the ability to perform complex combo actions with accurate timing. However, numerous current research works show that designing a good AI for a fighting game is not an easy task. First, achieving high performance is challenging: only one recent work (Oh et al. 2021) reports obtained AI skill level comparable to the abilities of professional human players in a modern fighting game. One of the principal difficulties lies in the fact that people both react to and anticipate opponent’s movements. Thus, a fighting game can be considered as a rock-paper-scissors type game, where opponents make “double-blind decisions” (Yu and Sturtevant 2019). Second, people of different skill levels need AI opponents possessing comparable and possibly adjustable skills, which is a separate challenge (Ishihara et al. 2018). Finally, AI-controlled characters have to be believable (human-like) and exhibit diverse play styles to keep the players engaged. Believability and diversity of AI behavior is not a universal requirement across game genres, but for certain game types, such as firstperson shooters, it seems to be the case (Soni and Hingston 2008). Fighting games typically simulate a one-vs-one combat between two human-like opponents, so certain “human-like traits” are expected form the AI system, at least as a feature contributing to the “realism” of the environment. Before engaging in the task of creating believable and diverse AI-controlled characters for a fighting game, one has first to confirm that the game environment used is able to provide sufficient flexibility for this work. In other words, it should be possible for game characters to exhibit diverse play styles, recognizable by human observers and identifiable distinguishable with a certain evaluation method. The goal of this paper is to analyze play styles of humanand AI-controlled characters in a Universal Fighting Engine (UFE) (Mind Studios 2021). We develop a simple procedure, able to distinguish individual players, which supports the presumption that identifiable behaviors are achievable in UFE. We also compare play styles of people with the style exhibited by a built-in AI system. Finally, we report results of a short survey, aimed to reveal whether human observers can spot “human-like” traits in the behavior of game characters. UNIVERSAL FIGHTING ENGINE PLATFORM Universal Fighting Engine (Mind Studios 2021) is a highly customizable platform for one-vs-one fighting games developed in Unity. It supports a large variety of attacks and special moves as well as the ability to create new action types on per-character basis. UFE aims to provide classic comboheavy 2D fighting gameplay, associated with games such as Street Fighter or Mortal Kombat. UFE comes with a built-in customizable rule-based AI engine called “Fuzzy AI”. It relies on fuzzy logic to evaluate the current scene and estimate the desirability of each given action. Play style and skill level of Fuzzy AI players can be adjusted by tuning a number of parameters, by default organized into presets ranging from “very easy” to “impossible”. In the present study we use five different levels of Fuzzy AI with default parameter values shown in Table 1. Table 1: Fuzzy AI settings for five different skill levels For us, each AI preset is essentially a “black box” aimed to represent a unique fighting game character. Thus, we will not discuss the choice of Fuzzy AI parameters and their values, described in the documentation as follows: • Time between decisions (sec): minimum time taken to formulate a decision. • Time between actions (sec): time between executing each decision. • Rule compliance: controls the balance between systematic appliance of rules and randomicity (higher values correspond to lower randomicity). • Aggressiveness: controls the balance between basic moves such as walk, crouch and jump, and attacks. Higher values correspond to higher contribution of attacking actions. Very easy Easy Normal Hard Very hard Time between decisions 0.4 0.3 0 0.1 0 Time between actions 0.1 0.1 0.05 0.05 0.05 Rule compliance 0.9 0.9 0.9 0.9 0.9 Aggressiveness 0.1 0.3 0.5 0.6 0.6 Combo efficiency 0.1 0.2 1 1 1 • Combo efficiency: controls the probability of attempting combo actions. Universal Fighting Engine comes with a set of pre-modeled characters, distinct in their special move types. To ensure fair comparison, we use the same character type for each of the opponents in all test games. PLAY STYLE SIMILARITY IDENTIFICATION The goals of our work can be narrowed down to the following research questions: RQ1 Do human-controlled and AI-controlled characters possess distinct, identifiable play styles? RQ2 Are these styles consistent across matches or change depending on the opponent? RQ3 Do human-controlled characters possess identifiable “human-like behavior traits”? RQ4 Can questions RQ1-RQ3 be answered with a certain automated evaluation procedure? In order to compare individual players’ behavior, we adopted a cosine similarity-based procedure, earlier used in the game of boxing (Mozgovoy and Umarov 2010). It operates as follows. We analyze recordings of games where a character of our interest participates and create its “behavior fingerprint” as an ordered list of probabilities of every possible tuple (A1, A2, A3), representing three consecutive player actions. Recordings consist of game engine state snapshots taken at each consecutive simulation frame. Within this context, each action is uniquely defined with its game engine-specified elements currentState, currentSubstate, and currentBasicMove. While more details are provided in Table 2, we view these elements as merely items uniquely identifying an action in our particular game engine (UFE). Being lists of probabilities, behavior fingerprints can be compared as vectors using cosine similarity, yielding a similarity ratio of [0, 1]:"}