{"abstract":"Abstract Genomic analysis of many nonmodel species has uncovered an incredible diversity of sex chromosome systems, making it possible to empirically test the rich body of evolutionary theory that describes each stage of sex chromosome evolution. Classic theory predicts that sex chromosomes originate from a pair of homologous autosomes and recombination between them is suppressed via inversions to resolve sexual conflict. The resulting degradation of the Y chromosome gene content creates the need for dosage compensation in the heterogametic sex. Sex chromosome theory also implies a linear process, starting from sex chromosome origin and progressing to heteromorphism. Despite many convergent genomic patterns exhibited by independently evolved sex chromosome systems, and many case studies supporting these theoretical predictions, emerging data provide numerous interesting exceptions to these long-standing theories, and suggest that the remarkable diversity of sex chromosomes is matched by a similar diversity in their evolution. For example, it is clear that sex chromosome pairs are not always derived from homologous autosomes. In addition, both the cause and the mechanism of recombination suppression between sex chromosome pairs remain unclear, and it may be that the spread of recombination suppression is a more gradual process than previously thought. It is also clear that dosage compensation can be achieved in many ways, and displays a range of efficacy in different systems. Finally, the remarkable turnover of sex chromosomes in many systems, as well as variation in the rate of sex chromosome divergence, suggest that assumptions about the inevitable linearity of sex chromosome evolution are not always empirically supported, and the drivers of the birth–death cycle of sex chromosome evolution remain to be elucidated. Here, we concentrate on how the diversity in sex chromosomes across taxa highlights an equal diversity in each stage of sex chromosome evolution."}