{"abstract":"TABLE OF CONTENTS Introduction I. Freedom and Privacy A. Freedom: Discretionary Vehicles B. Privacy: Communicative Vehicles C. The Intersection of Freedom and Privacy II. Liability Shifts A. Discretionary-Uncommunicative Vehicles B. Discretionary-Communicative Vehicles C. Nondiscretionary-Uncommunicative Vehicle D. Nondiscretionary-Communicative Vehicles E. Mixed Systems III. Reconciliation INTRODUCTION Imagine the night of your wedding anniversary ten years from now: your car, driving itself, heads over to the babysitter's house while you and your spouse get dressed, returns in time to chauffeur you downtown, and then parks while you head into the restaurant for dinner. Sound fanciful? Maybe so, but the Center for Automotive Research predicts that the first commercially available, fully autonomous vehicles (1) could come to a dealership near you as early as 2019. (2) California, Florida, Michigan, and Nevada have already passed laws that allow the testing of autonomous vehicles (AVs) on public roads, with more states currently considering similar legislation. (3) The stakes could hardly be higher: over ten million car crashes occur in this country each year, (4) many of which result in tragic injuries and expensive lawsuits that burden the nation's hospitals and court systems. Predictions that self-driving cars may be able to prevent many of these accidents have led some commentators to wholeheartedly endorse the impending arrival of AVs onto our nation's roadways. (5) Not everyone views the arrival of AV technology quite so positively. Serious concerns about self-driving cars have also been raised, largely focusing on the impact these vehicles could have on three key issues: freedom, privacy, and liability. (6) Though the automobile has stood as a symbol of freedom and personal autonomy for generations, (7) some fear that legal and economic pressures might eventually restrict the frequency and scope of human driving. (8) While both Nevada and California currently require that self-driving cars cede operational authority to human users whenever a human user requests control, (9) it is hard to predict whether this rule will be preserved if AV technology becomes more commonplace. Regulators have been even more concerned with the threat self-driving cars pose to their users' privacy. For example, California demands that the \"manufacturer of the autonomous technology installed on a vehicle shall provide a written disclosure to the purchaser of an autonomous vehicle that describes what information is collected by the autonomous technology equipped on the vehicle.\" (10) Other measures might have the unintended consequence of diminishing user privacy: California also requires that all AVs preserve detailed records of the thirty seconds leading up to an accident. (11) Though intended to help determine fault in the event of an accident, this regulation could open the door to more continuous and invasive monitoring of AV behavior in the future. Some have even suggested that AV technology's potential to infringe on privacy is so grave that self-driving cars should be prohibited altogether. (12) California's decision to use the sensors installed on AVs to determine fault raises another concern: who should be held liable for crashes involving AVs? Though manufacturers, insurers, news outlets, and academics have all posed this question, they have not found easy answers. While some academics assert that the manufacturers of AVs should be held liable for their crashes under a products liability model, (13) others claim that products liability would strangle the introduction of self-driving cars and advocate for \"strict liability to autonomous car owners.\" (14) And though California originally stipulated that \"the conversion of vehicles originally manufactured by a third party shall control issues of liability arising from the operation of the autonomous vehicle,\" the legislature struck this provision on reconsideration. …"}