{"abstract":"Wireless networks are usually deployed to cover more overlapping areas, experiencing severe interferences and hence making interference management essential for their viability. Interference alignment (IA) is an effective way of interference management and has thus received significant attention. With IA, at least one degree-of-freedom (DoF) should be used to place the aligned interferences. However, when multiple interferences are from one identical transmitter and to a common destination, IA is not applicable under a one-DoF cost constraint. If these interfering signals are aligned in the same direction at the interfered receiver, they will also overlap with each other at their intended receiver, thus becoming indistinguishable. Moreover, IA is realized by adjusting the spatial feature of disturbance, hence incurring co-channel interference to the interfering transmission-pair’s own communication. To solve this problem, we propose cooperative IA. Instead of adjusting the spatial characteristics of all interferences, we aim to achieve IA by adjusting interferences’ strength along with one or none interference’s signature, based on the interactions among multiple wireless disturbances. We propose two cooperative IA schemes: cooperative IA with space-power adjustment and cooperative IA with power adjustment. With the first method, the overall effect of all interferences is aligned in the orthogonal direction with respect to the desired signal at the interfered receiver. This method modifies the direction of one interference with a properly designed precoding vector and the strength of all interferences via power allocation. Under the second scheme, the strength of all interfering signals is modified so that the overall effect of multiple interferences is orthogonal to the desired transmission while guaranteeing the orthogonality among the interfering signals at their intended receiver. Our theoretical analysis and in-depth simulation have shown that the proposed schemes can effectively manage multiple interferences from an identical source while achieving good performance of the interfering transmission-pair."}