{"abstract":"With the increasing prevalence of infectious diseases like COVID-19, there is a growing interest in modeling and predicting their transmission. Leveraging the wealth of mobile trajectory data collected through advanced localization and mobile communication techniques, numerous approaches have been proposed to predict the spatial spread of infectious diseases based on human mobility dynamics characterized by microscopic user contact graphs or macroscopic population flow graphs. However, existing pure macroscopic and microscopic models have limitations in terms of modeling capabilities or in protecting user privacy. Thus, in this study, we present a Multi-scale Spatial Disease prediction Network (MSDNet) for predicting the spatial spread of infectious diseases. The model predicts the spread of infectious diseases using a macromicro collaborative approach by combining the temporal and spatial characteristics of the macroscopic information in the population flow graph and the microscopic information in the user contact graph. To understand the coupling between human mobility and infectious disease transmission, we propose a loss term that combines infectious disease spread dynamics and modeling of infectious disease parameters that can achieve stable adaptation to key characteristics of infectious diseases even when human mobility is affected by policy measures such as travel restrictions. Extensive experimental results show the MSDNet model's superiority for epidemic prediction on graph networks using macro-micro collaboration, achieving a 15%-20% improvement in terms of RMSE and a 15%-30% improvement in terms of SMAPE compared to existing baseline models. In addition, we predict infectious disease parameters under changes in human mobility, and the results show that MSDNet could effectively distinguish between human mobility and infectious disease characteristics, achieving a relative improvement of 76% in terms of RMSE and 80% in terms of SMAPE in predicting infectious disease parameters under changes in human mobility."}