{"abstract":"Self-attention-based transformer models have achieved tremendous success in the domain of natural language processing. Despite their efficacy, accelerating the transformer is challenging due to its quadratic computational complexity and large activation sizes. Existing transformer accelerators attempt to prune its tokens to reduce memory access, albeit with high compute overheads. Moreover, previous works directly operate on large matrices involved in the attention operation, which limits hardware utilization. In order to address these challenges, this work proposes a novel dynamic inference scheme, DynaTran, which prunes activations at runtime with low overhead, substantially reducing the number of ineffectual operations. This improves the throughput of transformer inference. We further propose tiling the matrices in transformer operations along with diverse dataflows to improve data reuse, thus, enabling higher energy efficiency. To effectively implement these methods, we propose AccelTran, a novel accelerator architecture for transformers. Extensive experiments with different models and benchmarks demonstrate that DynaTran achieves higher accuracy than the state-of-the-art top-<inline-formula> <tex-math notation=\"LaTeX\">$k$ </tex-math></inline-formula> hardware-aware pruning strategy while attaining up to <inline-formula> <tex-math notation=\"LaTeX\">$1.2\\times $ </tex-math></inline-formula> higher sparsity. One of our proposed accelerators, AccelTran-Edge, achieves 330K<inline-formula> <tex-math notation=\"LaTeX\">$\\times $ </tex-math></inline-formula> higher throughput with 93K<inline-formula> <tex-math notation=\"LaTeX\">$\\times $ </tex-math></inline-formula> lower energy requirement when compared to a Raspberry Pi device. On the other hand, AccelTran-Server achieves <inline-formula> <tex-math notation=\"LaTeX\">$5.73\\times $ </tex-math></inline-formula> higher throughput and <inline-formula> <tex-math notation=\"LaTeX\">$3.69\\times $ </tex-math></inline-formula> lower energy consumption compared to the state-of-the-art transformer co-processor, Energon. The simulation source code is available at <uri>https://github.com/jha-lab/acceltran</uri>."}