{"abstract":"Abstract Study purpose This study explores the usage of generative AI tools by journalists in sub-Saharan Africa, with a focus on issues of misinformation, plagiarism, stereotypes, and the unrepresentative nature of online databases. The research places this inquiry within broader debates of whether the Global South can effectively and fairly use AI tools. Design/methodology/approach This study involved conducting interviews with journalists from five sub-Saharan African countries, namely Congo, DRC, Kenya, Tanzania, Uganda, and Zambia. The objective of the study was to ascertain how journalists in sub-Saharan Africa are utilizing ChatGPT. It is worth noting that this study is a component of an ongoing project on AI that commenced on September 19, 2022, shortly after receiving IRB approval. The ChatGPT project was initiated in January 2023 after discovering that our participants were already employing the Chatbot. Findings The study highlights that generative AI like ChatGPT operates on a limited and non-representative African corpus, making it selective on what is considered civil and uncivil language, thus limiting its effectiveness in the region. However, the study also suggests that in the absence of representative corpora, generative AI tools like ChatGPT present an opportunity for effective journalism practice in that journalists cannot completely rely on the tools. Practical implications The study emphasizes the need for human agencies to provide relevant information to the tool, thus contributing to a global database, and to consider diverse data sources when designing AI tools to minimize biases and stereotypes. Social implications The social implications of the study suggest that AI tools have both positive and negative effects on journalism in developing countries, and there is a need to promote the responsible and ethical use of AI tools in journalism and beyond. Originality/value The original value of the study lies in shedding light on the challenges and opportunities associated with AI in journalism, promoting postcolonial thinking, and emphasizing the importance of diverse data sources and human agency in the development and use of AI tools."}