{"abstract":"Abstract Since first outbreak of respiratory disease in China, the Coronavirus epidemic (COVID-19) spread on a large scale, causing huge losses to individuals, families, communities and society in the country. The conventional research on the transmission process is basically to study the law or trend of the transmission of infectious diseases from a macro perspective. For in-depth study of the critical data of the newly confirmed patients, one effective way to improve the social isolation measures requires the formation of an organized tracking knowledge system for the confirmed patients and the personnel who have been removed, and the deep data mining and application. Knowledge graph (KG) is one of the irreplaceable techniques to quickly gather patient contact information and outbreak event, which reflecting the relationship between knowledge evolution and structure of novel Coronavirus. Therefore, this paper proposes a method for the analysis of COVID-19 epidemic situation using knowledge graph combined with interactive visual analysis. Firstly, based on the key factors of novel Coronavirus disease, the entity model of the patient, the relationship type of the patient and the expression of knowledge modeling were proposed, and the knowledge graph of the action track of the COVID-19 patient was deeply explored and comparative summarized. Secondly, in the process of constructing knowledge graph, conditional random field (CRF) algorithm is used to extract entity and knowledge. Meanwhile, to better analyze the disease relationship between patients, the semantic relationship of knowledge graph was combined with the visualization of knowledge graph, and the semantic model was verified by deep learning calculation and node attribute similarity. To discover the community detection of patients in the patient knowledge graph, this paper uses PageRank combined with Label propagation algorithms to discover community propagation in the network. Finally, COVID-19 epidemic situation was analyzed from confirmed patient data and multi-view collaborative interactions, such as map distribution visualization, knowledge graph visualization, and track visualization. The results show that the construction of a knowledge graph of COVID-19 patient activity is feasible for the transmission process, analysis of key nodes and tracing of activity tracks."}