{"abstract":"SUMMARY In recommending to another individual an item that one loves, accuracy is important, however in most cases, focusing only on accuracy generates less satisfactory recommendations. Studies have repeatedly pointed out that aspects that go beyond accuracy—such as the diversity and novelty of the recommended items—are as important as accuracy in making a satisfactory recommendation. Despite their importance, there is no global consensus about deﬁnitions and evaluations regarding beyond-accuracy aspects, as such aspects closely relate to the subjective sensibility of user satisfaction. In addition, devising algorithms for this purpose is di ﬃ cult, because algorithms concurrently pursue the aspects in trade-o ﬀ relation (i.e., accuracy vs. novelty). In the aforementioned situation, for researchers initiating a study in this domain, it is important to obtain a systematically integrated view of the domain. This paper reports the results of a survey of about 70 studies published over the last 15 years, each of which addresses recommendations that consider beyond-accuracy aspects. From this survey, we identify diversity, novelty, and coverage as important aspects in achieving serendipity and popularity unbiasedness—factors that are important to user satisfaction and business proﬁts, respectively. The ﬁve major groups of algorithms that tackle the beyond-accuracy aspects are multi-objective, modiﬁed collaborative ﬁltering (CF), clustering, graph, and hybrid; we then classify and describe algorithms as per this typology. The o ﬀ -line evaluation metrics and user studies carried out by the studies are also described. Based on the survey results, we assert that there is a lot of room for research in the domain. Especially, personalization and generalization are considered important issues that should be addressed in future research (e.g., automatic per-user-trade-o ﬀ among the aspects, and properly establishing beyond-accuracy aspects for various types of applications or algorithms)."}