{"abstract":"none Copyright Information: All rights reserved unless otherwise indicated. Contact the author or original publisher for any necessary permissions. eScholarship is not the copyright owner for deposited works. Learn more at http://www.escholarship.org/help_copyright.html#reuse The Filter Bubble: What the Internet is Hiding from You by Eli Pariser. New York: Penguin Press, 2011. 294 pp. ISBN: 978-0-670-92038-9 “We’re not evil. We try really hard not to be evil. But if we wanted to, man, could we ever.” An unnamed Google engineer, interviewed in The Filter Bubble. In 1991, Mark Weiser wrote, “the most profound technologies are those that disappear. They weave themselves into the fabric of everyday life until they are indistinguishable from it... The constant background presence of these products...does not require active attention...It [becomes] difficult to imagine modern life otherwise” (p. 94). Weiser, a Xerox PARC researcher, would witness the personal computing revolution from an epicenter of technological innovation. Though Weiser’s article did not necessarily anticipate the impact of search engines, “Computing in the 21 st Century,” would prove prescient. More than twenty years after Weiser’s publication, Eli Pariser’s The Filter Bubble examines the unintended consequences of web personalization: technologies which, while not disappearing into society’s fabric, are growing ubiquitous, and therefore less visible in our critical evaluation of information. Pariser’s svelte, readable book is less a polemic and more a work of consumer advocacy. In eight chapters, he examines the cost of personalized intellectual environments from the perspective of many stakeholders: everyday searchers, scholars, Google engineers, marketers, and even national security agents. He argues that search settings and social media allow us to pre-sanitize our information environments without our full realization of the lost information channels. Millions of metrics — from our Facebook \"likes\" to our aggregated history of selected banner ads — accrue into an algorithmic profile of encounter information we deem unpleasant or objectionable. The resulting bubble deflects various new information sources, while still promoting the illusion of comprehensive search. The potential cost is not just anathema to good search, but to the foundations of an informed citizenry. The web we navigate navigates us. Google tracks our searches, engineering \"personalized\" results, which are tailored to our supposed needs. Facebook aggregates our likes, login times, and other metrics to target advertisements. Amazon has built a digital empire on its alchemy of stored consumer behavior, purchase correlation research, and predictive marketing. Marketers have an enormous appetite for data that can help them send the right ad at the right time to prospective consumers. The more aggregated information advertisers can find, the most numbers they can sift. Various algorithms can correlate interests or preferences that many experts would never imagine (Pariser cites the Netflix algorithm Cinematch, which accurately predicted that people who liked Silence of the Lambs typically liked The Wizard of Oz). Samuels: Review: The Filter Bubble: What the Internet is Hiding from You by Eli Pariser"}