{"abstract":"PurposeIn the present era of green consumerism, consumers are shifting towards sustainable consumption with the rising demand of green products. Despite consumers' demand of such products, their attitudes towards eco-friendly practices can neither be the same for different consumer groups nor can be treated as they all are equally green. The purpose of this study is to operationalize the green market segmentation based on demographic, psychographic and behavioural characterization in the Indian context of green consumerism.Design/methodology/approachThe deductive approach of questionnaire survey method has been adapted to collect the responses from convenience sampling of Indian consumers using the measured constructs concerning to green consumer psychology. The data were analyzed by applying multivariate techniques of confirmatory factor analysis (CFA), cluster and discriminant analysis.FindingsThe results revealed that the three distinctive set of consumer groups are evolved as “keen greens”, “moderate greens” and “reluctant greens” based on the eight cognitive variables used in this study, namely environmental concern (EC), perceived environmental knowledge (PEK), perceived consumer effectiveness (PCE), perception of eco-label, perception of eco-brand and environmental advertisements, green purchase intention (GPI) and green purchasing behaviour (GPB) in the Indian context.Research limitations/implicationsThe research findings may lack its generalizability in the Indian context, as the survey strategy is confined with the most populated territory of India. To provide its robustness, the future studies need more heterogeneous sample across the country. The research findings could provide the key insights into policymakers and enterprises in the framing of marketing strategies to promote green consumerism in the setting of emerging economies.Originality/valueThere is dearth of literature concerning to green consumer segmentation based on the “attitude–intention–behaviour” approach in the Indian context. Therefore, the present study endeavours to manifest a holistic description of green consumer classification based on demographic, psychographic and behavioural characterization. At Prima facie, the study is the first that elucidates consumers' segments profile by incorporating environmental cognitive factors from both the perspectives; “consumers” inner stimuli' and “external green marketing cues”, especially in the indigenous Indian setting."}