{"abstract":"This article analyzes the methodology of modeling in the physical sciences and in finance. Whereas hobbyists’ models aim for realistic resemblance to the object of the model, physics models aim for accurate divination. Financial models, the article argues, can at best aim to extrapolate or interpolate from the known prices of liquid securities to the unknown values of illiquid ones. Financial models are therefore best regarded as a collection of mathematically consistent, parallel “thought universes,” each of which will always be far too simple to resemble the real financial world, but whose exploration as a whole can nevertheless provide valuable insight. Although models in physics resemble models in finance, the resemblance is superficial. Models in physics aim at divination—foretelling the future and controlling it. Physicists use two different approaches in creating models. The first approach is to build what physicists call a fundamental model, which describes the dynamics behind events in the real world. A fundamental model consists of a system of principles, usually formulated mathematically, that is used to draw causal inferences about future behavior. Dynamics and causality are a fundamental model’s essential characteristics. The second type of model is what physicists call a phenomenological model. Like fundamental models, phenomenological models are used to make predictions, but they do not state absolute principles; instead, they make pragmatic analogies between things that one would like to understand and things that one already understands from fundamental models. The analogies can be descriptive and useful, but analogies are self-limiting and often have a toylike quality. In physics, one does not delude oneself into thinking of analogies as truth. In finance, in contrast, models are used less for divination than for interpolation or extrapolation from the known dollar prices of liquid securities to the unknown dollar values of illiquid securities. Most financial models do not predict the future; instead, they allow us to compare different prices in the present. In contrast to both fundamental and phenomenological physics models, the truth of a financial model is almost indeterminable because fair value is unknown. If fair value were precisely calculable, markets would not exist. The only law of financial modeling is the law of one price, or the principle of no riskless arbitrage, which states that any two securities with identical estimated future payoffs, no matter how the future turns out, should have identical current prices. The law of one price—this valuation by analogy—is the only genuine law in quantitative finance, and it is not a law of nature. It is a general reflection on the practices of human beings—who, when they have enough time and enough information, will grab a bargain when they see one. The law of one price usually holds over the long run in well-oiled markets with enough savvy participants, but short-lived and even long-lived and persistent exceptions can always be found. How do we use the law of one price to determine value? If we want to estimate the unknown value of a target security, we must find some other replicating portfolio—a collection of liquid securities that has the same estimated future payoffs as the target no matter how the future turns out. The target’s value is simply the value of the replicating portfolio. Where do models come in? One needs a model to show that the target and the replicating portfolio have identical estimated future payoffs under all circumstances. To demonstrate payoff identity, we must (1) specify what we mean by “all circumstances” for each security and (2) find a strategy for creating a replicating portfolio that in each future scenario or circumstance will have payoffs identical to those of the target. That is what the Black–Scholes option pricing model does: It tells us exactly how to replicate or manufacture fruit salad (an option) out of fruit (stocks and bonds). The appropriate price should be the cost of manufacture. The tricky part in building these models is specifying what we mean by “all circumstances.” In the Black–Scholes model, all circumstances means a future in which stock returns are normally distributed and stock prices move continuously. Unfortunately, real stock prices do not behave that way. Specifying future scenarios in financial models is always difficult because markets always outwit us eventually. Even if markets are not strictly random, their vagaries are too rich to capture in a few sentences or equations. The “risk” of using models differs from the risk of flipping coins. Although one cannot predict the result of a coin flip, one knows the probability of the coin’s coming up heads or tails. With a model, however, not even the probability of the model’s being right can be known. Financial models are therefore best regarded as a collection of parallel, inanimate “thought universes” available for exploration. Each universe should be internally consistent, but the financial/human world, unlike the world of matter, is vastly more complex and vivacious than any model we could ever make of it. The right way to engage with a model is to be like a reader of fiction—to suspend disbelief and then push ahead with the model as far as possible."}