{"abstract":"The destruction of the World Trade Center (WTC) on September 11, 2001 (9/11) released large amounts of toxic dusts and fumes into the air that exposed many community members who lived and/or worked in the local area. Many community members, defined as WTC survivors by the federal government, developed lower respiratory symptoms (LRS). We previously reported the persistence of these symptoms in patients with normal spirometry despite treatment with inhaled corticosteroids and/or long-acting bronchodilators. This report expands upon our study of this group with the goal to identify molecular markers associated with exposure and heterogeneity in WTC survivors with LRS using a selected plasma biomarker approach. Samples from WTC survivors with LRS (n = 73, WTCS) and samples from healthy control participants of the NYU Bellevue Asthma Registry (NYUBAR, n = 55) were compared. WTCS provided information regarding WTC dust exposure intensity. Hierarchical clustering of the linear biomarker data identified two clusters within WTCS and two clusters within NYUBAR controls. Comparison of the WTCS clusters showed that one cluster had significantly increased levels of circulating matrix metalloproteinases (MMP1, 2, 3, 8, 12, 13), soluble inflammatory receptors (receptor for advanced glycation end-products-RAGE, Interleukin-1 receptor antagonist (IL-1RA), suppression of tumorigenicity (ST)2, triggering receptor expressed on myeloid cells (TREM)1, IL-6Ra, tumor necrosis factor (TNF)RI, TNFRII), and chemokines (IL-8, CC chemokine ligand- CCL17). Furthermore, this WTCS cluster was associated with WTC exposure variables, ash at work, and the participant category workers; but not with the exposure variable WTC dust cloud at 9/11. A comparison of WTC exposure categorial variables identified that chemokines (CCL17, CCL11), circulating receptors (RAGE, TREM1), MMPs (MMP3, MMP12), and vascular markers (Angiogenin, vascular cell adhesion molecule-VCAM1) significantly increased in the more exposed groups. Circulating biomarkers of remodeling and inflammation identified clusters within WTCS and were associated with WTC exposure."}