{"abstract":"The vast majority of the population is consuming news from various digital sources, including social networking applications such as Twitter and Facebook and other online digital platforms. Such Internet platforms provide malicious entities an opportunity to spread fake news and hoaxes to mislead the population. Besides, Internet users may start to form an opinion and make certain personal or business decisions based on misinformation, leading to undesirable consequences. This paper introduces WhistleBlower, a decentralized and open platform based on the blockchain and distributed ledger technology (DLT) for spotting fake news. The key components of WhistleBlower include a fake news processing engine powered by Artificial Intelligence (AI)/Machine Learning (ML) algorithms, a verifiable computation engine, and a token-curated registry (TCR).WhistleBlower allows the community members to participate in the fake news identification process by running the fake news detection algorithm on their nodes, which would then be validated by a verifiable computation engine to ensure that the public nodes executed the computation honestly and correctly. Whenever a news feed is submitted to WhistleBlower for fake news assessment, it issues a genuineness score, which can then be posted along with the news article to let the newsreaders gauge its legitimacy. However, the genuineness score’s accuracy depends on the machine learning model’s effectiveness that processes the news item. To improve the machine learning algorithm’s reliability, we introduce a Token-curated registry, which enables the public and community members to challenge the algorithm used to estimate the genuineness score. TCR lets the community curate fake news detection algorithms by providing feedback to the ML/AI algorithm developers through the token-curated content moderation process. WhistleBlower is the first open and democratic fake news assessment platform that combines ML/AI, verifiable computation, and TCR to the best of our knowledge."}