{"paperId":"5becc0d68692f36b7d87aab3f1c172a1df370670","externalIds":{"DBLP":"conf/kdd/000100CWHL0W025","ArXiv":"2302.02173","DOI":"10.1145/3711896.3736571","CorpusId":256615863},"title":"A Survey on Deep Learning based Time Series Analysis with Frequency Transformation","openAccessPdf":{"url":"","status":null,"license":null,"disclaimer":"Notice: Paper or abstract available at https://arxiv.org/abs/2302.02173, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."},"authors":[{"authorId":"2060200167","name":"Kun Yi"},{"authorId":"47835189","name":"Qi Zhang"},{"authorId":"2116951322","name":"Shoujin Wang"},{"authorId":"2107477853","name":"Hui He"},{"authorId":"2062835","name":"Guodong Long"},{"authorId":"8253080","name":"Zhendong Niu"}],"abstract":"Recently, frequency transformation (FT) has been increasingly incorporated into deep learning models to significantly enhance state-of-the-art accuracy and efficiency in time series analysis. The advantages of FT, such as high efficiency and a global view, have been rapidly explored and exploited in various time series tasks and applications, demonstrating the promising potential of FT as a new deep learning paradigm for time series analysis. Despite the growing attention and the proliferation of research in this emerging field, there is currently a lack of a systematic review and in-depth analysis of deep learning-based time series models with FT. It is also unclear why FT can enhance time series analysis and what its limitations are in the field. To address these gaps, we present a comprehensive review that systematically investigates and summarizes the recent research advancements in deep learning-based time series analysis with FT. Specifically, we explore the primary approaches used in current models that incorporate FT, the types of neural networks that leverage FT, and the representative FT-equipped models in deep time series analysis. We propose a novel taxonomy to categorize the existing methods in this field, providing a structured overview of the diverse approaches employed in incorporating FT into deep learning models for time series analysis. Finally, we highlight the advantages and limitations of FT for time series modeling and identify potential future research directions that can further contribute to the community of time series analysis."}