{"paperId":"250e1fa7d898f5e6db8138ad7c9e1aa004707fcc","externalIds":{"ArXiv":"2212.04481","DBLP":"journals/csur/SharmaLNSSKK24","DOI":"10.1145/3661821","CorpusId":254408574},"title":"A Survey of Graph Neural Networks for Social Recommender Systems","openAccessPdf":{"url":"https://dl.acm.org/doi/pdf/10.1145/3661821","status":"BRONZE","license":null,"disclaimer":"Notice: Paper or abstract available at https://arxiv.org/abs/2212.04481, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."},"authors":[{"authorId":"1571168324","name":"Kartik Sharma"},{"authorId":"2553299","name":"Yeon-Chang Lee"},{"authorId":"1705173799","name":"S. Nambi"},{"authorId":"2034270410","name":"Aditya Salian"},{"authorId":"2034183967","name":"Shlok Shah"},{"authorId":"2163663454","name":"Sang-Wook Kim"},{"authorId":"39703734","name":"Srijan Kumar"}],"abstract":"Social recommender systems (SocialRS) simultaneously leverage the user-to-item interactions as well as the user-to-user social relations for the task of generating item recommendations to users. Additionally exploiting social relations is clearly effective in understanding users’ tastes due to the effects of homophily and social influence. For this reason, SocialRS has increasingly attracted attention. In particular, with the advance of graph neural networks (GNN), many GNN-based SocialRS methods have been developed recently. Therefore, we conduct a comprehensive and systematic review of the literature on GNN-based SocialRS. In this survey, we first identify 84 papers on GNN-based SocialRS after annotating 2,151 papers by following the PRISMA framework (preferred reporting items for systematic reviews and meta-analyses). Then, we comprehensively review them in terms of their inputs and architectures to propose a novel taxonomy: (1) input taxonomy includes five groups of input type notations and seven groups of input representation notations; (2) architecture taxonomy includes eight groups of GNN encoder notations, two groups of decoder notations, and 12 groups of loss function notations. We classify the GNN-based SocialRS methods into several categories as per the taxonomy and describe their details. Furthermore, we summarize benchmark datasets and metrics widely used to evaluate the GNN-based SocialRS methods. Finally, we conclude this survey by presenting some future research directions. GitHub repository with the curated list of papers are available at https://github.com/claws-lab/awesome-GNN-social-recsys"}