{"paperId":"186aeaf08e545a62fd975ac56068d9b5f2043ad9","externalIds":{"DBLP":"journals/corr/abs-2312-10073","ArXiv":"2312.10073","DOI":"10.1145/3639063","CorpusId":266348247},"title":"Data Scarcity in Recommendation Systems: A Survey","openAccessPdf":{"url":"https://dl.acm.org/doi/pdf/10.1145/3639063","status":"BRONZE","license":null,"disclaimer":"Notice: Paper or abstract available at https://arxiv.org/abs/2312.10073, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."},"authors":[{"authorId":"2111435045","name":"Zefeng Chen"},{"authorId":"2248178756","name":"Wensheng Gan"},{"authorId":"2192664589","name":"Jiayang Wu"},{"authorId":"2218088927","name":"Kaixia Hu"},{"authorId":"2140049261","name":"Hong Lin"}],"abstract":"The prevalence of online content has led to the widespread adoption of recommendation systems (RSs), which serve diverse purposes such as news, advertisements, and e-commerce recommendations. Despite their significance, data scarcity issues have significantly impaired the effectiveness of existing RS models and hindered their progress. To address this challenge, the concept of knowledge transfer, particularly from external sources like pre-trained language models, emerges as a potential solution to alleviate data scarcity and enhance RS development. However, the practice of knowledge transfer in RSs is intricate. Transferring knowledge between domains introduces data disparities, and the application of knowledge transfer in complex RS scenarios can yield negative consequences if not carefully designed. Therefore, this article contributes to this discourse by addressing the implications of data scarcity on RSs and introducing various strategies, such as data augmentation, self-supervised learning, transfer learning, broad learning, and knowledge graph utilization, to mitigate this challenge. Furthermore, it delves into the challenges and future direction within the RS domain, offering insights that are poised to facilitate the development and implementation of robust RSs, particularly when confronted with data scarcity. We aim to provide valuable guidance and inspiration for researchers and practitioners, ultimately driving advancements in the field of RS."}