{"paperId":"99b65263b82b3d9d532377706ceb5d6733e5f0a9","externalIds":{"ArXiv":"2405.09592","DBLP":"journals/corr/abs-2405-09592","DOI":"10.48550/arXiv.2405.09592","CorpusId":269791158},"title":"A Survey of Generative Techniques for Spatial-Temporal Data Mining","openAccessPdf":{"url":"","status":null,"license":null,"disclaimer":"Notice: Paper or abstract available at https://arxiv.org/abs/2405.09592, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."},"authors":[{"authorId":"1500649148","name":"Qianru Zhang"},{"authorId":"2279762001","name":"Haixin Wang"},{"authorId":"2301457384","name":"Cheng Long"},{"authorId":"2302286242","name":"Liangcai Su"},{"authorId":"1754500","name":"Xingwei He"},{"authorId":"2294434616","name":"Jianlong Chang"},{"authorId":"2279761135","name":"Tailin Wu"},{"authorId":"2302520304","name":"Hongzhi Yin"},{"authorId":"2184000509","name":"S. Yiu"},{"authorId":"2149898830","name":"Qi Tian"},{"authorId":"2293317939","name":"Christian S. Jensen"}],"abstract":"This paper focuses on the integration of generative techniques into spatial-temporal data mining, considering the significant growth and diverse nature of spatial-temporal data. With the advancements in RNNs, CNNs, and other non-generative techniques, researchers have explored their application in capturing temporal and spatial dependencies within spatial-temporal data. However, the emergence of generative techniques such as LLMs, SSL, Seq2Seq and diffusion models has opened up new possibilities for enhancing spatial-temporal data mining further. The paper provides a comprehensive analysis of generative technique-based spatial-temporal methods and introduces a standardized framework specifically designed for the spatial-temporal data mining pipeline. By offering a detailed review and a novel taxonomy of spatial-temporal methodology utilizing generative techniques, the paper enables a deeper understanding of the various techniques employed in this field. Furthermore, the paper highlights promising future research directions, urging researchers to delve deeper into spatial-temporal data mining. It emphasizes the need to explore untapped opportunities and push the boundaries of knowledge to unlock new insights and improve the effectiveness and efficiency of spatial-temporal data mining. By integrating generative techniques and providing a standardized framework, the paper contributes to advancing the field and encourages researchers to explore the vast potential of generative techniques in spatial-temporal data mining."}