{"paperId":"bac54736112098616f0e1c90435888ef3e119d32","externalIds":{"DBLP":"journals/tois/LinDXLCZLWLZGYTZ25","ArXiv":"2306.05817","DOI":"10.1145/3678004","CorpusId":259129651},"title":"How Can Recommender Systems Benefit from Large Language Models: A Survey","openAccessPdf":{"url":"","status":null,"license":null,"disclaimer":"Notice: Paper or abstract available at https://arxiv.org/abs/2306.05817, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."},"authors":[{"authorId":"2144908858","name":"Jianghao Lin"},{"authorId":"2105646417","name":"Xinyi Dai"},{"authorId":"2056826850","name":"Yunjia Xi"},{"authorId":"2130051800","name":"Weiwen Liu"},{"authorId":"92633145","name":"Bo Chen"},{"authorId":"2181637944","name":"Xiangyang Li"},{"authorId":"2115802321","name":"Chenxu Zhu"},{"authorId":"3339005","name":"Huifeng Guo"},{"authorId":"2156098229","name":"Yong Yu"},{"authorId":"2824766","name":"Ruiming Tang"},{"authorId":"2108309275","name":"Weinan Zhang"}],"abstract":"With the rapid development of online services and web applications, recommender systems (RS) have become increasingly indispensable for mitigating information overload and matching users’ information needs by providing personalized suggestions over items. Although the RS research community has made remarkable progress over the past decades, conventional recommendation models (CRM) still have some limitations, e.g., lacking open-domain world knowledge, and difficulties in comprehending users’ underlying preferences and motivations. Meanwhile, large language models (LLM) have shown impressive general intelligence and human-like capabilities for various natural language processing (NLP) tasks, which mainly stem from their extensive open-world knowledge, logical and commonsense reasoning abilities, as well as their comprehension of human culture and society. Consequently, the emergence of LLM is inspiring the design of RS and pointing out a promising research direction, i.e., whether we can incorporate LLM and benefit from their common knowledge and capabilities to compensate for the limitations of CRM. In this article, we conduct a comprehensive survey on this research direction, and draw a bird’s-eye view from the perspective of the whole pipeline in real-world RS. Specifically, we summarize existing research works from two orthogonal aspects: where and how to adapt LLM to RS. For the “WHERE” question, we discuss the roles that LLM could play in different stages of the recommendation pipeline, i.e., feature engineering, feature encoder, scoring/ranking function, user interaction, and pipeline controller. For the “HOW” question, we investigate the training and inference strategies, resulting in two fine-grained taxonomy criteria, i.e., whether to tune LLM or not during training, and whether to involve CRM for inference. Detailed analysis and general development paths are provided for both “WHERE” and “HOW” questions, respectively. Then, we highlight the key challenges in adapting LLM to RS from three aspects, i.e., efficiency, effectiveness, and ethics. Finally, we summarize the survey and discuss the future prospects."}