{"paperId":"2a487ca3f9a1431f2a21a70d97e12dd955985d88","externalIds":{"DBLP":"conf/ijcai/WangDYQCZWLW25","ArXiv":"2402.04059","DOI":"10.48550/arXiv.2402.04059","CorpusId":267499615},"title":"Deep Learning for Multivariate Time Series Imputation: A Survey","openAccessPdf":{"url":"","status":null,"license":null,"disclaimer":"Notice: Paper or abstract available at https://arxiv.org/abs/2402.04059, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."},"authors":[{"authorId":"2283071353","name":"Jun Wang"},{"authorId":"2049476022","name":"Wenjie Du"},{"authorId":"2190953133","name":"Wei Cao"},{"authorId":"2282953676","name":"Keli Zhang"},{"authorId":"2283086874","name":"Wenjia Wang"},{"authorId":"2253824408","name":"Yuxuan Liang"},{"authorId":"2253561592","name":"Qingsong Wen"}],"abstract":"Missing values are ubiquitous in multivariate time series (MTS) data, posing significant challenges for accurate analysis and downstream applications. In recent years, deep learning-based methods have successfully handled missing data by leveraging complex temporal dependencies and learned data distributions. In this survey, we provide a comprehensive summary of deep learning approaches for multivariate time series imputation (MTSI) tasks. We propose a novel taxonomy that categorizes existing methods based on two key perspectives: imputation uncertainty and neural network architecture. Furthermore, we summarize existing MTSI toolkits with a particular emphasis on the PyPOTS Ecosystem, which provides an integrated and standardized foundation for MTSI research. Finally, we discuss key challenges and future research directions, which give insight for further MTSI research. This survey aims to serve as a valuable resource for researchers and practitioners in the field of time series analysis and missing data imputation tasks. A well-maintained MTSI paper and tool list is available at https://github.com/WenjieDu/Awesome_Imputation."}