{"paperId":"dad36d9b8d51e7ae14150a48a76bde0a8eb50eac","externalIds":{"DBLP":"journals/csur/ParragaMOGKMMSB25","ArXiv":"2211.05617","DOI":"10.1145/3637549","CorpusId":266363441},"title":"Fairness in Deep Learning: A Survey on Vision and Language Research","openAccessPdf":{"url":"https://dl.acm.org/doi/pdf/10.1145/3637549","status":"BRONZE","license":null,"disclaimer":"Notice: Paper or abstract available at https://arxiv.org/abs/2211.05617, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."},"authors":[{"authorId":"2154617774","name":"Otávio Parraga"},{"authorId":"41050099","name":"Martin D. Móre"},{"authorId":"2154309948","name":"C. M. Oliveira"},{"authorId":"1660809827","name":"Nathan Gavenski"},{"authorId":"2275267617","name":"L. Kupssinskü"},{"authorId":"2190427449","name":"Adilson Medronha"},{"authorId":"2190427616","name":"L. V. Moura"},{"authorId":"153255514","name":"Gabriel S. Simões"},{"authorId":"2275262527","name":"Rodrigo C. Barros"}],"abstract":"Despite being responsible for state-of-the-art results in several computer vision and natural language processing tasks, neural networks have faced harsh criticism due to some of their current shortcomings. One of them is that neural networks are correlation machines prone to model biases within the data instead of focusing on actual useful causal relationships. This problem is particularly serious in application domains affected by aspects such as race, gender, and age. To prevent models from incurring unfair decision-making, the AI community has concentrated efforts on correcting algorithmic biases, giving rise to the research area now widely known as fairness in AI. In this survey paper, we provide an in-depth overview of the main debiasing methods for fairness-aware neural networks in the context of vision and language research. We propose a novel taxonomy that builds upon previous proposals but is tailored for deep learning research to better organize the literature on debiasing methods for fairness. We review all important neural-based methods and evaluation metrics while discussing the current challenges, trends, and important future work directions for the interested researcher and practitioner."}