{"paperId":"d3cf086517a959bd254c51130d53dbd3541b3979","externalIds":{"DBLP":"journals/corr/abs-2307-12639","ArXiv":"2307.12639","DOI":"10.48550/arXiv.2307.12639","CorpusId":260125358},"title":"Fake News Detection Through Graph-based Neural Networks: A Survey","openAccessPdf":{"url":"https://arxiv.org/pdf/2307.12639","status":"GREEN","license":null,"disclaimer":"Notice: Paper or abstract available at https://arxiv.org/abs/2307.12639, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."},"authors":[{"authorId":"2156841161","name":"Shuzhi Gong"},{"authorId":"1715097","name":"R. Sinnott"},{"authorId":"2149459181","name":"Jianzhong Qi"},{"authorId":"2063030251","name":"Cécile Paris"}],"abstract":"The popularity of online social networks has enabled rapid dissemination of information. People now can share and consume information much more rapidly than ever before. However, low-quality and/or accidentally/deliberately fake information can also spread rapidly. This can lead to considerable and negative impacts on society. Identifying, labelling and debunking online misinformation as early as possible has become an increasingly urgent problem. Many methods have been proposed to detect fake news including many deep learning and graph-based approaches. In recent years, graph-based methods have yielded strong results, as they can closely model the social context and propagation process of online news. In this paper, we present a systematic review of fake news detection studies based on graph-based and deep learning-based techniques. We classify existing graph-based methods into knowledge-driven methods, propagation-based methods, and heterogeneous social context-based methods, depending on how a graph structure is constructed to model news related information flows. We further discuss the challenges and open problems in graph-based fake news detection and identify future research directions."}