{"paperId":"7b81c34d39995b890d22285d368eb115a68879d3","externalIds":{"ArXiv":"2408.06687","DBLP":"journals/ijcv/HondruCMIS25","DOI":"10.1007/s11263-025-02524-1","CorpusId":271860056},"title":"Masked Image Modeling: A Survey","openAccessPdf":{"url":"","status":null,"license":null,"disclaimer":"Notice: Paper or abstract available at https://arxiv.org/abs/2408.06687, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."},"authors":[{"authorId":"123480571","name":"Vlad Hondru"},{"authorId":"2154573729","name":"Florinel-Alin Croitoru"},{"authorId":"2164604","name":"Shervin Minaee"},{"authorId":"2257965900","name":"Radu Tudor Ionescu"},{"authorId":"1429806753","name":"N. Sebe"}],"abstract":"In this work, we survey recent studies on masked image modeling (MIM), an approach that emerged as a powerful self-supervised learning technique in computer vision. The MIM task involves masking some information, e.g. pixels, patches, or even latent representations, and training a model, usually an autoencoder, to predicting the missing information by using the context available in the visible part of the input. We identify and formalize two categories of approaches on how to implement MIM as a pretext task, one based on reconstruction and one based on contrastive learning. Then, we construct a taxonomy and review the most prominent papers in recent years. We complement the manually constructed taxonomy with a dendrogram obtained by applying a hierarchical clustering algorithm. We further identify relevant clusters via manually inspecting the resulting dendrogram. Our review also includes datasets that are commonly used in MIM research. We aggregate the performance results of various masked image modeling methods on the most popular datasets, to facilitate the comparison of competing methods. Finally, we identify research gaps and propose several interesting directions of future work. We supplement our survey with the following public repository containing organized references: https://github.com/vladhondru25/MIM-Survey."}