{"paperId":"06d860a5bbb99a4eafdbbb2d5f6aa8dd5fd32cf4","externalIds":{"ArXiv":"2401.05459","DBLP":"journals/corr/abs-2401-05459","DOI":"10.48550/arXiv.2401.05459","CorpusId":266933252},"title":"Personal LLM Agents: Insights and Survey about the Capability, Efficiency and Security","openAccessPdf":{"url":"","status":null,"license":null,"disclaimer":"Notice: Paper or abstract available at https://arxiv.org/abs/2401.05459, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."},"authors":[{"authorId":"2144416765","name":"Yuanchun Li"},{"authorId":"2188861830","name":"Hao Wen"},{"authorId":"2235256501","name":"Weijun Wang"},{"authorId":"2303907684","name":"Xiangyu Li"},{"authorId":"2220186156","name":"Yizhen Yuan"},{"authorId":"2235520970","name":"Guohong Liu"},{"authorId":"2306055502","name":"Jiacheng Liu"},{"authorId":"2236181887","name":"Wenxing Xu"},{"authorId":"2335737961","name":"Xiang Wang"},{"authorId":"2279192869","name":"Yi Sun"},{"authorId":"2279022002","name":"Rui Kong"},{"authorId":"2279098701","name":"Yile Wang"},{"authorId":"2279022354","name":"Hanfei Geng"},{"authorId":"2257013742","name":"Jian Luan"},{"authorId":"2279327977","name":"Xuefeng Jin"},{"authorId":"2202520157","name":"Zi-Liang Ye"},{"authorId":"2279022490","name":"Guanjing Xiong"},{"authorId":"2279267483","name":"Fan Zhang"},{"authorId":"2307049398","name":"Xiang Li"},{"authorId":"2239403838","name":"Mengwei Xu"},{"authorId":"2274446834","name":"Zhijun Li"},{"authorId":"144326610","name":"Peng Li"},{"authorId":"2268734755","name":"Yang Liu"},{"authorId":"2220028284","name":"Yaqiong Zhang"},{"authorId":"2276471113","name":"Yunxin Liu"}],"abstract":"Since the advent of personal computing devices, intelligent personal assistants (IPAs) have been one of the key technologies that researchers and engineers have focused on, aiming to help users efficiently obtain information and execute tasks, and provide users with more intelligent, convenient, and rich interaction experiences. With the development of smartphones and IoT, computing and sensing devices have become ubiquitous, greatly expanding the boundaries of IPAs. However, due to the lack of capabilities such as user intent understanding, task planning, tool using, and personal data management etc., existing IPAs still have limited practicality and scalability. Recently, the emergence of foundation models, represented by large language models (LLMs), brings new opportunities for the development of IPAs. With the powerful semantic understanding and reasoning capabilities, LLM can enable intelligent agents to solve complex problems autonomously. In this paper, we focus on Personal LLM Agents, which are LLM-based agents that are deeply integrated with personal data and personal devices and used for personal assistance. We envision that Personal LLM Agents will become a major software paradigm for end-users in the upcoming era. To realize this vision, we take the first step to discuss several important questions about Personal LLM Agents, including their architecture, capability, efficiency and security. We start by summarizing the key components and design choices in the architecture of Personal LLM Agents, followed by an in-depth analysis of the opinions collected from domain experts. Next, we discuss several key challenges to achieve intelligent, efficient and secure Personal LLM Agents, followed by a comprehensive survey of representative solutions to address these challenges."}