{"paperId":"fd2be70debe968d67514507c1bc362c78867ff15","externalIds":{"DBLP":"journals/tnn/DelongMF25","ArXiv":"2302.07200","DOI":"10.1109/TNNLS.2024.3420218","CorpusId":256846610,"PubMed":"39024082"},"title":"Neurosymbolic AI for Reasoning Over Knowledge Graphs: A Survey","openAccessPdf":{"url":"http://arxiv.org/pdf/2302.07200","status":"GREEN","license":null,"disclaimer":"Notice: Paper or abstract available at https://arxiv.org/abs/2302.07200, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."},"authors":[{"authorId":"91051221","name":"L. Delong"},{"authorId":"2202222159","name":"Ramon Fern'andez Mir"},{"authorId":"2320148","name":"Jacques D. Fleuriot"}],"abstract":"Neurosymbolic artificial intelligence (AI) is an increasingly active area of research that combines symbolic reasoning methods with deep learning to leverage their complementary benefits. As knowledge graphs (KGs) are becoming a popular way to represent heterogeneous and multirelational data, methods for reasoning on graph structures have attempted to follow this neurosymbolic paradigm. Traditionally, such approaches have utilized either rule-based inference or generated representative numerical embeddings from which patterns could be extracted. However, several recent studies have attempted to bridge this dichotomy to generate models that facilitate interpretability, maintain competitive performance, and integrate expert knowledge. Therefore, we survey methods that perform neurosymbolic reasoning tasks on KGs and propose a novel taxonomy by which we can classify them. Specifically, we propose three major categories: 1) logically informed embedding approaches; 2) embedding approaches with logical constraints; and 3) rule-learning approaches. Alongside the taxonomy, we provide a tabular overview of the approaches and links to their source code, if available, for more direct comparison. Finally, we discuss the unique characteristics and limitations of these methods and then propose several prospective directions toward which this field of research could evolve."}