{"paperId":"b57b8b6b8052bf2e7f6fe5c8e91cdcb385b75ab6","externalIds":{"DBLP":"journals/mia/KazerouniAHAFHM23","ArXiv":"2211.07804","DOI":"10.1016/j.media.2023.102846","CorpusId":253523207,"PubMed":"37295311"},"title":"Diffusion models in medical imaging: A comprehensive survey","openAccessPdf":{"url":"","status":"CLOSED","license":null,"disclaimer":"Notice: Paper or abstract available at https://arxiv.org/abs/2211.07804, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."},"authors":[{"authorId":"2131612425","name":"A. Kazerouni"},{"authorId":"1411236504","name":"Ehsan Khodapanah Aghdam"},{"authorId":"1491490451","name":"Moein Heidari"},{"authorId":"1763181","name":"Reza Azad"},{"authorId":null,"name":"Mohsen Fayyaz"},{"authorId":"1836588","name":"I. Hacihaliloglu"},{"authorId":"1737693","name":"D. Merhof"}],"abstract":"Denoising diffusion models, a class of generative models, have garnered immense interest lately in various deep-learning problems. A diffusion probabilistic model defines a forward diffusion stage where the input data is gradually perturbed over several steps by adding Gaussian noise and then learns to reverse the diffusion process to retrieve the desired noise-free data from noisy data samples. Diffusion models are widely appreciated for their strong mode coverage and quality of the generated samples in spite of their known computational burdens. Capitalizing on the advances in computer vision, the field of medical imaging has also observed a growing interest in diffusion models. With the aim of helping the researcher navigate this profusion, this survey intends to provide a comprehensive overview of diffusion models in the discipline of medical imaging. Specifically, we start with an introduction to the solid theoretical foundation and fundamental concepts behind diffusion models and the three generic diffusion modeling frameworks, namely, diffusion probabilistic models, noise-conditioned score networks, and stochastic differential equations. Then, we provide a systematic taxonomy of diffusion models in the medical domain and propose a multi-perspective categorization based on their application, imaging modality, organ of interest, and algorithms. To this end, we cover extensive applications of diffusion models in the medical domain, including image-to-image translation, reconstruction, registration, classification, segmentation, denoising, 2/3D generation, anomaly detection, and other medically-related challenges. Furthermore, we emphasize the practical use case of some selected approaches, and then we discuss the limitations of the diffusion models in the medical domain and propose several directions to fulfill the demands of this field. Finally, we gather the overviewed studies with their available open-source implementations at our GitHub.1 We aim to update the relevant latest papers within it regularly."}