{"paperId":"c342f43eab66ebb3797438e57c8be1b8e7712e96","externalIds":{"DBLP":"journals/corr/abs-2302-12150","ArXiv":"2302.12150","DOI":"10.48550/arXiv.2302.12150","CorpusId":257102679},"title":"A Survey of Secure Computation Using Trusted Execution Environments","openAccessPdf":{"url":"http://arxiv.org/pdf/2302.12150","status":"CLOSED","license":null,"disclaimer":"Notice: Paper or abstract available at https://arxiv.org/abs/2302.12150, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."},"authors":[{"authorId":"3372056","name":"Xiaoguo Li"},{"authorId":"2112525052","name":"Bowen Zhao"},{"authorId":"1680944","name":"Guomin Yang"},{"authorId":"2052787770","name":"Tao Xiang"},{"authorId":"145369053","name":"J. Weng"},{"authorId":"2130557534","name":"R. Deng"}],"abstract":"As an essential technology underpinning trusted computing, the trusted execution environment (TEE) allows one to launch computation tasks on both on- and off-premises data while assuring confidentiality and integrity. This article provides a systematic review and comparison of TEE-based secure computation protocols. We first propose a taxonomy that classifies secure computation protocols into three major categories, namely secure outsourced computation, secure distributed computation and secure multi-party computation. To enable a fair comparison of these protocols, we also present comprehensive assessment criteria with respect to four aspects: setting, methodology, security and performance. Based on these criteria, we review, discuss and compare the state-of-the-art TEE-based secure computation protocols for both general-purpose computation functions and special-purpose ones, such as privacy-preserving machine learning and encrypted database queries. To the best of our knowledge, this article is the first survey to review TEE-based secure computation protocols and the comprehensive comparison can serve as a guideline for selecting suitable protocols for deployment in practice. Finally, we also discuss several future research directions and challenges."}