{"paperId":"1725ad1d8cc0e539ac5d0a85657d5c95b4538c5e","externalIds":{"ArXiv":"2306.10125","DBLP":"journals/corr/abs-2306-10125","DOI":"10.1109/TPAMI.2024.3387317","CorpusId":259203853,"PubMed":"38598381"},"title":"Self-Supervised Learning for Time Series Analysis: Taxonomy, Progress, and Prospects","openAccessPdf":{"url":"https://arxiv.org/pdf/2306.10125","status":"GREEN","license":null,"disclaimer":"Notice: Paper or abstract available at https://arxiv.org/abs/2306.10125, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."},"authors":[{"authorId":"2119059780","name":"Kexin Zhang"},{"authorId":"3308963","name":"Qingsong Wen"},{"authorId":"2152737103","name":"Chaoli Zhang"},{"authorId":"2136700261","name":"Rongyao Cai"},{"authorId":"2072905592","name":"Ming Jin"},{"authorId":"2144384782","name":"Yong Liu"},{"authorId":"2108020140","name":"James Zhang"},{"authorId":"72322304","name":"Y. Liang"},{"authorId":"3224619","name":"Guansong Pang"},{"authorId":"2451800","name":"Dongjin Song"},{"authorId":"2585415","name":"Shirui Pan"}],"abstract":"Self-supervised learning (SSL) has recently achieved impressive performance on various time series tasks. The most prominent advantage of SSL is that it reduces the dependence on labeled data. Based on the pre-training and fine-tuning strategy, even a small amount of labeled data can achieve high performance. Compared with many published self-supervised surveys on computer vision and natural language processing, a comprehensive survey for time series SSL is still missing. To fill this gap, we review current state-of-the-art SSL methods for time series data in this article. To this end, we first comprehensively review existing surveys related to SSL and time series, and then provide a new taxonomy of existing time series SSL methods by summarizing them from three perspectives: generative-based, contrastive-based, and adversarial-based. These methods are further divided into ten subcategories with detailed reviews and discussions about their key intuitions, main frameworks, advantages and disadvantages. To facilitate the experiments and validation of time series SSL methods, we also summarize datasets commonly used in time series forecasting, classification, anomaly detection, and clustering tasks. Finally, we present the future directions of SSL for time series analysis."}