{"paperId":"cff8f8953c1ddf7dab1738c98d1f3ad7e3e0fb6a","externalIds":{"DBLP":"journals/corr/abs-2401-11734","ArXiv":"2401.11734","DOI":"10.48550/arXiv.2401.11734","CorpusId":267069452},"title":"Colorectal Polyp Segmentation in the Deep Learning Era: A Comprehensive Survey","openAccessPdf":{"url":"","status":null,"license":null,"disclaimer":"Notice: Paper or abstract available at https://arxiv.org/abs/2401.11734, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."},"authors":[{"authorId":"153006313","name":"Zhenyu Wu"},{"authorId":"2280146127","name":"Fengmao Lv"},{"authorId":"3289090","name":"Chenglizhao Chen"},{"authorId":"2280147665","name":"Aimin Hao"},{"authorId":"2280266606","name":"Shuo Li"}],"abstract":"Colorectal polyp segmentation (CPS), an essential problem in medical image analysis, has garnered growing research attention. Recently, the deep learning-based model completely overwhelmed traditional methods in the field of CPS, and more and more deep CPS methods have emerged, bringing the CPS into the deep learning era. To help the researchers quickly grasp the main techniques, datasets, evaluation metrics, challenges, and trending of deep CPS, this paper presents a systematic and comprehensive review of deep-learning-based CPS methods from 2014 to 2023, a total of 115 technical papers. In particular, we first provide a comprehensive review of the current deep CPS with a novel taxonomy, including network architectures, level of supervision, and learning paradigm. More specifically, network architectures include eight subcategories, the level of supervision comprises six subcategories, and the learning paradigm encompasses 12 subcategories, totaling 26 subcategories. Then, we provided a comprehensive analysis the characteristics of each dataset, including the number of datasets, annotation types, image resolution, polyp size, contrast values, and polyp location. Following that, we summarized CPS's commonly used evaluation metrics and conducted a detailed analysis of 40 deep SOTA models, including out-of-distribution generalization and attribute-based performance analysis. Finally, we discussed deep learning-based CPS methods' main challenges and opportunities."}