{"paperId":"c745b62a3f848e2c3a196a5943693085dcb45073","externalIds":{"DBLP":"journals/corr/abs-2303-09253","ArXiv":"2303.09253","DOI":"10.48550/arXiv.2303.09253","CorpusId":257557710},"title":"A Survey of Deep Visual Cross-Domain Few-Shot Learning","openAccessPdf":{"url":"http://arxiv.org/pdf/2303.09253","status":"CLOSED","license":null,"disclaimer":"Notice: Paper or abstract available at https://arxiv.org/abs/2303.09253, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."},"authors":[{"authorId":"2146359848","name":"Wenjian Wang"},{"authorId":"2150682458","name":"Lijuan Duan"},{"authorId":"2115829788","name":"Yuxi Wang"},{"authorId":"2699495","name":"Junsong Fan"},{"authorId":"2181713080","name":"Zhi Gong"},{"authorId":"145274329","name":"Zhaoxiang Zhang"}],"abstract":"Few-Shot transfer learning has become a major focus of research as it allows recognition of new classes with limited labeled data. While it is assumed that train and test data have the same data distribution, this is often not the case in real-world applications. This leads to decreased model transfer effects when the new class distribution differs significantly from the learned classes. Research into Cross-Domain Few-Shot (CDFS) has emerged to address this issue, forming a more challenging and realistic setting. In this survey, we provide a detailed taxonomy of CDFS from the problem setting and corresponding solutions view. We summarise the existing CDFS network architectures and discuss the solution ideas for each direction the taxonomy indicates. Furthermore, we introduce various CDFS downstream applications and outline classification, detection, and segmentation benchmarks and corresponding standards for evaluation. We also discuss the challenges of CDFS research and explore potential directions for future investigation. Through this review, we aim to provide comprehensive guidance on CDFS research, enabling researchers to gain insight into the state-of-the-art while allowing them to build upon existing solutions to develop their own CDFS models."}