{"paperId":"a8ebcfe549bc27bd833535bcdf79f081b7acfcd4","externalIds":{"ArXiv":"2408.06027","DBLP":"journals/corr/abs-2408-06027","DOI":"10.48550/arXiv.2408.06027","CorpusId":271855222},"title":"A Comprehensive Survey on EEG-Based Emotion Recognition: A Graph-Based Perspective","openAccessPdf":{"url":"","status":null,"license":null,"disclaimer":"Notice: Paper or abstract available at https://arxiv.org/abs/2408.06027, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."},"authors":[{"authorId":"2331614243","name":"Chenyu Liu"},{"authorId":"1637883582","name":"Xin-qiu Zhou"},{"authorId":"2282499111","name":"Yihao Wu"},{"authorId":"2315947667","name":"Yi Ding"},{"authorId":"2810171","name":"Liming Zhai"},{"authorId":"2326504766","name":"Kun Wang"},{"authorId":"2282472613","name":"Ziyu Jia"},{"authorId":"2282521827","name":"Yang Liu"}],"abstract":"Compared to other modalities, electroencephalogram (EEG) based emotion recognition can intuitively respond to emotional patterns in the human brain and, therefore, has become one of the most focused tasks in affective computing. The nature of emotions is a physiological and psychological state change in response to brain region connectivity, making emotion recognition focus more on the dependency between brain regions instead of specific brain regions. A significant trend is the application of graphs to encapsulate such dependency as dynamic functional connections between nodes across temporal and spatial dimensions. Concurrently, the neuroscientific underpinnings behind this dependency endow the application of graphs in this field with a distinctive significance. However, there is neither a comprehensive review nor a tutorial for constructing emotion-relevant graphs in EEG-based emotion recognition. In this paper, we present a comprehensive survey of these studies, delivering a systematic review of graph-related methods in this field from a methodological perspective. We propose a unified framework for graph applications in this field and categorize these methods on this basis. Finally, based on previous studies, we also present several open challenges and future directions in this field."}