{"paperId":"9348656b761f7b76fb65cfe6fac55386b04a3a8a","externalIds":{"DBLP":"journals/corr/abs-2302-00487","ArXiv":"2302.00487","DOI":"10.1109/TPAMI.2024.3367329","CorpusId":256459333,"PubMed":"38407999"},"title":"A Comprehensive Survey of Continual Learning: Theory, Method and Application","openAccessPdf":{"url":"http://arxiv.org/pdf/2302.00487","status":"GREEN","license":null,"disclaimer":"Notice: Paper or abstract available at https://arxiv.org/abs/2302.00487, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."},"authors":[{"authorId":"1390770350","name":"Liyuan Wang"},{"authorId":"37409910","name":"Xingxing Zhang"},{"authorId":"2093561216","name":"Hang Su"},{"authorId":"145254043","name":"Jun Zhu"}],"abstract":"To cope with real-world dynamics, an intelligent system needs to incrementally acquire, update, accumulate, and exploit knowledge throughout its lifetime. This ability, known as continual learning, provides a foundation for AI systems to develop themselves adaptively. In a general sense, continual learning is explicitly limited by catastrophic forgetting, where learning a new task usually results in a dramatic performance drop of the old tasks. Beyond this, increasingly numerous advances have emerged in recent years that largely extend the understanding and application of continual learning. The growing and widespread interest in this direction demonstrates its realistic significance as well as complexity. In this work, we present a comprehensive survey of continual learning, seeking to bridge the basic settings, theoretical foundations, representative methods, and practical applications. Based on existing theoretical and empirical results, we summarize the general objectives of continual learning as ensuring a proper stability-plasticity trade-off and an adequate intra/inter-task generalizability in the context of resource efficiency. Then we provide a state-of-the-art and elaborated taxonomy, extensively analyzing how representative strategies address continual learning, and how they are adapted to particular challenges in various applications. Through an in-depth discussion of promising directions, we believe that such a holistic perspective can greatly facilitate subsequent exploration in this field and beyond."}