{"paperId":"e47e8e98e7bcefe30ee5fc1a8836f44f272949c8","externalIds":{"ArXiv":"2401.06542","DBLP":"journals/corr/abs-2401-06542","DOI":"10.48550/arXiv.2401.06542","CorpusId":274130151},"title":"Robustness-Aware 3D Object Detection in Autonomous Driving: A Review and Outlook","openAccessPdf":{"url":"","status":null,"license":null,"disclaimer":"Notice: Paper or abstract available at https://arxiv.org/abs/2401.06542, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."},"authors":[{"authorId":"2257123101","name":"Ziying Song"},{"authorId":"2232574139","name":"Lin Liu"},{"authorId":"2163184299","name":"Feiyang Jia"},{"authorId":"2279402741","name":"Yadan Luo"},{"authorId":"2278578270","name":"Guoxin Zhang"},{"authorId":"2257380929","name":"Lei Yang"},{"authorId":"2278451900","name":"Li Wang"},{"authorId":"2257423721","name":"Caiyan Jia"}],"abstract":"In the realm of modern autonomous driving, the perception system is indispensable for accurately assessing the state of the surrounding environment, thereby enabling informed prediction and planning. The key step to this system is related to 3D object detection that utilizes vehicle-mounted sensors such as LiDAR and cameras to identify the size, the category, and the location of nearby objects. Despite the surge in 3D object detection methods aimed at enhancing detection precision and efficiency, there is a gap in the literature that systematically examines their resilience against environmental variations, noise, and weather changes. This study emphasizes the importance of robustness, alongside accuracy and latency, in evaluating perception systems under practical scenarios. Our work presents an extensive survey of camera-only, LiDAR-only, and multi-modal 3D object detection algorithms, thoroughly evaluating their trade-off between accuracy, latency, and robustness, particularly on datasets like KITTI-C and nuScenes-C to ensure fair comparisons. Among these, multi-modal 3D detection approaches exhibit superior robustness, and a novel taxonomy is introduced to reorganize the literature for enhanced clarity. This survey aims to offer a more practical perspective on the current capabilities and the constraints of 3D object detection algorithms in real-world applications, thus steering future research towards robustness-centric advancements."}