{"paperId":"2e56691505c8517e1471dab1fc6b2b6d7d02a38a","externalIds":{"ArXiv":"2405.18216","DBLP":"journals/corr/abs-2405-18216","DOI":"10.48550/arXiv.2405.18216","CorpusId":270068096},"title":"A Survey on Modern Code Review: Progresses, Challenges and Opportunities","openAccessPdf":{"url":"","status":null,"license":null,"disclaimer":"Notice: Paper or abstract available at https://arxiv.org/abs/2405.18216, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."},"authors":[{"authorId":"2155450982","name":"Zezhou Yang"},{"authorId":"2296784064","name":"Cuiyun Gao"},{"authorId":"95292083","name":"Zhaoqiang Guo"},{"authorId":"2293350478","name":"Zhenhao Li"},{"authorId":"2303514300","name":"Kui Liu"},{"authorId":"2303567076","name":"Xin Xia"},{"authorId":"2303616543","name":"Yuming Zhou"}],"abstract":"Over the past decade, modern code review (MCR) has been deemed as a crucial practice of software quality assurance, which is applied to improve software quality and transfer development knowledge within a software team. Despite its importance, MCR is often a complicated and time-consuming activity for practitioners. In recent years, many studies that are dedicated to the comprehension and the improvement of MCR have been explored so that the MCR activity can be carried out more conveniently and efficiently. To provide researchers and practitioners a clear understanding of the current research status on MCR, this paper conducts a systematic literature review of the past years. Given the collected 231 surveyed papers, this paper makes the following five contributions: First, we analyze the research trends of related MCR studies. Second, we provide a taxonomy for the current MCR, encompassing both Improvement Techniques and Understanding Studies. Third, we present the concrete research progress of each novel MCR methodology and prototype tool. Fourth, we exploit the main empirical insights from empirical study and user study that are helpful to improve MCR. Finally, we sum up unsolved challenges and outline several possible research opportunities in the future."}