{"paperId":"37187ceb6008d49e1758bab0d4f86bf39aa175cf","externalIds":{"ArXiv":"2111.05193","DBLP":"journals/corr/abs-2111-05193","CorpusId":243861089},"title":"A Survey on Green Deep Learning","openAccessPdf":{"url":"","status":null,"license":null,"disclaimer":"Notice: Paper or abstract available at https://arxiv.org/abs/2111.05193, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."},"authors":[{"authorId":"47883405","name":"Jingjing Xu"},{"authorId":"150341221","name":"Wangchunshu Zhou"},{"authorId":"2068057294","name":"Zhiyi Fu"},{"authorId":null,"name":"Hao Zhou"},{"authorId":"2151530622","name":"Lei Li"}],"abstract":"In recent years, larger and deeper models are springing up and continuously pushing state-of-the-art (SOTA) results across various fields like natural language processing (NLP) and computer vision (CV). However, despite promising results, it needs to be noted that the computations required by SOTA models have been increased at an exponential rate. Massive computations not only have a surprisingly large carbon footprint but also have negative effects on research inclusiveness and deployment on real-world applications. Green deep learning is an increasingly hot research field that appeals to researchers to pay attention to energy usage and carbon emission during model training and inference. The target is to yield novel results with lightweight and efficient technologies. Many technologies can be used to achieve this goal, like model compression and knowledge distillation. This paper focuses on presenting a systematic review of the development of Green deep learning technologies. We classify these approaches into four categories: (1) compact networks, (2) energy-efficient training strategies, (3) energy-efficient inference approaches, and (4) efficient data usage. For each category, we discuss the progress that has been achieved and the unresolved challenges."}