{"paperId":"04daf8046d036a5d92c52c0fa890f763ee38662e","externalIds":{"ArXiv":"2408.12957","DBLP":"journals/corr/abs-2408-12957","DOI":"10.48550/arXiv.2408.12957","CorpusId":271947107},"title":"Image Segmentation in Foundation Model Era: A Survey","openAccessPdf":{"url":"","status":null,"license":null,"disclaimer":"Notice: Paper or abstract available at https://arxiv.org/abs/2408.12957, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."},"authors":[{"authorId":"2083603","name":"Tianfei Zhou"},{"authorId":"2316862081","name":"Fei Zhang"},{"authorId":"2316861929","name":"Boyu Chang"},{"authorId":"2285190370","name":"Wenguan Wang"},{"authorId":"2316894284","name":"Ye Yuan"},{"authorId":"1796918","name":"E. Konukoglu"},{"authorId":"2316861730","name":"Daniel Cremers"}],"abstract":"Image segmentation is a long-standing challenge in computer vision, studied continuously over several decades, as evidenced by seminal algorithms such as N-Cut, FCN, and MaskFormer. With the advent of foundation models (FMs), contemporary segmentation methodologies have embarked on a new epoch by either adapting FMs (e.g., CLIP, Stable Diffusion, DINO) for image segmentation or developing dedicated segmentation foundation models (e.g., SAM). These approaches not only deliver superior segmentation performance, but also herald newfound segmentation capabilities previously unseen in deep learning context. However, current research in image segmentation lacks a detailed analysis of distinct characteristics, challenges, and solutions associated with these advancements. This survey seeks to fill this gap by providing a thorough review of cutting-edge research centered around FM-driven image segmentation. We investigate two basic lines of research -- generic image segmentation (i.e., semantic segmentation, instance segmentation, panoptic segmentation), and promptable image segmentation (i.e., interactive segmentation, referring segmentation, few-shot segmentation) -- by delineating their respective task settings, background concepts, and key challenges. Furthermore, we provide insights into the emergence of segmentation knowledge from FMs like CLIP, Stable Diffusion, and DINO. An exhaustive overview of over 300 segmentation approaches is provided to encapsulate the breadth of current research efforts. Subsequently, we engage in a discussion of open issues and potential avenues for future research. We envisage that this fresh, comprehensive, and systematic survey catalyzes the evolution of advanced image segmentation systems. A public website is created to continuously track developments in this fast advancing field: \\url{https://github.com/stanley-313/ImageSegFM-Survey}."}