{"paperId":"a5f26555194d50955f6b3fdafb04d4330cb272dc","externalIds":{"DBLP":"journals/corr/abs-2406-11191","ArXiv":"2406.11191","DOI":"10.48550/arXiv.2406.11191","CorpusId":270560824},"title":"A Survey on Human Preference Learning for Large Language Models","openAccessPdf":{"url":"","status":null,"license":null,"disclaimer":"Notice: Paper or abstract available at https://arxiv.org/abs/2406.11191, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."},"authors":[{"authorId":"2307740913","name":"Ruili Jiang"},{"authorId":"2266796043","name":"Kehai Chen"},{"authorId":"2320289516","name":"Xuefeng Bai"},{"authorId":"2307044191","name":"Zhixuan He"},{"authorId":"2257093356","name":"Juntao Li"},{"authorId":"2105775","name":"Muyun Yang"},{"authorId":"2237773157","name":"Tiejun Zhao"},{"authorId":"2284688853","name":"Liqiang Nie"},{"authorId":"2273887691","name":"Min Zhang"}],"abstract":"The recent surge of versatile large language models (LLMs) largely depends on aligning increasingly capable foundation models with human intentions by preference learning, enhancing LLMs with excellent applicability and effectiveness in a wide range of contexts. Despite the numerous related studies conducted, a perspective on how human preferences are introduced into LLMs remains limited, which may prevent a deeper comprehension of the relationships between human preferences and LLMs as well as the realization of their limitations. In this survey, we review the progress in exploring human preference learning for LLMs from a preference-centered perspective, covering the sources and formats of preference feedback, the modeling and usage of preference signals, as well as the evaluation of the aligned LLMs. We first categorize the human feedback according to data sources and formats. We then summarize techniques for human preferences modeling and compare the advantages and disadvantages of different schools of models. Moreover, we present various preference usage methods sorted by the objectives to utilize human preference signals. Finally, we summarize some prevailing approaches to evaluate LLMs in terms of alignment with human intentions and discuss our outlooks on the human intention alignment for LLMs."}