{"paperId":"5b038c1a93967072cc76689fd805e756f804cc42","externalIds":{"DBLP":"journals/corr/abs-2310-10196","ArXiv":"2310.10196","DOI":"10.48550/arXiv.2310.10196","CorpusId":264146957},"title":"Large Models for Time Series and Spatio-Temporal Data: A Survey and Outlook","openAccessPdf":{"url":"","status":null,"license":null,"disclaimer":"Notice: Paper or abstract available at https://arxiv.org/abs/2310.10196, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."},"authors":[{"authorId":"2254096428","name":"Ming Jin"},{"authorId":"2253561592","name":"Qingsong Wen"},{"authorId":"2253824408","name":"Yuxuan Liang"},{"authorId":"2152737103","name":"Chaoli Zhang"},{"authorId":"2149919635","name":"Siqiao Xue"},{"authorId":"2137371790","name":"Xue Wang"},{"authorId":"2253786576","name":"James Y. Zhang"},{"authorId":"2259354682","name":"Yi Wang"},{"authorId":"2259822635","name":"Haifeng Chen"},{"authorId":"2284734617","name":"Xiaoli Li"},{"authorId":"2254047333","name":"Shirui Pan"},{"authorId":"2258722690","name":"Vincent S. Tseng"},{"authorId":"2149514422","name":"Yu Zheng"},{"authorId":"2367147383","name":"Lei Chen"},{"authorId":"2258712531","name":"Hui Xiong"}],"abstract":"Temporal data, notably time series and spatio-temporal data, are prevalent in real-world applications. They capture dynamic system measurements and are produced in vast quantities by both physical and virtual sensors. Analyzing these data types is vital to harnessing the rich information they encompass and thus benefits a wide range of downstream tasks. Recent advances in large language and other foundational models have spurred increased use of these models in time series and spatio-temporal data mining. Such methodologies not only enable enhanced pattern recognition and reasoning across diverse domains but also lay the groundwork for artificial general intelligence capable of comprehending and processing common temporal data. In this survey, we offer a comprehensive and up-to-date review of large models tailored (or adapted) for time series and spatio-temporal data, spanning four key facets: data types, model categories, model scopes, and application areas/tasks. Our objective is to equip practitioners with the knowledge to develop applications and further research in this underexplored domain. We primarily categorize the existing literature into two major clusters: large models for time series analysis (LM4TS) and spatio-temporal data mining (LM4STD). On this basis, we further classify research based on model scopes (i.e., general vs. domain-specific) and application areas/tasks. We also provide a comprehensive collection of pertinent resources, including datasets, model assets, and useful tools, categorized by mainstream applications. This survey coalesces the latest strides in large model-centric research on time series and spatio-temporal data, underscoring the solid foundations, current advances, practical applications, abundant resources, and future research opportunities."}