{"paperId":"eadb2e65ac7f360d58df2ea8737d358f1cc53ad7","externalIds":{"DBLP":"journals/corr/abs-2409-05033","ArXiv":"2409.05033","DOI":"10.48550/arXiv.2409.05033","CorpusId":272524935},"title":"A Survey on Diffusion Models for Recommender Systems","openAccessPdf":{"url":"","status":null,"license":null,"disclaimer":"Notice: Paper or abstract available at https://arxiv.org/abs/2409.05033, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."},"authors":[{"authorId":"2144908858","name":"Jianghao Lin"},{"authorId":"2320301577","name":"Jiaqi Liu"},{"authorId":"2296232413","name":"Jiachen Zhu"},{"authorId":"2056826850","name":"Yunjia Xi"},{"authorId":"2320346870","name":"Chengkai Liu"},{"authorId":"2320466185","name":"Yangtian Zhang"},{"authorId":"2237958078","name":"Yong Yu"},{"authorId":"2240768092","name":"Weinan Zhang"}],"abstract":"While traditional recommendation techniques have made significant strides in the past decades, they still suffer from limited generalization performance caused by factors like inadequate collaborative signals, weak latent representations, and noisy data. In response, diffusion models (DMs) have emerged as promising solutions for recommender systems due to their robust generative capabilities, solid theoretical foundations, and improved training stability. To this end, in this paper, we present the first comprehensive survey on diffusion models for recommendation, and draw a bird's-eye view from the perspective of the whole pipeline in real-world recommender systems. We systematically categorize existing research works into three primary domains: (1) diffusion for data engineering&encoding, focusing on data augmentation and representation enhancement; (2) diffusion as recommender models, employing diffusion models to directly estimate user preferences and rank items; and (3) diffusion for content presentation, utilizing diffusion models to generate personalized content such as fashion and advertisement creatives. Our taxonomy highlights the unique strengths of diffusion models in capturing complex data distributions and generating high-quality, diverse samples that closely align with user preferences. We also summarize the core characteristics of the adapting diffusion models for recommendation, and further identify key areas for future exploration, which helps establish a roadmap for researchers and practitioners seeking to advance recommender systems through the innovative application of diffusion models. To further facilitate the research community of recommender systems based on diffusion models, we actively maintain a GitHub repository for papers and other related resources in this rising direction https://github.com/CHIANGEL/Awesome-Diffusion-for-RecSys."}