{"paperId":"2d32872906f4d0899b231dc469a593e76d5065a6","externalIds":{"DBLP":"journals/corr/abs-2406-11213","ArXiv":"2406.11213","DOI":"10.48550/arXiv.2406.11213","CorpusId":270560315},"title":"A Survey of AIOps for Failure Management in the Era of Large Language Models","openAccessPdf":{"url":"","status":null,"license":null,"disclaimer":"Notice: Paper or abstract available at https://arxiv.org/abs/2406.11213, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."},"authors":[{"authorId":"2306121651","name":"Lingzhe Zhang"},{"authorId":"2056066951","name":"Tong Jia"},{"authorId":"2305360009","name":"Mengxi Jia"},{"authorId":"2156705217","name":"Yifan Wu"},{"authorId":"10017193","name":"Aiwei Liu"},{"authorId":"2146265248","name":"Yong Yang"},{"authorId":"2260608757","name":"Zhonghai Wu"},{"authorId":"2109906988","name":"Xuming Hu"},{"authorId":"2284755458","name":"Philip S. Yu"},{"authorId":"2243918738","name":"Ying Li"}],"abstract":"As software systems grow increasingly intricate, Artificial Intelligence for IT Operations (AIOps) methods have been widely used in software system failure management to ensure the high availability and reliability of large-scale distributed software systems. However, these methods still face several challenges, such as lack of cross-platform generality and cross-task flexibility. Fortunately, recent advancements in large language models (LLMs) can significantly address these challenges, and many approaches have already been proposed to explore this field. However, there is currently no comprehensive survey that discusses the differences between LLM-based AIOps and traditional AIOps methods. Therefore, this paper presents a comprehensive survey of AIOps technology for failure management in the LLM era. It includes a detailed definition of AIOps tasks for failure management, the data sources for AIOps, and the LLM-based approaches adopted for AIOps. Additionally, this survey explores the AIOps subtasks, the specific LLM-based approaches suitable for different AIOps subtasks, and the challenges and future directions of the domain, aiming to further its development and application."}