{"paperId":"0b89f2b0ca70274db139eedfdf4c77451d126451","externalIds":{"ArXiv":"2405.20431","DBLP":"journals/corr/abs-2405-20431","DOI":"10.48550/arXiv.2405.20431","CorpusId":270199741},"title":"Exploring the Practicality of Federated Learning: A Survey Towards the Communication Perspective","openAccessPdf":{"url":"","status":null,"license":null,"disclaimer":"Notice: Paper or abstract available at https://arxiv.org/abs/2405.20431, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."},"authors":[{"authorId":"2304326161","name":"Khiem Le"},{"authorId":"2304324830","name":"Nhan Luong-Ha"},{"authorId":"2149797644","name":"Manh Nguyen-Duc"},{"authorId":"2257190712","name":"Danh Le Phuoc"},{"authorId":"2293313828","name":"Cuong Do"},{"authorId":"2293717686","name":"Kok-Seng Wong"}],"abstract":"Federated Learning (FL) is a promising paradigm that offers significant advancements in privacy-preserving, decentralized machine learning by enabling collaborative training of models across distributed devices without centralizing data. However, the practical deployment of FL systems faces a significant bottleneck: the communication overhead caused by frequently exchanging large model updates between numerous devices and a central server. This communication inefficiency can hinder training speed, model performance, and the overall feasibility of real-world FL applications. In this survey, we investigate various strategies and advancements made in communication-efficient FL, highlighting their impact and potential to overcome the communication challenges inherent in FL systems. Specifically, we define measures for communication efficiency, analyze sources of communication inefficiency in FL systems, and provide a taxonomy and comprehensive review of state-of-the-art communication-efficient FL methods. Additionally, we discuss promising future research directions for enhancing the communication efficiency of FL systems. By addressing the communication bottleneck, FL can be effectively applied and enable scalable and practical deployment across diverse applications that require privacy-preserving, decentralized machine learning, such as IoT, healthcare, or finance."}