{"paperId":"71a256a44a1714a23d2781df1f83d59d7230f316","externalIds":{"DBLP":"journals/corr/abs-2407-03640","ArXiv":"2407.03640","DOI":"10.48550/arXiv.2407.03640","CorpusId":271039390},"title":"Generative Technology for Human Emotion Recognition: A Scope Review","openAccessPdf":{"url":"","status":null,"license":null,"disclaimer":"Notice: Paper or abstract available at https://arxiv.org/abs/2407.03640, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."},"authors":[{"authorId":"2310296490","name":"Fei Ma"},{"authorId":"2310293317","name":"Yucheng Yuan"},{"authorId":"2310283757","name":"Yifan Xie"},{"authorId":"2266981509","name":"Hongwei Ren"},{"authorId":"2278762338","name":"Ivan Liu"},{"authorId":"2310377314","name":"Y. He"},{"authorId":"2310230036","name":"Fuji Ren"},{"authorId":"2243980571","name":"F. Yu"},{"authorId":"2280145651","name":"Shiguang Ni"}],"abstract":"Affective computing stands at the forefront of artificial intelligence (AI), seeking to imbue machines with the ability to comprehend and respond to human emotions. Central to this field is emotion recognition, which endeavors to identify and interpret human emotional states from different modalities, such as speech, facial images, text, and physiological signals. In recent years, important progress has been made in generative models, including Autoencoder, Generative Adversarial Network, Diffusion Model, and Large Language Model. These models, with their powerful data generation capabilities, emerge as pivotal tools in advancing emotion recognition. However, up to now, there remains a paucity of systematic efforts that review generative technology for emotion recognition. This survey aims to bridge the gaps in the existing literature by conducting a comprehensive analysis of over 320 research papers until June 2024. Specifically, this survey will firstly introduce the mathematical principles of different generative models and the commonly used datasets. Subsequently, through a taxonomy, it will provide an in-depth analysis of how generative techniques address emotion recognition based on different modalities in several aspects, including data augmentation, feature extraction, semi-supervised learning, cross-domain, etc. Finally, the review will outline future research directions, emphasizing the potential of generative models to advance the field of emotion recognition and enhance the emotional intelligence of AI systems."}