{"paperId":"fc4c380102d6f72657d1ab54dffd6be536bb01c7","externalIds":{"ArXiv":"2402.00253","DBLP":"journals/corr/abs-2402-00253","DOI":"10.48550/arXiv.2402.00253","CorpusId":267365472},"title":"A Survey on Hallucination in Large Vision-Language Models","openAccessPdf":{"url":"","status":null,"license":null,"disclaimer":"Notice: Paper or abstract available at https://arxiv.org/abs/2402.00253, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."},"authors":[{"authorId":"2255499484","name":"Hanchao Liu"},{"authorId":"2255510249","name":"Wenyuan Xue"},{"authorId":"2268434822","name":"Yifei Chen"},{"authorId":"2255489894","name":"Dapeng Chen"},{"authorId":"2273531473","name":"Xiutian Zhao"},{"authorId":"2273574212","name":"Ke Wang"},{"authorId":"2282251912","name":"Liping Hou"},{"authorId":"2162611076","name":"Rong-Zhi Li"},{"authorId":"2273549661","name":"Wei Peng"}],"abstract":"Recent development of Large Vision-Language Models (LVLMs) has attracted growing attention within the AI landscape for its practical implementation potential. However, ``hallucination'', or more specifically, the misalignment between factual visual content and corresponding textual generation, poses a significant challenge of utilizing LVLMs. In this comprehensive survey, we dissect LVLM-related hallucinations in an attempt to establish an overview and facilitate future mitigation. Our scrutiny starts with a clarification of the concept of hallucinations in LVLMs, presenting a variety of hallucination symptoms and highlighting the unique challenges inherent in LVLM hallucinations. Subsequently, we outline the benchmarks and methodologies tailored specifically for evaluating hallucinations unique to LVLMs. Additionally, we delve into an investigation of the root causes of these hallucinations, encompassing insights from the training data and model components. We also critically review existing methods for mitigating hallucinations. The open questions and future directions pertaining to hallucinations within LVLMs are discussed to conclude this survey."}