{"paperId":"37bcad09a018c66e63f14b5b105e5ad34b441644","externalIds":{"DBLP":"journals/corr/abs-2405-08011","ArXiv":"2405.08011","DOI":"10.1145/3637528.3671460","CorpusId":269761536},"title":"A Survey of Large Language Models for Graphs","openAccessPdf":{"url":"https://arxiv.org/pdf/2405.08011","status":"GREEN","license":null,"disclaimer":"Notice: Paper or abstract available at https://arxiv.org/abs/2405.08011, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."},"authors":[{"authorId":"2163180478","name":"Xubin Ren"},{"authorId":"2261087798","name":"Jiabin Tang"},{"authorId":"2297846971","name":"Dawei Yin"},{"authorId":"2292582566","name":"Nitesh V. Chawla"},{"authorId":"2261248317","name":"Chao Huang"}],"abstract":"Graphs are an essential data structure utilized to represent relationships in real-world scenarios. Prior research has established that Graph Neural Networks (GNNs) deliver impressive outcomes in graph-centric tasks, such as link prediction and node classification. Despite these advancements, challenges like data sparsity and limited generalization capabilities continue to persist. Recently, Large Language Models (LLMs) have gained attention in natural language processing. They excel in language comprehension and summarization. Integrating LLMs with graph learning techniques has attracted interest as a way to enhance performance in graph learning tasks. In this survey, we conduct an in-depth review of the latest state-of-the-art LLMs applied in graph learning and introduce a novel taxonomy to categorize existing methods based on their framework design. We detail four unique designs: i) GNNs as Prefix, ii) LLMs as Prefix, iii) LLMs-Graphs Integration, and iv) LLMs-Only, highlighting key methodologies within each category. We explore the strengths and limitations of each framework, and emphasize potential avenues for future research, including overcoming current integration challenges between LLMs and graph learning techniques, and venturing into new application areas. This survey aims to serve as a valuable resource for researchers and practitioners eager to leverage large language models in graph learning, and to inspire continued progress in this dynamic field. We consistently maintain the related open-source materials at https://github.com/HKUDS/Awesome-LLM4Graph-Papers."}