{"paperId":"7f575e1a8e4c465b31f8928ffd13ad48aa961789","externalIds":{"DBLP":"journals/corr/abs-2404-18231","ArXiv":"2404.18231","DOI":"10.48550/arXiv.2404.18231","CorpusId":269448713},"title":"From Persona to Personalization: A Survey on Role-Playing Language Agents","openAccessPdf":{"url":"","status":null,"license":null,"disclaimer":"Notice: Paper or abstract available at https://arxiv.org/abs/2404.18231, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."},"authors":[{"authorId":"5040052","name":"Jiangjie Chen"},{"authorId":"2108003209","name":"Xintao Wang"},{"authorId":"2284900134","name":"Rui Xu"},{"authorId":"2145968425","name":"Siyu Yuan"},{"authorId":"2217263361","name":"Yikai Zhang"},{"authorId":"2296459678","name":"Wei Shi"},{"authorId":"2153624353","name":"Jian Xie"},{"authorId":"2236184114","name":"Shuang Li"},{"authorId":"2287835207","name":"Ruihan Yang"},{"authorId":"2222400339","name":"Tinghui Zhu"},{"authorId":"2298944454","name":"Aili Chen"},{"authorId":"2296503181","name":"Nianqi Li"},{"authorId":"2243032026","name":"Lida Chen"},{"authorId":"2283314846","name":"Caiyu Hu"},{"authorId":"2294932267","name":"Siye Wu"},{"authorId":"2298949049","name":"Scott Ren"},{"authorId":"2165331745","name":"Ziquan Fu"},{"authorId":"2282543969","name":"Yanghua Xiao"}],"abstract":"Recent advancements in large language models (LLMs) have significantly boosted the rise of Role-Playing Language Agents (RPLAs), i.e., specialized AI systems designed to simulate assigned personas. By harnessing multiple advanced abilities of LLMs, including in-context learning, instruction following, and social intelligence, RPLAs achieve a remarkable sense of human likeness and vivid role-playing performance. RPLAs can mimic a wide range of personas, ranging from historical figures and fictional characters to real-life individuals. Consequently, they have catalyzed numerous AI applications, such as emotional companions, interactive video games, personalized assistants and copilots, and digital clones. In this paper, we conduct a comprehensive survey of this field, illustrating the evolution and recent progress in RPLAs integrating with cutting-edge LLM technologies. We categorize personas into three types: 1) Demographic Persona, which leverages statistical stereotypes; 2) Character Persona, focused on well-established figures; and 3) Individualized Persona, customized through ongoing user interactions for personalized services. We begin by presenting a comprehensive overview of current methodologies for RPLAs, followed by the details for each persona type, covering corresponding data sourcing, agent construction, and evaluation. Afterward, we discuss the fundamental risks, existing limitations, and future prospects of RPLAs. Additionally, we provide a brief review of RPLAs in AI applications, which reflects practical user demands that shape and drive RPLA research. Through this work, we aim to establish a clear taxonomy of RPLA research and applications, and facilitate future research in this critical and ever-evolving field, and pave the way for a future where humans and RPLAs coexist in harmony."}