{"paperId":"6dd3ebcdee05ef3ced51d1e7e9b90156e8559210","externalIds":{"ArXiv":"2302.09457","CorpusId":257038649},"title":"Attacks in Adversarial Machine Learning: A Systematic Survey from the Life-cycle Perspective","openAccessPdf":{"url":"","status":null,"license":null,"disclaimer":"Notice: Paper or abstract available at https://arxiv.org/abs/2302.09457, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."},"authors":[{"authorId":"143905981","name":"Baoyuan Wu"},{"authorId":"2209039407","name":"Li Liu"},{"authorId":"49659134","name":"Zihao Zhu"},{"authorId":"2267879078","name":"Qingshan Liu"},{"authorId":"2510474","name":"Zhaofeng He"},{"authorId":"1491799130","name":"Siwei Lyu"}],"abstract":"Adversarial machine learning (AML) studies the adversarial phenomenon of machine learning, which may make inconsistent or unexpected predictions with humans. Some paradigms have been recently developed to explore this adversarial phenomenon occurring at different stages of a machine learning system, such as backdoor attack occurring at the pre-training, in-training and inference stage; weight attack occurring at the post-training, deployment and inference stage; adversarial attack occurring at the inference stage. However, although these adversarial paradigms share a common goal, their developments are almost independent, and there is still no big picture of AML. In this work, we aim to provide a unified perspective to the AML community to systematically review the overall progress of this field. We firstly provide a general definition about AML, and then propose a unified mathematical framework to covering existing attack paradigms. According to the proposed unified framework, we build a full taxonomy to systematically categorize and review existing representative methods for each paradigm. Besides, using this unified framework, it is easy to figure out the connections and differences among different attack paradigms, which may inspire future researchers to develop more advanced attack paradigms. Finally, to facilitate the viewing of the built taxonomy and the related literature in adversarial machine learning, we further provide a website, \\ie, \\url{http://adversarial-ml.com}, where the taxonomies and literature will be continuously updated."}