{"paperId":"b10fbd5033aa9e8fe87ca11810739f9eb2def24b","externalIds":{"ArXiv":"2408.01934","DBLP":"journals/tnn/NguyenZLWZTZ25","DOI":"10.1109/TNNLS.2025.3561225","CorpusId":271709724,"PubMed":"40327472"},"title":"A Survey and Evaluation of Adversarial Attacks in Object Detection","openAccessPdf":{"url":"http://arxiv.org/pdf/2408.01934","status":"GREEN","license":null,"disclaimer":"Notice: Paper or abstract available at https://arxiv.org/abs/2408.01934, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."},"authors":[{"authorId":"2314888067","name":"Khoi Nguyen Tiet Nguyen"},{"authorId":"2314887362","name":"Wenyu Zhang"},{"authorId":"2315220114","name":"Kangkang Lu"},{"authorId":"2314878984","name":"Yuhuan Wu"},{"authorId":"2314885416","name":"Xingjian Zheng"},{"authorId":"2359421650","name":"Hui Li Tan"},{"authorId":"2314815311","name":"Liangli Zhen"}],"abstract":"Deep learning models achieve remarkable accuracy in computer vision tasks yet remain vulnerable to adversarial examples—carefully crafted perturbations to input images that can deceive these models into making confident but incorrect predictions. This vulnerability poses significant risks in high-stakes applications such as autonomous vehicles, security surveillance, and safety-critical inspection systems. While the existing literature extensively covers adversarial attacks in image classification, comprehensive analyses of such attacks on object detection systems remain limited. This article presents a novel taxonomic framework for categorizing adversarial attacks specific to object detection architectures, synthesizes existing robustness metrics, and provides a comprehensive empirical evaluation of state-of-the-art attack methodologies on popular object detection models, including both traditional detectors and modern detectors with vision-language pretraining. Through rigorous analysis of open-source attack implementations and their effectiveness across diverse detection architectures, we derive key insights into attack characteristics. Furthermore, we delineate critical research gaps and emerging challenges to guide future investigations in securing object detection systems against adversarial threats. Our findings establish a foundation for developing more robust detection models while highlighting the urgent need for standardized evaluation protocols in this rapidly evolving domain."}