{"paperId":"e451cd1f8645589f71848eb97948052e07047748","externalIds":{"ArXiv":"2212.05767","DBLP":"journals/pami/LiangMLLTWZLSH24","DOI":"10.1109/TPAMI.2024.3417451","CorpusId":257220329,"PubMed":"38941209"},"title":"A Survey of Knowledge Graph Reasoning on Graph Types: Static, Dynamic, and Multi-Modal","openAccessPdf":{"url":"","status":null,"license":null,"disclaimer":"Notice: Paper or abstract available at https://arxiv.org/abs/2212.05767, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."},"authors":[{"authorId":"2024445866","name":"K. Liang"},{"authorId":"13325191","name":"Lingyuan Meng"},{"authorId":"2152969291","name":"Meng Liu"},{"authorId":"2119034129","name":"Yue Liu"},{"authorId":"1381761887","name":"Wenxuan Tu"},{"authorId":"103307910","name":"Siwei Wang"},{"authorId":"2516087","name":"Sihang Zhou"},{"authorId":"2130021053","name":"Xinwang Liu"},{"authorId":"2119233425","name":"Fu Sun"}],"abstract":"Knowledge graph reasoning (KGR), aiming to deduce new facts from existing facts based on mined logic rules underlying knowledge graphs (KGs), has become a fast-growing research direction. It has been proven to significantly benefit the usage of KGs in many AI applications, such as question answering, recommendation systems, and etc. According to the graph types, existing KGR models can be roughly divided into three categories, i.e., static models, temporal models, and multi-modal models. Early works in this domain mainly focus on static KGR, and recent works try to leverage the temporal and multi-modal information, which are more practical and closer to real-world. However, no survey papers and open-source repositories comprehensively summarize and discuss models in this important direction. To fill the gap, we conduct a first survey for knowledge graph reasoning tracing from static to temporal and then to multi-modal KGs. Concretely, the models are reviewed based on bi-level taxonomy, i.e., top-level (graph types) and base-level (techniques and scenarios). Besides, the performances, as well as datasets, are summarized and presented. Moreover, we point out the challenges and potential opportunities to enlighten the readers."}