{"paperId":"cea911f3a903a03b6333f2211cbde1c4b9ff82e8","externalIds":{"DBLP":"journals/csur/BilotMAZ24","ArXiv":"2303.16004","DOI":"10.1145/3664649","CorpusId":257771694},"title":"A Survey on Malware Detection with Graph Representation Learning","openAccessPdf":{"url":"https://dl.acm.org/doi/pdf/10.1145/3664649","status":"BRONZE","license":null,"disclaimer":"Notice: Paper or abstract available at https://arxiv.org/abs/2303.16004, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."},"authors":[{"authorId":"2176440737","name":"Tristan Bilot"},{"authorId":"38716867","name":"Nour El Madhoun"},{"authorId":"2120323138","name":"Khaldoun Al Agha"},{"authorId":"2727096","name":"Anis Zouaoui"}],"abstract":"Malware detection has become a major concern due to the increasing number and complexity of malware. Traditional detection methods based on signatures and heuristics are used for malware detection, but unfortunately, they suffer from poor generalization to unknown attacks and can be easily circumvented using obfuscation techniques. In recent years, Machine Learning (ML) and notably Deep Learning (DL) achieved impressive results in malware detection by learning useful representations from data and have become a solution preferred over traditional methods. Recently, the application of Graph Representation Learning (GRL) techniques on graph-structured data has demonstrated impressive capabilities in malware detection. This success benefits notably from the robust structure of graphs, which are challenging for attackers to alter, and their intrinsic explainability capabilities. In this survey, we provide an in-depth literature review to summarize and unify existing works under the common approaches and architectures. We notably demonstrate that Graph Neural Networks (GNNs) reach competitive results in learning robust embeddings from malware represented as expressive graph structures such as Function Call Graphs (FCGs) and Control Flow Graphs (CFGs). This study also discusses the robustness of GRL-based methods to adversarial attacks, contrasts their effectiveness with other ML/DL approaches, and outlines future research for practical deployment."}