{"paperId":"8ff6afb036dbf6f587c90e0d0603f0fc5bfaa555","externalIds":{"DBLP":"journals/corr/abs-2309-07581","ArXiv":"2309.07581","DOI":"10.48550/arXiv.2309.07581","CorpusId":261822270},"title":"A Survey of Graph Pre-processing Methods: From Algorithmic to Hardware Perspectives","openAccessPdf":{"url":"https://arxiv.org/pdf/2309.07581","status":"CLOSED","license":null,"disclaimer":"Notice: Paper or abstract available at https://arxiv.org/abs/2309.07581, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."},"authors":[{"authorId":"2240528014","name":"Zhengyang Lv"},{"authorId":"152206233","name":"Mingyu Yan"},{"authorId":"2240528813","name":"Xin Liu"},{"authorId":"2240532924","name":"Mengyao Dong"},{"authorId":"144530359","name":"Xiaochun Ye"},{"authorId":"3276641","name":"Dongrui Fan"},{"authorId":"2240525963","name":"Ninghui Sun"}],"abstract":"Graph-related applications have experienced significant growth in academia and industry, driven by the powerful representation capabilities of graph. However, efficiently executing these applications faces various challenges, such as load imbalance, random memory access, etc. To address these challenges, researchers have proposed various acceleration systems, including software frameworks and hardware accelerators, all of which incorporate graph pre-processing (GPP). GPP serves as a preparatory step before the formal execution of applications, involving techniques such as sampling, reorder, etc. However, GPP execution often remains overlooked, as the primary focus is directed towards enhancing graph applications themselves. This oversight is concerning, especially considering the explosive growth of real-world graph data, where GPP becomes essential and even dominates system running overhead. Furthermore, GPP methods exhibit significant variations across devices and applications due to high customization. Unfortunately, no comprehensive work systematically summarizes GPP. To address this gap and foster a better understanding of GPP, we present a comprehensive survey dedicated to this area. We propose a double-level taxonomy of GPP, considering both algorithmic and hardware perspectives. Through listing relavent works, we illustrate our taxonomy and conduct a thorough analysis and summary of diverse GPP techniques. Lastly, we discuss challenges in GPP and potential future directions."}