{"paperId":"eda89b2a217f9f62ce8f06ab30ccf68ab4419de0","externalIds":{"DBLP":"journals/corr/abs-2405-10936","ArXiv":"2405.10936","DOI":"10.48550/arXiv.2405.10936","CorpusId":269899980},"title":"A Survey on Large Language Models with Multilingualism: Recent Advances and New Frontiers","openAccessPdf":{"url":"","status":null,"license":null,"disclaimer":"Notice: Paper or abstract available at https://arxiv.org/abs/2405.10936, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."},"authors":[{"authorId":"2281961173","name":"Kaiyu Huang"},{"authorId":"2007643794","name":"Fengran Mo"},{"authorId":"2273825239","name":"Hongliang Li"},{"authorId":"2292026092","name":"You Li"},{"authorId":"2186280840","name":"Yuan Zhang"},{"authorId":"2302158148","name":"Weijian Yi"},{"authorId":"2302701835","name":"Yulong Mao"},{"authorId":"2302277873","name":"Jinchen Liu"},{"authorId":"2239055610","name":"Yuzhuang Xu"},{"authorId":"2273905521","name":"Jinan Xu"},{"authorId":"2261086903","name":"Jian-Yun Nie"},{"authorId":"2302298921","name":"Yang Liu"}],"abstract":"The rapid development of Large Language Models (LLMs) demonstrates remarkable multilingual capabilities in natural language processing, attracting global attention in both academia and industry. To mitigate potential discrimination and enhance the overall usability and accessibility for diverse language user groups, it is important for the development of language-fair technology. Despite the breakthroughs of LLMs, the investigation into the multilingual scenario remains insufficient, where a comprehensive survey to summarize recent approaches, developments, limitations, and potential solutions is desirable. To this end, we provide a survey with multiple perspectives on the utilization of LLMs in the multilingual scenario. We first rethink the transitions between previous and current research on pre-trained language models. Then we introduce several perspectives on the multilingualism of LLMs, including training and inference methods, information retrieval, model security, multi-domain with language culture, and usage of datasets. We also discuss the major challenges that arise in these aspects, along with possible solutions. Besides, we highlight future research directions that aim at further enhancing LLMs with multilingualism. The survey aims to help the research community address multilingual problems and provide a comprehensive understanding of the core concepts, key techniques, and latest developments in multilingual natural language processing based on LLMs."}