{"paperId":"9fde7a5d491e25d2ff040e2f2f2517fa5b753e85","externalIds":{"ArXiv":"2308.13821","DBLP":"journals/tkde/LiuLCWHH25","DOI":"10.1109/TKDE.2025.3549299","CorpusId":261245374},"title":"A Survey of Imbalanced Learning on Graphs: Problems, Techniques, and Future Directions","openAccessPdf":{"url":"","status":null,"license":null,"disclaimer":"Notice: Paper or abstract available at https://arxiv.org/abs/2308.13821, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."},"authors":[{"authorId":"2163529904","name":"Zemin Liu"},{"authorId":"1527090156","name":"Yuan N. Li"},{"authorId":"150244356","name":"Nan-Fang Chen"},{"authorId":"2155616330","name":"Qian Wang"},{"authorId":"2313619173","name":"Bryan Hooi"},{"authorId":"143603418","name":"Bin He"}],"abstract":"Graphs represent interconnected structures prevalent in a myriad of real-world scenarios. Effective graph analytics, such as graph learning methods, enables users to gain profound insights from graph data, underpinning various tasks including node classification and link prediction. However, these methods often suffer from data imbalance, a common issue in graph data where certain segments possess abundant data while others are scarce, thereby leading to biased learning outcomes. This necessitates the emerging field of imbalanced learning on graphs, which aims to correct these data distribution skews for more accurate and representative learning outcomes. In this survey, we embark on a comprehensive review of the literature on imbalanced learning on graphs. We begin by providing a definitive understanding of the concept and related terminologies, establishing a strong foundational understanding for readers. Following this, we propose two comprehensive taxonomies: (1) the problem taxonomy, which describes the forms of imbalance we consider, the associated tasks, and potential solutions and (2) the technique taxonomy, which details key strategies for addressing these imbalances, and aids readers in their method selection process. Finally, we suggest prospective future directions for both problems and techniques within the sphere of imbalanced learning on graphs, fostering further innovation in this critical area."}