{"paperId":"3686311263da911309233e93a271f44f2a1f1c3a","externalIds":{"ArXiv":"2312.07913","DBLP":"journals/corr/abs-2312-07913","DOI":"10.1145/3691626","CorpusId":266191530},"title":"A Survey of Text Watermarking in the Era of Large Language Models","openAccessPdf":{"url":"","status":null,"license":null,"disclaimer":"Notice: Paper or abstract available at https://arxiv.org/abs/2312.07913, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."},"authors":[{"authorId":"10017193","name":"Aiwei Liu"},{"authorId":"2226138943","name":"Leyi Pan"},{"authorId":"2156141216","name":"Yijian Lu"},{"authorId":"2274072714","name":"Jingjing Li"},{"authorId":"2109906988","name":"Xuming Hu"},{"authorId":"2114092431","name":"Lijie Wen"},{"authorId":"2273926416","name":"Irwin King"},{"authorId":"2191036692","name":"Philip S. Yu"}],"abstract":"Text watermarking algorithms are crucial for protecting the copyright of textual content. Historically, their capabilities and application scenarios were limited. However, recent advancements in large language models (LLMs) have revolutionized these techniques. LLMs not only enhance text watermarking algorithms with their advanced abilities but also create a need for employing these algorithms to protect their own copyrights or prevent potential misuse. This work conducts a comprehensive survey of the current state of text watermarking technology, covering four main aspects: (1) an overview and comparison of different text watermarking techniques; (2) evaluation methods for text watermarking algorithms, including their detectability, impact on text or LLM quality, and robustness under target or untargeted attacks; (3) potential application scenarios for text watermarking technology; and (4) current challenges and future directions for text watermarking. This survey aims to provide researchers with a thorough understanding of text watermarking technology in the era of LLMs, thereby promoting its further advancement."}