{"paperId":"e342165a614588878ad0f4bc9bacf3905df34d08","externalIds":{"DBLP":"journals/corr/abs-2209-00796","ArXiv":"2209.00796","DOI":"10.1145/3626235","CorpusId":252070859},"title":"Diffusion Models: A Comprehensive Survey of Methods and Applications","openAccessPdf":{"url":"https://arxiv.org/pdf/2209.00796","status":"GREEN","license":null,"disclaimer":"Notice: Paper or abstract available at https://arxiv.org/abs/2209.00796, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."},"authors":[{"authorId":"2155557947","name":"Ling Yang"},{"authorId":"2157128480","name":"Zhilong Zhang"},{"authorId":"2145267154","name":"Shenda Hong"},{"authorId":"47462785","name":"Runsheng Xu"},{"authorId":"145454815","name":"Yue Zhao"},{"authorId":"2237813","name":"Yingxia Shao"},{"authorId":"2108232780","name":"Wentao Zhang"},{"authorId":"1715634","name":"Ming-Hsuan Yang"},{"authorId":"2143385807","name":"Bin Cui"}],"abstract":"Diffusion models have emerged as a powerful new family of deep generative models with record-breaking performance in many applications, including image synthesis, video generation, and molecule design. In this survey, we provide an overview of the rapidly expanding body of work on diffusion models, categorizing the research into three key areas: efficient sampling, improved likelihood estimation, and handling data with special structures. We also discuss the potential for combining diffusion models with other generative models for enhanced results. We further review the wide-ranging applications of diffusion models in fields spanning from computer vision, natural language processing, temporal data modeling, to interdisciplinary applications in other scientific disciplines. This survey aims to provide a contextualized, in-depth look at the state of diffusion models, identifying the key areas of focus and pointing to potential areas for further exploration. Github: https://github.com/YangLing0818/Diffusion-Models-Papers-Survey-Taxonomy"}