{"paperId":"8d5c221a37d1fd5d03e8dba920a096f7dcc9e657","externalIds":{"DBLP":"journals/eaai/TsirmpasGPM24","ArXiv":"2305.16259","DOI":"10.1016/j.engappai.2024.108231","CorpusId":268410855},"title":"Neural natural language processing for long texts: A survey on classification and summarization","openAccessPdf":{"url":"http://arxiv.org/pdf/2305.16259","status":"GREEN","license":null,"disclaimer":"Notice: Paper or abstract available at https://arxiv.org/abs/2305.16259, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."},"authors":[{"authorId":"13215462","name":"Dimitrios Tsirmpas"},{"authorId":"2291299254","name":"Ioannis Gkionis"},{"authorId":"2254267384","name":"Georgios Th. Papadopoulos"},{"authorId":"2254269162","name":"Ioannis Mademlis"}],"abstract":"The adoption of Deep Neural Networks (DNNs) has greatly benefited Natural Language Processing (NLP) during the past decade. However, the demands of long document analysis are quite different from those of shorter texts, while the ever increasing size of documents uploaded online renders automated understanding of lengthy texts a critical issue. Relevant applications include automated Web mining, legal document review, medical records analysis, financial reports analysis, contract management, environmental impact assessment, news aggregation, etc. Despite the relatively recent development of efficient algorithms for analyzing long documents, practical tools in this field are currently flourishing. This article serves as an entry point into this dynamic domain and aims to achieve two objectives. First of all, it provides an introductory overview of the relevant neural building blocks, serving as a concise tutorial for the field. Secondly, it offers a brief examination of the current state-of-the-art in two key long document analysis tasks: document classification and document summarization. Sentiment analysis for long texts is also covered, since it is typically treated as a particular case of document classification. Consequently, this article presents an introductory exploration of document-level analysis, addressing the primary challenges, concerns, and existing solutions. Finally, it offers a concise definition of\"long text/document\", presents an original overarching taxonomy of common deep neural methods for long document analysis and lists publicly available annotated datasets that can facilitate further research in this area."}