{"paperId":"4e649c81d687aea1a27ee1de68e335c54f156fca","externalIds":{"DBLP":"journals/corr/abs-2312-10163","ArXiv":"2312.10163","DOI":"10.48550/arXiv.2312.10163","CorpusId":266348553},"title":"Towards the Unification of Generative and Discriminative Visual Foundation Model: A Survey","openAccessPdf":{"url":"","status":null,"license":null,"disclaimer":"Notice: Paper or abstract available at https://arxiv.org/abs/2312.10163, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."},"authors":[{"authorId":"2275309980","name":"Xu Liu"},{"authorId":"2275752933","name":"Tong Zhou"},{"authorId":"2275803971","name":"Yuanxin Wang"},{"authorId":"2275110804","name":"Yuping Wang"},{"authorId":"2275057139","name":"Qinjingwen Cao"},{"authorId":"2275066830","name":"Weizhi Du"},{"authorId":"2275056227","name":"Yonghuan Yang"},{"authorId":"2275304138","name":"Junjun He"},{"authorId":"2261364205","name":"Yu Qiao"},{"authorId":"2254873097","name":"Yiqing Shen"}],"abstract":"The advent of foundation models, which are pre-trained on vast datasets, has ushered in a new era of computer vision, characterized by their robustness and remarkable zero-shot generalization capabilities. Mirroring the transformative impact of foundation models like large language models (LLMs) in natural language processing, visual foundation models (VFMs) have become a catalyst for groundbreaking developments in computer vision. This review paper delineates the pivotal trajectories of VFMs, emphasizing their scalability and proficiency in generative tasks such as text-to-image synthesis, as well as their adeptness in discriminative tasks including image segmentation. While generative and discriminative models have historically charted distinct paths, we undertake a comprehensive examination of the recent strides made by VFMs in both domains, elucidating their origins, seminal breakthroughs, and pivotal methodologies. Additionally, we collate and discuss the extensive resources that facilitate the development of VFMs and address the challenges that pave the way for future research endeavors. A crucial direction for forthcoming innovation is the amalgamation of generative and discriminative paradigms. The nascent application of generative models within discriminative contexts signifies the early stages of this confluence. This survey aspires to be a contemporary compendium for scholars and practitioners alike, charting the course of VFMs and illuminating their multifaceted landscape."}