{"paperId":"9442b054b6f1742da77e002a6238988ae1e640b4","externalIds":{"DBLP":"journals/corr/abs-2402-00904","ArXiv":"2402.00904","DOI":"10.1007/s11390-024-4465-x","CorpusId":267406498},"title":"Domain Adaptation for Graph Representation Learning: Challenges, Progress, and Prospects","openAccessPdf":{"url":"","status":null,"license":null,"disclaimer":"Notice: Paper or abstract available at https://arxiv.org/abs/2402.00904, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."},"authors":[{"authorId":"2150193711","name":"Boshen Shi"},{"authorId":"2108220517","name":"Yongqing Wang"},{"authorId":"2258800452","name":"Fangda Guo"},{"authorId":"2113743048","name":"Bingbing Xu"},{"authorId":"2256603895","name":"Huawei Shen"},{"authorId":"2110251463","name":"Xueqi Cheng"}],"abstract":"Graph representation learning often faces knowledge scarcity in real-world applications, including limited labels and sparse relationships. Although a range of methods have been proposed to address these problems, such as graph few-shot learning, they mainly rely on inadequate knowledge within the task graph, which would limit their effectiveness. Moreover, they fail to consider other potentially useful task-related graphs. To overcome these limitations, domain adaptation for graph representation learning has emerged as an effective paradigm for transferring knowledge across graphs. It is also recognized as graph domain adaptation (GDA). In particular, to enhance model performance on target graphs with specific tasks, GDA introduces a bunch of task-related graphs as source graphs and adapts the knowledge learnt from source graphs to the target graphs. Since GDA combines the advantages of graph representation learning and domain adaptation, it has become a promising direction of transfer learning on graphs and has attracted an increasing amount of research interest in recent years. In this paper, we comprehensively overview the studies of GDA and present a detailed survey of recent advances. Specifically, we outline the current research status, analyze key challenges, propose a taxonomy, introduce representative work and practical applications, and discuss future prospects. To the best of our knowledge, this paper is the first survey for graph domain adaptation."}