{"paperId":"e190d46194f8ec2e5f08b96841976522f7889c4c","externalIds":{"ArXiv":"2404.18947","DBLP":"journals/corr/abs-2404-18947","DOI":"10.48550/arXiv.2404.18947","CorpusId":269457475},"title":"Multimodal Fusion on Low-quality Data: A Comprehensive Survey","openAccessPdf":{"url":"","status":null,"license":null,"disclaimer":"Notice: Paper or abstract available at https://arxiv.org/abs/2404.18947, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."},"authors":[{"authorId":"2326064027","name":"Qingyang Zhang"},{"authorId":"1490932569","name":"Yake Wei"},{"authorId":"1396788118","name":"Zongbo Han"},{"authorId":"2258526402","name":"Huazhu Fu"},{"authorId":"2300358390","name":"Xi Peng"},{"authorId":"2299558991","name":"Cheng Deng"},{"authorId":"2284182608","name":"Qinghua Hu"},{"authorId":"2299108652","name":"Cai Xu"},{"authorId":"2299503883","name":"Jie Wen"},{"authorId":"2239170810","name":"Di Hu"},{"authorId":"2175129664","name":"Changqing Zhang"}],"abstract":"Multimodal fusion focuses on integrating information from multiple modalities with the goal of more accurate prediction, which has achieved remarkable progress in a wide range of scenarios, including autonomous driving and medical diagnosis. However, the reliability of multimodal fusion remains largely unexplored especially under low-quality data settings. This paper surveys the common challenges and recent advances of multimodal fusion in the wild and presents them in a comprehensive taxonomy. From a data-centric view, we identify four main challenges that are faced by multimodal fusion on low-quality data, namely (1) noisy multimodal data that are contaminated with heterogeneous noises, (2) incomplete multimodal data that some modalities are missing, (3) imbalanced multimodal data that the qualities or properties of different modalities are significantly different and (4) quality-varying multimodal data that the quality of each modality dynamically changes with respect to different samples. This new taxonomy will enable researchers to understand the state of the field and identify several potential directions. We also provide discussion for the open problems in this field together with interesting future research directions."}