{"paperId":"679f709e2736b0970429a2972f0aea48664bdbc3","externalIds":{"DBLP":"journals/corr/abs-2403-04782","ArXiv":"2403.04782","DOI":"10.48550/arXiv.2403.04782","CorpusId":268296889},"title":"A Survey on Temporal Knowledge Graph: Representation Learning and Applications","openAccessPdf":{"url":"","status":null,"license":null,"disclaimer":"Notice: Paper or abstract available at https://arxiv.org/abs/2403.04782, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."},"authors":[{"authorId":"2190715271","name":"Lianshang Cai"},{"authorId":"49723181","name":"Xin Mao"},{"authorId":"2290061701","name":"Yuhao Zhou"},{"authorId":"2278432039","name":"Zhaoguang Long"},{"authorId":"2290246460","name":"Changxu Wu"},{"authorId":"2278431786","name":"Man Lan"}],"abstract":"Knowledge graphs have garnered significant research attention and are widely used to enhance downstream applications. However, most current studies mainly focus on static knowledge graphs, whose facts do not change with time, and disregard their dynamic evolution over time. As a result, temporal knowledge graphs have attracted more attention because a large amount of structured knowledge exists only within a specific period. Knowledge graph representation learning aims to learn low-dimensional vector embeddings for entities and relations in a knowledge graph. The representation learning of temporal knowledge graphs incorporates time information into the standard knowledge graph framework and can model the dynamics of entities and relations over time. In this paper, we conduct a comprehensive survey of temporal knowledge graph representation learning and its applications. We begin with an introduction to the definitions, datasets, and evaluation metrics for temporal knowledge graph representation learning. Next, we propose a taxonomy based on the core technologies of temporal knowledge graph representation learning methods, and provide an in-depth analysis of different methods in each category. Finally, we present various downstream applications related to the temporal knowledge graphs. In the end, we conclude the paper and have an outlook on the future research directions in this area."}