{"paperId":"9743f44ed6ca96aeb89358bcbb99aebe65113262","externalIds":{"ArXiv":"2401.00713","CorpusId":266693787},"title":"Graph Neural Networks in Intelligent Transportation Systems: Advances, Applications and Trends","openAccessPdf":{"url":"","status":null,"license":null,"disclaimer":"Notice: Paper or abstract available at https://arxiv.org/abs/2401.00713, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."},"authors":[{"authorId":"2277411178","name":"Hourun Li"},{"authorId":"2124210104","name":"Yusheng Zhao"},{"authorId":"1441866552","name":"Zhengyan Mao"},{"authorId":"2420154","name":"Yifang Qin"},{"authorId":"2277282523","name":"Zhiping Xiao"},{"authorId":"2277431076","name":"Jiaqi Feng"},{"authorId":"2112579634","name":"Yiyang Gu"},{"authorId":"2154453854","name":"Wei Ju"},{"authorId":"2256770719","name":"Xiao Luo"},{"authorId":"1596795872","name":"Ming Zhang"}],"abstract":"Intelligent Transportation System (ITS) is crucial for improving traffic congestion, reducing accidents, optimizing urban planning, and more. However, the complexity of traffic networks has rendered traditional machine learning and statistical methods less effective. With the advent of artificial intelligence, deep learning frameworks have achieved remarkable progress across various fields and are now considered highly effective in many areas. Since 2019, Graph Neural Networks (GNNs) have emerged as a particularly promising deep learning approach within the ITS domain, owing to their robust ability to model graph-structured data and address complex problems. Consequently, there has been increasing scholarly attention to the applications of GNNs in transportation, which have demonstrated excellent performance. Nevertheless, current research predominantly focuses on traffic forecasting, with other ITS domains, such as autonomous vehicles and demand prediction, receiving less attention. This paper aims to review the applications of GNNs across six representative and emerging ITS research areas: traffic forecasting, vehicle control system, traffic signal control, transportation safety, demand prediction, and parking management. We have examined a wide range of graph-related studies from 2018 to 2023, summarizing their methodologies, features, and contributions in detailed tables and lists. Additionally, we identify the challenges of applying GNNs in ITS and propose potential future research directions."}