{"paperId":"eb9c4a07a336e8deefe7b399c550d3af0241238e","externalIds":{"ArXiv":"2405.06211","DBLP":"conf/kdd/FanDNWLYCL24","DOI":"10.1145/3637528.3671470","CorpusId":269740933},"title":"A Survey on RAG Meeting LLMs: Towards Retrieval-Augmented Large Language Models","openAccessPdf":{"url":"","status":null,"license":null,"disclaimer":"Notice: Paper or abstract available at https://arxiv.org/abs/2405.06211, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."},"authors":[{"authorId":"2291324376","name":"Wenqi Fan"},{"authorId":"2301103404","name":"Yujuan Ding"},{"authorId":"2301015154","name":"Liang-bo Ning"},{"authorId":"2266567589","name":"Shijie Wang"},{"authorId":"2301167804","name":"Hengyun Li"},{"authorId":"2297846971","name":"Dawei Yin"},{"authorId":"2279753672","name":"Tat-Seng Chua"},{"authorId":"2297955888","name":"Qing Li"}],"abstract":"As one of the most advanced techniques in AI, Retrieval-Augmented Generation (RAG) can offer reliable and up-to-date external knowledge, providing huge convenience for numerous tasks. Particularly in the era of AI-Generated Content (AIGC), the powerful capacity of retrieval in providing additional knowledge enables RAG to assist existing generative AI in producing high-quality outputs. Recently, Large Language Models (LLMs) have demonstrated revolutionary abilities in language understanding and generation, while still facing inherent limitations such as hallucinations and out-of-date internal knowledge. Given the powerful abilities of RAG in providing the latest and helpful auxiliary information, Retrieval-Augmented Large Language Models (RA-LLMs) have emerged to harness external and authoritative knowledge bases, rather than solely relying on the model's internal knowledge, to augment the quality of the generated content of LLMs. In this survey, we comprehensively review existing research studies in RA-LLMs, covering three primary technical perspectives: Furthermore, to deliver deeper insights, we discuss current limitations and several promising directions for future research. Updated information about this survey can be found at: https://advanced-recommender-systems.github.io/RAG-Meets-LLMs/"}