{"paperId":"1df9a99f1c2aebcdec1d17c268bf2f128a55d6c4","externalIds":{"ArXiv":"2403.04279","DBLP":"journals/corr/abs-2403-04279","DOI":"10.1109/TPAMI.2025.3646548","CorpusId":268264822,"PubMed":"41418008"},"title":"Controllable Generation with Text-to-Image Diffusion Models: A Survey","openAccessPdf":{"url":"","status":null,"license":null,"disclaimer":"Notice: Paper or abstract available at https://arxiv.org/abs/2403.04279, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."},"authors":[{"authorId":"2203366502","name":"Pu Cao"},{"authorId":"2273950538","name":"Feng Zhou"},{"authorId":"2273931256","name":"Qing Song"},{"authorId":"39702333","name":"Lu Yang"}],"abstract":"In the rapidly advancing realm of visual generation, diffusion models have revolutionized the landscape, marking a significant shift in capabilities with their impressive text-guided generative functions. However, relying solely on text for conditioning these models does not fully cater to the varied and complex requirements of different applications and scenarios. Acknowledging this shortfall, a variety of studies aim to control pre-trained text-to-image (T2I) models to support novel conditions. In this survey, we undertake a thorough review of the literature on controllable generation with T2I diffusion models, covering both the theoretical foundations and practical advancements in this domain. Our review begins with a brief introduction to the basics of denoising diffusion probabilistic models (DDPMs) and widely used T2I diffusion models. Additionally, we provide a detailed overview of research in this area, categorizing it from the condition perspective into three directions: generation with specific conditions, generation with multiple conditions, and universal controllable generation. For each category, we analyze the underlying control mechanisms and review representative methods based on their core techniques. For an exhaustive list of the controllable generation literature surveyed, please refer to our curated repository at https://github.com/PRIV-Creation/Awesome-Controllable-T2I-Diffusion-Models."}