{"paperId":"f6d1888ed12f3162840e2cf9af32027ab89d2102","externalIds":{"ArXiv":"2310.02164","DBLP":"journals/corr/abs-2310-02164","DOI":"10.48550/arXiv.2310.02164","CorpusId":263609336},"title":"A Survey of Graph Unlearning","openAccessPdf":{"url":"https://arxiv.org/pdf/2310.02164","status":"CLOSED","license":null,"disclaimer":"Notice: Paper or abstract available at https://arxiv.org/abs/2310.02164, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."},"authors":[{"authorId":"50192588","name":"Anwar Said"},{"authorId":"2253594250","name":"Tyler Derr"},{"authorId":"38776168","name":"Mudassir Shabbir"},{"authorId":"1764810","name":"Waseem Abbas"},{"authorId":"1727409","name":"X. Koutsoukos"}],"abstract":"Graph unlearning emerges as a crucial advancement in the pursuit of responsible AI, providing the means to remove sensitive data traces from trained models, thereby upholding the \\textit{right to be forgotten}. It is evident that graph machine learning exhibits sensitivity to data privacy and adversarial attacks, necessitating the application of graph unlearning techniques to address these concerns effectively. In this comprehensive survey paper, we present the first systematic review of graph unlearning approaches, encompassing a diverse array of methodologies and offering a detailed taxonomy and up-to-date literature overview to facilitate the understanding of researchers new to this field. To ensure clarity, we provide lucid explanations of the fundamental concepts and evaluation measures used in graph unlearning, catering to a broader audience with varying levels of expertise. Delving into potential applications, we explore the versatility of graph unlearning across various domains, including but not limited to social networks, adversarial settings, recommender systems, and resource-constrained environments like the Internet of Things, illustrating its potential impact in safeguarding data privacy and enhancing AI systems'robustness. Finally, we shed light on promising research directions, encouraging further progress and innovation within the domain of graph unlearning. By laying a solid foundation and fostering continued progress, this survey seeks to inspire researchers to further advance the field of graph unlearning, thereby instilling confidence in the ethical growth of AI systems and reinforcing the responsible application of machine learning techniques in various domains."}