{"paperId":"6140211405f9917ded519da50f00eee989eabd7f","externalIds":{"DBLP":"journals/corr/abs-2312-08782","ArXiv":"2312.08782","DOI":"10.48550/arXiv.2312.08782","CorpusId":266210148},"title":"Toward General-Purpose Robots via Foundation Models: A Survey and Meta-Analysis","openAccessPdf":{"url":"","status":null,"license":null,"disclaimer":"Notice: Paper or abstract available at https://arxiv.org/abs/2312.08782, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."},"authors":[{"authorId":"2113666258","name":"Yafei Hu"},{"authorId":"2242010169","name":"Quanting Xie"},{"authorId":"2253472236","name":"Vidhi Jain"},{"authorId":"2278444950","name":"Jonathan Francis"},{"authorId":"51244250","name":"Jay Patrikar"},{"authorId":"1585516855","name":"Nikhil Varma Keetha"},{"authorId":"2278742776","name":"Seungchan Kim"},{"authorId":"2278458886","name":"Yaqi Xie"},{"authorId":"2238206121","name":"Tianyi Zhang"},{"authorId":"2278582891","name":"Shibo Zhao"},{"authorId":"2278449395","name":"Yu Quan Chong"},{"authorId":"2292199635","name":"Chen Wang"},{"authorId":"2278443794","name":"Katia P. Sycara"},{"authorId":"2278448710","name":"Matthew Johnson-Roberson"},{"authorId":"2270607216","name":"Dhruv Batra"},{"authorId":"2255251113","name":"Xiaolong Wang"},{"authorId":"2244621332","name":"Sebastian Scherer"},{"authorId":"145276578","name":"Z. Kira"},{"authorId":"2237987648","name":"Fei Xia"},{"authorId":"3312309","name":"Yonatan Bisk"}],"abstract":"Building general-purpose robots that operate seamlessly in any environment, with any object, and utilizing various skills to complete diverse tasks has been a long-standing goal in Artificial Intelligence. However, as a community, we have been constraining most robotic systems by designing them for specific tasks, training them on specific datasets, and deploying them within specific environments. These systems require extensively-labeled data and task-specific models. When deployed in real-world scenarios, such systems face several generalization issues and struggle to remain robust to distribution shifts. Motivated by the impressive open-set performance and content generation capabilities of web-scale, large-capacity pre-trained models (i.e., foundation models) in research fields such as Natural Language Processing (NLP) and Computer Vision (CV), we devote this survey to exploring (i) how these existing foundation models from NLP and CV can be applied to the field of general-purpose robotics, and also exploring (ii) what a robotics-specific foundation model would look like. We begin by providing a generalized formulation of how foundation models are used in robotics, and the fundamental barriers to making generalist robots universally applicable. Next, we establish a taxonomy to discuss current work exploring ways to leverage existing foundation models for robotics and develop ones catered to robotics. Finally, we discuss key challenges and promising future directions in using foundation models for enabling general-purpose robotic systems. We encourage readers to view our living GitHub repository 2 of resources, including papers reviewed in this survey, as well as related projects and repositories for developing foundation models for robotics."}