{"paperId":"888728745dbb769e29ed475d4f7661eebe1a71cf","externalIds":{"DBLP":"journals/tist/ChangWWWYZCYWWYZCYYX24","ArXiv":"2307.03109","DOI":"10.1145/3641289","CorpusId":259360395},"title":"A Survey on Evaluation of Large Language Models","openAccessPdf":{"url":"https://arxiv.org/pdf/2307.03109","status":"GREEN","license":null,"disclaimer":"Notice: Paper or abstract available at https://arxiv.org/abs/2307.03109, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."},"authors":[{"authorId":"2140050490","name":"Yu-Chu Chang"},{"authorId":"2206577797","name":"Xu Wang"},{"authorId":"1519290245","name":"Jindong Wang"},{"authorId":"48608007","name":"Yuan Wu"},{"authorId":"2543684","name":"Kaijie Zhu"},{"authorId":"2051536212","name":"Hao Chen"},{"authorId":"2145500840","name":"Linyi Yang"},{"authorId":"3393196","name":"Xiaoyuan Yi"},{"authorId":"35504092","name":"Cunxiang Wang"},{"authorId":"2108024279","name":"Yidong Wang"},{"authorId":"2147205193","name":"Weirong Ye"},{"authorId":"2211964951","name":"Yue Zhang"},{"authorId":"2131636065","name":"Yi Chang"},{"authorId":"2191036692","name":"Philip S. Yu"},{"authorId":"2158406244","name":"Qian Yang"},{"authorId":"1576441343","name":"Xingxu Xie"}],"abstract":"Large language models (LLMs) are gaining increasing popularity in both academia and industry, owing to their unprecedented performance in various applications. As LLMs continue to play a vital role in both research and daily use, their evaluation becomes increasingly critical, not only at the task level, but also at the society level for better understanding of their potential risks. Over the past years, significant efforts have been made to examine LLMs from various perspectives. This paper presents a comprehensive review of these evaluation methods for LLMs, focusing on three key dimensions: what to evaluate, where to evaluate, and how to evaluate. Firstly, we provide an overview from the perspective of evaluation tasks, encompassing general natural language processing tasks, reasoning, medical usage, ethics, education, natural and social sciences, agent applications, and other areas. Secondly, we answer the ‘where’ and ‘how’ questions by diving into the evaluation methods and benchmarks, which serve as crucial components in assessing the performance of LLMs. Then, we summarize the success and failure cases of LLMs in different tasks. Finally, we shed light on several future challenges that lie ahead in LLMs evaluation. Our aim is to offer invaluable insights to researchers in the realm of LLMs evaluation, thereby aiding the development of more proficient LLMs. Our key point is that evaluation should be treated as an essential discipline to better assist the development of LLMs. We consistently maintain the related open-source materials at: https://github.com/MLGroupJLU/LLM-eval-survey"}