{"paperId":"8663871588271b4f20645fefcc7d25d9bd1547cf","externalIds":{"DBLP":"journals/corr/abs-2406-11903","ArXiv":"2406.11903","DOI":"10.48550/arXiv.2406.11903","CorpusId":270562262},"title":"A Survey of Large Language Models for Financial Applications: Progress, Prospects and Challenges","openAccessPdf":{"url":"","status":null,"license":null,"disclaimer":"Notice: Paper or abstract available at https://arxiv.org/abs/2406.11903, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."},"authors":[{"authorId":"2301235606","name":"Yuqi Nie"},{"authorId":"2307607703","name":"Yaxuan Kong"},{"authorId":"2279250404","name":"Xiaowen Dong"},{"authorId":"2238766751","name":"John M. Mulvey"},{"authorId":"2265928094","name":"H. Poor"},{"authorId":"2307076087","name":"Qingsong Wen"},{"authorId":"2279077978","name":"Stefan Zohren"}],"abstract":"Recent advances in large language models (LLMs) have unlocked novel opportunities for machine learning applications in the financial domain. These models have demonstrated remarkable capabilities in understanding context, processing vast amounts of data, and generating human-preferred contents. In this survey, we explore the application of LLMs on various financial tasks, focusing on their potential to transform traditional practices and drive innovation. We provide a discussion of the progress and advantages of LLMs in financial contexts, analyzing their advanced technologies as well as prospective capabilities in contextual understanding, transfer learning flexibility, complex emotion detection, etc. We then highlight this survey for categorizing the existing literature into key application areas, including linguistic tasks, sentiment analysis, financial time series, financial reasoning, agent-based modeling, and other applications. For each application area, we delve into specific methodologies, such as textual analysis, knowledge-based analysis, forecasting, data augmentation, planning, decision support, and simulations. Furthermore, a comprehensive collection of datasets, model assets, and useful codes associated with mainstream applications are presented as resources for the researchers and practitioners. Finally, we outline the challenges and opportunities for future research, particularly emphasizing a number of distinctive aspects in this field. We hope our work can help facilitate the adoption and further development of LLMs in the financial sector."}