{"paperId":"7a6d2d4f882f63840d7084fa33c7d614b82b5f76","externalIds":{"ArXiv":"2302.13876","DBLP":"journals/corr/abs-2302-13876","DOI":"10.48550/arXiv.2302.13876","CorpusId":257219314},"title":"Evolution of MAC Protocols in the Machine Learning Decade: A Comprehensive Survey","openAccessPdf":{"url":"http://arxiv.org/pdf/2302.13876","status":"CLOSED","license":null,"disclaimer":"Notice: Paper or abstract available at https://arxiv.org/abs/2302.13876, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."},"authors":[{"authorId":"2074969985","name":"Mostafa Hussien"},{"authorId":"1405340824","name":"I. Taj-Eddin"},{"authorId":"2068054","name":"Mohammed F. A. Ahmed"},{"authorId":"1478241695","name":"Ali Ranjha"},{"authorId":"144147833","name":"K. Nguyen"},{"authorId":"145541445","name":"M. Cheriet"}],"abstract":"The last decade, (2012 - 2022), saw an unprecedented advance in machine learning (ML) techniques, particularly deep learning (DL). As a result of the proven capabilities of DL, a large amount of work has been presented and studied in almost every field. Since 2012, when the convolution neural networks have been reintroduced in the context of \\textit{ImagNet} competition, DL continued to achieve superior performance in many challenging tasks and problems. Wireless communications, in general, and medium access control (MAC) techniques, in particular, were among the fields that were heavily affected by this improvement. MAC protocols play a critical role in defining the performance of wireless communication systems. At the same time, the community lacks a comprehensive survey that collects, analyses, and categorizes the recent work in ML-inspired MAC techniques. In this work, we fill this gap by surveying a long line of work in this era. We solidify the impact of machine learning on wireless MAC protocols. We provide a comprehensive background to the widely adopted MAC techniques, their design issues, and their taxonomy, in connection with the famous application domains. Furthermore, we provide an overview of the ML techniques that have been considered in this context. Finally, we augment our work by proposing some promising future research directions and open research questions that are worth further investigation."}