{"paperId":"d9044f8c04a23064ab2e92c8720b4f860855afa4","externalIds":{"DBLP":"journals/cbm/GuoWSYCLZYXB24","ArXiv":"2309.15857","DOI":"10.1016/j.compbiomed.2024.108709","CorpusId":270319618,"PubMed":"38878398"},"title":"A survey on advancements in image-text multimodal models: From general techniques to biomedical implementations","openAccessPdf":{"url":"","status":"CLOSED","license":null,"disclaimer":"Notice: Paper or abstract available at https://arxiv.org/abs/2309.15857, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."},"authors":[{"authorId":"2247976614","name":"Ruifeng Guo"},{"authorId":"2111524258","name":"Jingxuan Wei"},{"authorId":"2224667978","name":"Linzhuang Sun"},{"authorId":"2249451829","name":"Bihui Yu"},{"authorId":"2248169639","name":"Guiyong Chang"},{"authorId":"2248487200","name":"Dawei Liu"},{"authorId":"2248037257","name":"Sibo Zhang"},{"authorId":"2247902956","name":"Zhengbing Yao"},{"authorId":"2249256510","name":"Mingjun Xu"},{"authorId":"2160857879","name":"Liping Bu"}],"abstract":"With the significant advancements of Large Language Models (LLMs) in the field of Natural Language Processing (NLP), the development of image-text multimodal models has garnered widespread attention. Current surveys on image-text multimodal models mainly focus on representative models or application domains, but lack a review on how general technical models influence the development of domain-specific models, which is crucial for domain researchers. Based on this, this paper first reviews the technological evolution of image-text multimodal models, from early explorations of feature space to visual language encoding structures, and then to the latest large model architectures. Next, from the perspective of technological evolution, we explain how the development of general image-text multimodal technologies promotes the progress of multimodal technologies in the biomedical field, as well as the importance and complexity of specific datasets in the biomedical domain. Then, centered on the tasks of image-text multimodal models, we analyze their common components and challenges. After that, we summarize the architecture, components, and data of general image-text multimodal models, and introduce the applications and improvements of image-text multimodal models in the biomedical field. Finally, we categorize the challenges faced in the development and application of general models into external factors and intrinsic factors, further refining them into 2 external factors and 5 intrinsic factors, and propose targeted solutions, providing guidance for future research directions. For more details and data, please visit our GitHub page: https://github.com/i2vec/A-survey-on-image-text-multimodal-models."}