{"paperId":"72f38d513a8ab095a3d4f459958cbb31b1f7cdc4","externalIds":{"DBLP":"journals/corr/abs-2401-03717","ArXiv":"2401.03717","DOI":"10.48550/arXiv.2401.03717","CorpusId":266844836},"title":"Universal Time-Series Representation Learning: A Survey","openAccessPdf":{"url":"","status":null,"license":null,"disclaimer":"Notice: Paper or abstract available at https://arxiv.org/abs/2401.03717, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."},"authors":[{"authorId":"134607506","name":"Patara Trirat"},{"authorId":"2114100776","name":"Yooju Shin"},{"authorId":"153041205","name":"Junhyeok Kang"},{"authorId":"1900303688","name":"Youngeun Nam"},{"authorId":"2278435709","name":"Jihye Na"},{"authorId":"2278437886","name":"Minyoung Bae"},{"authorId":"2278590857","name":"Joeun Kim"},{"authorId":"2196449069","name":"Byunghyun Kim"},{"authorId":"2222379427","name":"Jae-Gil Lee"}],"abstract":"Time-series data exists in every corner of real-world systems and services, ranging from satellites in the sky to wearable devices on human bodies. Learning representations by extracting and inferring valuable information from these time series is crucial for understanding the complex dynamics of particular phenomena and enabling informed decisions. With the learned representations, we can perform numerous downstream analyses more effectively. Among several approaches, deep learning has demonstrated remarkable performance in extracting hidden patterns and features from time-series data without manual feature engineering. This survey first presents a novel taxonomy based on three fundamental elements in designing state-of-the-art universal representation learning methods for time series. According to the proposed taxonomy, we comprehensively review existing studies and discuss their intuitions and insights into how these methods enhance the quality of learned representations. Finally, as a guideline for future studies, we summarize commonly used experimental setups and datasets and discuss several promising research directions. An up-to-date corresponding resource is available at https://github.com/itouchz/awesome-deep-time-series-representations."}