{"paperId":"f0606e2d975cda134392877e4064924a13915301","externalIds":{"DBLP":"journals/corr/abs-2307-03929","ArXiv":"2307.03929","DOI":"10.1145/3649142","CorpusId":259501889},"title":"Fairness-Aware Graph Neural Networks: A Survey","openAccessPdf":{"url":"","status":null,"license":null,"disclaimer":"Notice: Paper or abstract available at https://arxiv.org/abs/2307.03929, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."},"authors":[{"authorId":"2198208547","name":"April Chen"},{"authorId":"2066337266","name":"Ryan A. Rossi"},{"authorId":"2867343","name":"Namyong Park"},{"authorId":"30440868","name":"Puja Trivedi"},{"authorId":"2153607948","name":"Yu Wang"},{"authorId":"1500399016","name":"Tong Yu"},{"authorId":"2109571021","name":"Sungchul Kim"},{"authorId":"2462276","name":"Franck Dernoncourt"},{"authorId":"144741751","name":"Nesreen K. Ahmed"}],"abstract":"Graph Neural Networks (GNNs) have become increasingly important due to their representational power and state-of-the-art predictive performance on many fundamental learning tasks. Despite this success, GNNs suffer from fairness issues that arise as a result of the underlying graph data and the fundamental aggregation mechanism that lies at the heart of the large class of GNN models. In this article, we examine and categorize fairness techniques for improving the fairness of GNNs. We categorize these techniques by whether they focus on improving fairness in the pre-processing, in-processing (during training), or post-processing phases. We discuss how such techniques can be used together whenever appropriate and highlight the advantages and intuition as well. We also introduce an intuitive taxonomy for fairness evaluation metrics, including graph-level fairness, neighborhood-level fairness, embedding-level fairness, and prediction-level fairness metrics. In addition, graph datasets that are useful for benchmarking the fairness of GNN models are summarized succinctly. Finally, we highlight key open problems and challenges that remain to be addressed."}