{"paperId":"2cee117442d71ef52242b18f8879865651b959fc","externalIds":{"DBLP":"journals/corr/abs-2402-05391","ArXiv":"2402.05391","DOI":"10.48550/arXiv.2402.05391","CorpusId":267547866},"title":"Knowledge Graphs Meet Multi-Modal Learning: A Comprehensive Survey","openAccessPdf":{"url":"","status":null,"license":null,"disclaimer":"Notice: Paper or abstract available at https://arxiv.org/abs/2402.05391, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."},"authors":[{"authorId":"2283992213","name":"Zhuo Chen"},{"authorId":"2261895451","name":"Yichi Zhang"},{"authorId":"2112787103","name":"Yin Fang"},{"authorId":"152683218","name":"Yuxia Geng"},{"authorId":"80232698","name":"Lingbing Guo"},{"authorId":"2143735911","name":"Xiang Chen"},{"authorId":"2284861197","name":"Qian Li"},{"authorId":"2155281129","name":"Wen Zhang"},{"authorId":"2269695376","name":"Jiaoyan Chen"},{"authorId":"2145160040","name":"Yushan Zhu"},{"authorId":"2283357693","name":"Jiaqi Li"},{"authorId":"2109052548","name":"Xiaoze Liu"},{"authorId":"2281582268","name":"Jeff Z. Pan"},{"authorId":"2153010067","name":"Ningyu Zhang"},{"authorId":"14499025","name":"Hua-zeng Chen"}],"abstract":"Knowledge Graphs (KGs) play a pivotal role in advancing various AI applications, with the semantic web community's exploration into multi-modal dimensions unlocking new avenues for innovation. In this survey, we carefully review over 300 articles, focusing on KG-aware research in two principal aspects: KG-driven Multi-Modal (KG4MM) learning, where KGs support multi-modal tasks, and Multi-Modal Knowledge Graph (MM4KG), which extends KG studies into the MMKG realm. We begin by defining KGs and MMKGs, then explore their construction progress. Our review includes two primary task categories: KG-aware multi-modal learning tasks, such as Image Classification and Visual Question Answering, and intrinsic MMKG tasks like Multi-modal Knowledge Graph Completion and Entity Alignment, highlighting specific research trajectories. For most of these tasks, we provide definitions, evaluation benchmarks, and additionally outline essential insights for conducting relevant research. Finally, we discuss current challenges and identify emerging trends, such as progress in Large Language Modeling and Multi-modal Pre-training strategies. This survey aims to serve as a comprehensive reference for researchers already involved in or considering delving into KG and multi-modal learning research, offering insights into the evolving landscape of MMKG research and supporting future work."}