{"paperId":"eee9880db5cfd10c27665ebea151843e9cb12175","externalIds":{"DBLP":"journals/corr/abs-2406-01252","ArXiv":"2406.01252","DOI":"10.48550/arXiv.2406.01252","CorpusId":270212579},"title":"Towards Scalable Automated Alignment of LLMs: A Survey","openAccessPdf":{"url":"","status":null,"license":null,"disclaimer":"Notice: Paper or abstract available at https://arxiv.org/abs/2406.01252, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."},"authors":[{"authorId":"2113252896","name":"Boxi Cao"},{"authorId":"2257001403","name":"Keming Lu"},{"authorId":"50085043","name":"Xinyu Lu"},{"authorId":"2115448879","name":"Jiawei Chen"},{"authorId":"2280137459","name":"Mengjie Ren"},{"authorId":"2223162767","name":"Hao Xiang"},{"authorId":"2113250157","name":"Peilin Liu"},{"authorId":"1831434","name":"Yaojie Lu"},{"authorId":"2304906129","name":"Ben He"},{"authorId":"2118233348","name":"Xianpei Han"},{"authorId":"2110832778","name":"Le Sun"},{"authorId":"2116455765","name":"Hongyu Lin"},{"authorId":"2249451832","name":"Bowen Yu"}],"abstract":"Alignment is the most critical step in building large language models (LLMs) that meet human needs. With the rapid development of LLMs gradually surpassing human capabilities, traditional alignment methods based on human-annotation are increasingly unable to meet the scalability demands. Therefore, there is an urgent need to explore new sources of automated alignment signals and technical approaches. In this paper, we systematically review the recently emerging methods of automated alignment, attempting to explore how to achieve effective, scalable, automated alignment once the capabilities of LLMs exceed those of humans. Specifically, we categorize existing automated alignment methods into 4 major categories based on the sources of alignment signals and discuss the current status and potential development of each category. Additionally, we explore the underlying mechanisms that enable automated alignment and discuss the essential factors that make automated alignment technologies feasible and effective from the fundamental role of alignment."}