{"paperId":"64c00822dea4fe7180042d745109be30ce1e7c30","externalIds":{"DBLP":"journals/tai/MaiZFZ25","ArXiv":"2401.00430","DOI":"10.1109/TAI.2024.3516698","CorpusId":266693387},"title":"Brain-Conditional Multimodal Synthesis: A Survey and Taxonomy","openAccessPdf":{"url":"https://arxiv.org/pdf/2401.00430","status":"GREEN","license":null,"disclaimer":"Notice: Paper or abstract available at https://arxiv.org/abs/2401.00430, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."},"authors":[{"authorId":"2277244716","name":"Weijian Mai"},{"authorId":"2277451637","name":"Jian Zhang"},{"authorId":"2244394825","name":"Pengfei Fang"},{"authorId":"2277257874","name":"Zhijun Zhang"}],"abstract":"In the era of artificial intelligence generated content (AIGC), conditional multimodal synthesis technologies (e.g., text-to-image) are dynamically reshaping the natural content. Brain signals, serving as potential reflections of how the brain interprets external information, exhibit a distinctive one-to-many correspondence with various external modalities. This correspondence makes brain signals emerge as a promising guiding condition for multimodal synthesis (e.g., image, text, and audio), which is crucial for developing practical brain–computer interface systems and unraveling complex mechanisms underlying human perception. This survey comprehensively examines the emerging field of brain-conditional multimodal synthesis, termed AIGC-brain, to delineate the current landscape and future directions. To begin, related neuroimaging datasets and generative models are introduced as the foundation of AIGC-brain decoding and analysis. Next, we present a comprehensive taxonomy according to AIGC-brain methodologies, followed by task-specific representative work and implementation details to facilitate in-depth comparison and analysis. Quality assessments are then introduced for both qualitative and quantitative evaluation. Finally, this survey explores insights gained, outlining current challenges and prospects of AIGC-brain. As a pioneering survey, this article paves the way for future advances in AIGC-brain research."}