{"paperId":"c90c9fb2a094599ecdae11099dddad378f6ed439","externalIds":{"DBLP":"journals/fcsc/HanCWLKJYXWWXWZLRH25","ArXiv":"2403.00485","DOI":"10.1007/s11704-025-41426-w","CorpusId":268201654},"title":"A survey of geometric graph neural networks: data structures, models and applications","openAccessPdf":{"url":"","status":null,"license":null,"disclaimer":"Notice: Paper or abstract available at https://arxiv.org/abs/2403.00485, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."},"authors":[{"authorId":"2047522640","name":"Jiaqi Han"},{"authorId":"2289611642","name":"Jiacheng Cen"},{"authorId":"2288062347","name":"Liming Wu"},{"authorId":"2289779963","name":"Zongzhao Li"},{"authorId":"2093919461","name":"Xiangzhe Kong"},{"authorId":"2112690595","name":"Rui Jiao"},{"authorId":"2279754569","name":"Ziyang Yu"},{"authorId":"1754673","name":"Tingyang Xu"},{"authorId":"2283877320","name":"Fandi Wu"},{"authorId":"2289778864","name":"Zihe Wang"},{"authorId":"2146235527","name":"Hongteng Xu"},{"authorId":"2290027771","name":"Zhewei Wei"},{"authorId":"2279867467","name":"Yang Liu"},{"authorId":"2287923058","name":"Yu Rong"},{"authorId":"2279853791","name":"Wenbing Huang"}],"abstract":"Geometric graphs are a special kind of graph with geometric features, which are vital to model many scientific problems. Unlike generic graphs, geometric graphs often exhibit physical symmetries of translations, rotations, and reflections, making them ineffectively processed by current Graph Neural Networks (GNNs). To address this issue, researchers proposed a variety of geometric GNNs equipped with invariant/equivariant properties to better characterize the geometry and topology of geometric graphs. Given the current progress in this field, it is imperative to conduct a comprehensive survey of data structures, models, and applications related to geometric GNNs. In this paper, based on the necessary but concise mathematical preliminaries, we formalize geometric graph as the data structure, on top of which we provide a unified view of existing models from the geometric message passing perspective. Additionally, we summarize the applications as well as the related datasets to facilitate later research for methodology development and experimental evaluation. We also discuss the challenges and future potential directions of geometric GNNs at the end of this survey."}