{"paperId":"b773069d893a72cee5d62e8c51ffecbeb0f0b07f","externalIds":{"ArXiv":"2404.00629","DBLP":"journals/corr/abs-2404-00629","DOI":"10.48550/arXiv.2404.00629","CorpusId":268820098},"title":"Against The Achilles' Heel: A Survey on Red Teaming for Generative Models","openAccessPdf":{"url":"","status":null,"license":null,"disclaimer":"Notice: Paper or abstract available at https://arxiv.org/abs/2404.00629, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."},"authors":[{"authorId":"2284823063","name":"Lizhi Lin"},{"authorId":"2292039878","name":"Honglin Mu"},{"authorId":"51230252","name":"Zenan Zhai"},{"authorId":"2242189619","name":"Minghan Wang"},{"authorId":"2275119551","name":"Yuxia Wang"},{"authorId":"2215688800","name":"Renxi Wang"},{"authorId":"2294509423","name":"Junjie Gao"},{"authorId":"2266000475","name":"Yixuan Zhang"},{"authorId":"2292032004","name":"Wanxiang Che"},{"authorId":"2256987316","name":"Timothy Baldwin"},{"authorId":"2110982198","name":"Xudong Han"},{"authorId":"2410083270","name":"Haonan Li"}],"abstract":"Generative models are rapidly gaining popularity and being integrated into everyday applications, raising concerns over their safe use as various vulnerabilities are exposed. In light of this, the field of red teaming is undergoing fast-paced growth, highlighting the need for a comprehensive survey covering the entire pipeline and addressing emerging topics. Our extensive survey, which examines over 120 papers, introduces a taxonomy of fine-grained attack strategies grounded in the inherent capabilities of language models. Additionally, we have developed the\"searcher\"framework to unify various automatic red teaming approaches. Moreover, our survey covers novel areas including multimodal attacks and defenses, risks around LLM-based agents, overkill of harmless queries, and the balance between harmlessness and helpfulness."}