{"paperId":"c589a3420ba335a05c248f525ea3c6e90215e42b","externalIds":{"DBLP":"journals/corr/abs-2302-03735","ArXiv":"2302.03735","DOI":"10.1162/tacl_a_00619","CorpusId":256662721},"title":"Pre-train, Prompt, and Recommendation: A Comprehensive Survey of Language Modeling Paradigm Adaptations in Recommender Systems","openAccessPdf":{"url":"https://direct.mit.edu/tacl/article-pdf/doi/10.1162/tacl_a_00619/2196852/tacl_a_00619.pdf","status":"GOLD","license":"CCBY","disclaimer":"Notice: Paper or abstract available at https://arxiv.org/abs/2302.03735, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."},"authors":[{"authorId":"145779142","name":"Peng Liu"},{"authorId":"7559523","name":"Lemei Zhang"},{"authorId":"1755274","name":"J. Gulla"}],"abstract":"Abstract The emergence of Pre-trained Language Models (PLMs) has achieved tremendous success in the field of Natural Language Processing (NLP) by learning universal representations on large corpora in a self-supervised manner. The pre-trained models and the learned representations can be beneficial to a series of downstream NLP tasks. This training paradigm has recently been adapted to the recommendation domain and is considered a promising approach by both academia and industry. In this paper, we systematically investigate how to extract and transfer knowledge from pre-trained models learned by different PLM-related training paradigms to improve recommendation performance from various perspectives, such as generality, sparsity, efficiency and effectiveness. Specifically, we propose a comprehensive taxonomy to divide existing PLM-based recommender systems w.r.t. their training strategies and objectives. Then, we analyze and summarize the connection between PLM-based training paradigms and different input data types for recommender systems. Finally, we elaborate on open issues and future research directions in this vibrant field."}