{"paperId":"002f44bed2836003ca3979780880b7934243eccf","externalIds":{"DBLP":"journals/corr/abs-2406-17624","ArXiv":"2406.17624","DOI":"10.48550/arXiv.2406.17624","CorpusId":270710781},"title":"Self-assessment, Exhibition, and Recognition: a Review of Personality in Large Language Models","openAccessPdf":{"url":"","status":null,"license":null,"disclaimer":"Notice: Paper or abstract available at https://arxiv.org/abs/2406.17624, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."},"authors":[{"authorId":"2000188918","name":"Zhiyuan Wen"},{"authorId":"2283200843","name":"Yu Yang"},{"authorId":"2290238818","name":"Jiannong Cao"},{"authorId":"2308483115","name":"Haoming Sun"},{"authorId":"8092850","name":"Ruosong Yang"},{"authorId":"3344531","name":"Shuaiqi Liu"}],"abstract":"As large language models (LLMs) appear to behave increasingly human-like in text-based interactions, more and more researchers become interested in investigating personality in LLMs. However, the diversity of psychological personality research and the rapid development of LLMs have led to a broad yet fragmented landscape of studies in this interdisciplinary field. Extensive studies across different research focuses, different personality psychometrics, and different LLMs make it challenging to have a holistic overview and further pose difficulties in applying findings to real-world applications. In this paper, we present a comprehensive review by categorizing current studies into three research problems: self-assessment, exhibition, and recognition, based on the intrinsic characteristics and external manifestations of personality in LLMs. For each problem, we provide a thorough analysis and conduct in-depth comparisons of their corresponding solutions. Besides, we summarize research findings and open challenges from current studies and further discuss their underlying causes. We also collect extensive publicly available resources to facilitate interested researchers and developers. Lastly, we discuss the potential future research directions and application scenarios. Our paper is the first comprehensive survey of up-to-date literature on personality in LLMs. By presenting a clear taxonomy, in-depth analysis, promising future directions, and extensive resource collections, we aim to provide a better understanding and facilitate further advancements in this emerging field."}