{"paperId":"3a9b43368a09d07657abe0e62a6c4a1d2428d40c","externalIds":{"ArXiv":"2401.11839","DBLP":"journals/ipm/XuSRGPLSH24","DOI":"10.48550/arXiv.2401.11839","CorpusId":267069237},"title":"AI for social science and social science of AI: A Survey","openAccessPdf":{"url":"","status":null,"license":null,"disclaimer":"Notice: Paper or abstract available at https://arxiv.org/abs/2401.11839, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."},"authors":[{"authorId":"2159707158","name":"Ruoxi Xu"},{"authorId":"2273820044","name":"Yingfei Sun"},{"authorId":"2280137459","name":"Mengjie Ren"},{"authorId":"2280320557","name":"Shiguang Guo"},{"authorId":"2280143071","name":"Ruotong Pan"},{"authorId":"2116455765","name":"Hongyu Lin"},{"authorId":"2110832778","name":"Le Sun"},{"authorId":"2118233348","name":"Xianpei Han"}],"abstract":"Recent advancements in artificial intelligence, particularly with the emergence of large language models (LLMs), have sparked a rethinking of artificial general intelligence possibilities. The increasing human-like capabilities of AI are also attracting attention in social science research, leading to various studies exploring the combination of these two fields. In this survey, we systematically categorize previous explorations in the combination of AI and social science into two directions that share common technical approaches but differ in their research objectives. The first direction is focused on AI for social science, where AI is utilized as a powerful tool to enhance various stages of social science research. While the second direction is the social science of AI, which examines AI agents as social entities with their human-like cognitive and linguistic capabilities. By conducting a thorough review, particularly on the substantial progress facilitated by recent advancements in large language models, this paper introduces a fresh perspective to reassess the relationship between AI and social science, provides a cohesive framework that allows researchers to understand the distinctions and connections between AI for social science and social science of AI, and also summarized state-of-art experiment simulation platforms to facilitate research in these two directions. We believe that as AI technology continues to advance and intelligent agents find increasing applications in our daily lives, the significance of the combination of AI and social science will become even more prominent."}