{"paperId":"f9797152156278f898991a8cac0ac7fc54d64a79","externalIds":{"ArXiv":"2308.14039","DBLP":"journals/tnn/ChenWLTM24","DOI":"10.1109/TNNLS.2023.3309809","CorpusId":261242607,"PubMed":"37738191"},"title":"Deep Learning for Visual Localization and Mapping: A Survey","openAccessPdf":{"url":"https://ieeexplore.ieee.org/ielx7/5962385/6104215/10260323.pdf","status":"HYBRID","license":"CCBY","disclaimer":"Notice: Paper or abstract available at https://arxiv.org/abs/2308.14039, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."},"authors":[{"authorId":"2118428387","name":"Changhao Chen"},{"authorId":"2155840197","name":"Bing Wang"},{"authorId":"11614724","name":"Chris Xiaoxuan Lu"},{"authorId":"1405104972","name":"Niki Trigoni"},{"authorId":"34401562","name":"A. Markham"}],"abstract":"Deep-learning-based localization and mapping approaches have recently emerged as a new research direction and receive significant attention from both industry and academia. Instead of creating hand-designed algorithms based on physical models or geometric theories, deep learning solutions provide an alternative to solve the problem in a data-driven way. Benefiting from the ever-increasing volumes of data and computational power on devices, these learning methods are fast evolving into a new area that shows potential to track self-motion and estimate environmental models accurately and robustly for mobile agents. In this work, we provide a comprehensive survey and propose a taxonomy for the localization and mapping methods using deep learning. This survey aims to discuss two basic questions: whether deep learning is promising for localization and mapping, and how deep learning should be applied to solve this problem. To this end, a series of localization and mapping topics are investigated, from the learning-based visual odometry and global relocalization to mapping, and simultaneous localization and mapping (SLAM). It is our hope that this survey organically weaves together the recent works in this vein from robotics, computer vision, and machine learning communities and serves as a guideline for future researchers to apply deep learning to tackle the problem of visual localization and mapping."}