{"paperId":"dcd0a2e67235add9e520e43c1d1fb4a89d76f98d","externalIds":{"DBLP":"journals/corr/abs-2406-06391","ArXiv":"2406.06391","DOI":"10.1145/3716629","CorpusId":270371124},"title":"Towards Lifelong Learning of Large Language Models: A Survey","openAccessPdf":{"url":"https://arxiv.org/pdf/2406.06391","status":"GREEN","license":null,"disclaimer":"Notice: Paper or abstract available at https://arxiv.org/abs/2406.06391, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."},"authors":[{"authorId":"2809051","name":"Junhao Zheng"},{"authorId":"2273927657","name":"Shengjie Qiu"},{"authorId":"2306749866","name":"Chengming Shi"},{"authorId":"2274027644","name":"Qianli Ma"}],"abstract":"As the applications of large language models (LLMs) expand across diverse fields, their ability to adapt to ongoing changes in data, tasks, and user preferences becomes crucial. Traditional training methods with static datasets are inadequate for coping with the dynamic nature of real-world information. Lifelong learning, or continual learning, addresses this by enabling LLMs to learn continuously and adapt over their operational lifetime, integrating new knowledge while retaining previously learned information and preventing catastrophic forgetting. Our survey explores the landscape of lifelong learning, categorizing strategies into two groups based on how new knowledge is integrated: Internal Knowledge, where LLMs absorb new knowledge into their parameters through full or partial training, and External Knowledge, which incorporates new knowledge as external resources such as Wikipedia or APIs without updating model parameters. The key contributions of our survey include: (1) introducing a novel taxonomy to categorize the extensive literature of lifelong learning into 12 scenarios; (2) identifying common techniques across all lifelong learning scenarios and classifying existing literature into various technique groups; (3) highlighting emerging techniques such as model expansion and data selection, which were less explored in the pre-LLM era. Resources are available at https://github.com/qianlima-lab/awesome-lifelong-learning-methods-for-llm."}