{"paperId":"069b07a146480e80ee1564f5b77b96c31310ca8f","externalIds":{"DBLP":"journals/corr/abs-2403-04468","ArXiv":"2403.04468","DOI":"10.1109/TPAMI.2025.3630673","CorpusId":268264144,"PubMed":"41201947"},"title":"A Survey of Graph Neural Networks in Real World: Imbalance, Noise, Privacy and OOD Challenges","openAccessPdf":{"url":"","status":null,"license":null,"disclaimer":"Notice: Paper or abstract available at https://arxiv.org/abs/2403.04468, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."},"authors":[{"authorId":"2154453854","name":"Wei Ju"},{"authorId":"2253472511","name":"Siyu Yi"},{"authorId":"2115568639","name":"Yifan Wang"},{"authorId":"2277282523","name":"Zhiping Xiao"},{"authorId":"1441866552","name":"Zhengyan Mao"},{"authorId":"2277411178","name":"Hourun Li"},{"authorId":"2112579634","name":"Yiyang Gu"},{"authorId":"2420154","name":"Yifang Qin"},{"authorId":"2290177724","name":"Nan Yin"},{"authorId":"2290247637","name":"Senzhang Wang"},{"authorId":"2290237442","name":"Xinwang Liu"},{"authorId":"2256770719","name":"Xiao Luo"},{"authorId":"2290874357","name":"Philip S. Yu"},{"authorId":"1596795872","name":"Ming Zhang"}],"abstract":"Graph-structured data exhibits universality and widespread applicability across diverse domains, such as social network analysis, biochemistry, financial fraud detection, and network security. Significant strides have been made in leveraging Graph Neural Networks (GNNs) to achieve remarkable success in these areas. However, in real-world scenarios, the training environment for models is often far from ideal, leading to substantial performance degradation of GNN models due to various unfavorable factors, including imbalance in data distribution, the presence of noise in erroneous data, privacy protection of sensitive information, and generalization capability for out-of-distribution (OOD) scenarios. To tackle these issues, substantial efforts have been devoted to improving the performance of GNN models in practical real-world scenarios, as well as enhancing their reliability and robustness. In this paper, we present a comprehensive survey that systematically reviews existing GNN models, focusing on solutions to the four mentioned real-world challenges including imbalance, noise, privacy, and OOD in practical scenarios that many existing reviews have not considered. Specifically, we first highlight the four key challenges faced by existing GNNs, paving the way for our exploration of real-world GNN models. Subsequently, we provide detailed discussions on these four aspects, dissecting how these solutions contribute to enhancing the reliability and robustness of GNN models. Last but not least, we outline promising directions and offer future perspectives in the field."}