{"paperId":"b56ff2343cdc0916a6c0fa075167942aea03ce7f","externalIds":{"ArXiv":"2306.02051","DBLP":"journals/csur/ZhaoDYWZCLSX24","DOI":"10.1145/3674501","CorpusId":259075362},"title":"A Comprehensive Survey on Relation Extraction: Recent Advances and New Frontiers","openAccessPdf":{"url":"https://dl.acm.org/doi/pdf/10.1145/3674501","status":"BRONZE","license":null,"disclaimer":"Notice: Paper or abstract available at https://arxiv.org/abs/2306.02051, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."},"authors":[{"authorId":"2111230693","name":"Xiaoyan Zhao"},{"authorId":"145843537","name":"Yang Deng"},{"authorId":"144346838","name":"Min Yang"},{"authorId":"2151976144","name":"Lingzhi Wang"},{"authorId":"2118403960","name":"Rui Zhang"},{"authorId":"2148630945","name":"Hong Cheng"},{"authorId":"1380007189","name":"W. Lam"},{"authorId":"143822679","name":"Ying Shen"},{"authorId":"2115804042","name":"Ruifeng Xu"}],"abstract":"Relation extraction (RE) involves identifying the relations between entities from underlying content. RE serves as the foundation for many natural language processing (NLP) and information retrieval applications, such as knowledge graph completion and question answering. In recent years, deep neural networks have dominated the field of RE and made noticeable progress. Subsequently, the large pre-trained language models (PLMs) have taken the state-of-the-art RE to a new level. This survey provides a comprehensive review of existing deep learning techniques for RE. First, we introduce RE resources, including datasets and evaluation metrics. Second, we propose a new taxonomy to categorize existing works from three perspectives, i.e., text representation, context encoding, and triplet prediction. Third, we discuss several important challenges faced by RE and summarize potential techniques to tackle these challenges. Finally, we outline some promising future directions and prospects in this field. This survey is expected to facilitate researchers’ collaborative efforts to address the challenges of real-world RE systems."}