{"paperId":"05d1ce1d3f42cc466edc54f88162144a119433a3","externalIds":{"ArXiv":"2311.09008","DBLP":"journals/corr/abs-2311-09008","DOI":"10.48550/arXiv.2311.09008","CorpusId":265212803},"title":"End-to-end Task-oriented Dialogue: A Survey of Tasks, Methods, and Future Directions","openAccessPdf":{"url":"","status":null,"license":null,"disclaimer":"Notice: Paper or abstract available at https://arxiv.org/abs/2311.09008, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."},"authors":[{"authorId":"49169076","name":"Libo Qin"},{"authorId":"2213932237","name":"Wenbo Pan"},{"authorId":"2133447633","name":"Qiguang Chen"},{"authorId":"2266754933","name":"Lizi Liao"},{"authorId":"2267018216","name":"Zhou Yu"},{"authorId":"2265265449","name":"Yue Zhang"},{"authorId":"2262459819","name":"Wanxiang Che"},{"authorId":"2266810224","name":"Min Li"}],"abstract":"End-to-end task-oriented dialogue (EToD) can directly generate responses in an end-to-end fashion without modular training, which attracts escalating popularity. The advancement of deep neural networks, especially the successful use of large pre-trained models, has further led to significant progress in EToD research in recent years. In this paper, we present a thorough review and provide a unified perspective to summarize existing approaches as well as recent trends to advance the development of EToD research. The contributions of this paper can be summarized: (1) \\textbf{\\textit{First survey}}: to our knowledge, we take the first step to present a thorough survey of this research field; (2) \\textbf{\\textit{New taxonomy}}: we first introduce a unified perspective for EToD, including (i) \\textit{Modularly EToD} and (ii) \\textit{Fully EToD}; (3) \\textbf{\\textit{New Frontiers}}: we discuss some potential frontier areas as well as the corresponding challenges, hoping to spur breakthrough research in EToD field; (4) \\textbf{\\textit{Abundant resources}}: we build a public website\\footnote{We collect the related papers, baseline projects, and leaderboards for the community at \\url{https://etods.net/}.}, where EToD researchers could directly access the recent progress. We hope this work can serve as a thorough reference for the EToD research community."}