{"paperId":"8eec27793661664587da6f9adf5ca4b17cb513d0","externalIds":{"DBLP":"journals/swevo/SongWGYSZPDMAF24","ArXiv":"2308.13420","DOI":"10.48550/arXiv.2308.13420","CorpusId":261214753},"title":"Reinforcement Learning-assisted Evolutionary Algorithm: A Survey and Research Opportunities","openAccessPdf":{"url":"https://arxiv.org/pdf/2308.13420","status":"CLOSED","license":null,"disclaimer":"Notice: Paper or abstract available at https://arxiv.org/abs/2308.13420, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."},"authors":[{"authorId":"150351861","name":"Yanjie Song"},{"authorId":"2107939297","name":"Yutong Wu"},{"authorId":"2214333884","name":"Yangyang Guo"},{"authorId":"2147420705","name":"Ran Yan"},{"authorId":"66377820","name":"Ponnuthurai Nagaratnam"},{"authorId":"108750785","name":"Suganthan"},{"authorId":"39939186","name":"Yue Zhang"},{"authorId":"1731634","name":"W. Pedrycz"},{"authorId":"2388718141","name":"Yingwu Chen"},{"authorId":"1747655","name":"Swagatam Das"},{"authorId":"1768588","name":"R. Mallipeddi"},{"authorId":"2234025958","name":"Solomon Ajani"}],"abstract":"Evolutionary algorithms (EA), a class of stochastic search methods based on the principles of natural evolution, have received widespread acclaim for their exceptional performance in various real-world optimization problems. While researchers worldwide have proposed a wide variety of EAs, certain limitations remain, such as slow convergence speed and poor generalization capabilities. Consequently, numerous scholars actively explore improvements to algorithmic structures, operators, search patterns, etc., to enhance their optimization performance. Reinforcement learning (RL) integrated as a component in the EA framework has demonstrated superior performance in recent years. This paper presents a comprehensive survey on integrating reinforcement learning into the evolutionary algorithm, referred to as reinforcement learning-assisted evolutionary algorithm (RL-EA). We begin with the conceptual outlines of reinforcement learning and the evolutionary algorithm. We then provide a taxonomy of RL-EA. Subsequently, we discuss the RL-EA integration method, the RL-assisted strategy adopted by RL-EA, and its applications according to the existing literature. The RL-assisted procedure is divided according to the implemented functions including solution generation, learnable objective function, algorithm/operator/sub-population selection, parameter adaptation, and other strategies. Additionally, different attribute settings of RL in RL-EA are discussed. In the applications of RL-EA section, we also demonstrate the excellent performance of RL-EA on several benchmarks and a range of public datasets to facilitate a quick comparative study. Finally, we analyze potential directions for future research."}