{"paperId":"ddbd3a38a2581b07a175c63bece85a2d244dd434","externalIds":{"ArXiv":"2304.14613","CorpusId":259202940},"title":"Deep Intellectual Property Protection: A Survey","openAccessPdf":{"url":"","status":null,"license":null,"disclaimer":"Notice: Paper or abstract available at https://arxiv.org/abs/2304.14613, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."},"authors":[{"authorId":"2109029173","name":"Yuchen Sun"},{"authorId":"2190166380","name":"Tian-Yi Liu"},{"authorId":"31559404","name":"Panhe Hu"},{"authorId":"2055482014","name":"Qing Liao"},{"authorId":"2158817360","name":"Shaojing Fu"},{"authorId":"2052212945","name":"Neng H. Yu"},{"authorId":"2068110135","name":"Deke Guo"},{"authorId":"2144472895","name":"Yongxiang Liu"},{"authorId":"2220667332","name":"Li Liu"}],"abstract":"Deep Neural Networks (DNNs), from AlexNet to ResNet to ChatGPT, have made revolutionary progress in recent years, and are widely used in various fields. The high performance of DNNs requires a huge amount of high-quality data, expensive computing hardware, and excellent DNN architectures that are costly to obtain. Therefore, trained DNNs are becoming valuable assets and must be considered the Intellectual Property (IP) of the legitimate owner who created them, in order to protect trained DNN models from illegal reproduction, stealing, redistribution, or abuse. Although being a new emerging and interdisciplinary field, numerous DNN model IP protection methods have been proposed. Given this period of rapid evolution, the goal of this paper is to provide a comprehensive survey of two mainstream DNN IP protection methods: deep watermarking and deep fingerprinting, with a proposed taxonomy. More than 190 research contributions are included in this survey, covering many aspects of Deep IP Protection: problem definition, main threats and challenges, merits and demerits of deep watermarking and deep fingerprinting methods, evaluation metrics, and performance discussion. We finish the survey by identifying promising directions for future research."}