{"paperId":"351a2d50b4aff8e9754dc7074dd589b10a7465d4","externalIds":{"DBLP":"journals/corr/abs-2312-17617","ArXiv":"2312.17617","DOI":"10.1007/s11704-024-40555-y","CorpusId":266690657},"title":"Large language models for generative information extraction: a survey","openAccessPdf":{"url":"","status":null,"license":null,"disclaimer":"Notice: Paper or abstract available at https://arxiv.org/abs/2312.17617, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."},"authors":[{"authorId":"2262514619","name":"Derong Xu"},{"authorId":"2260766940","name":"Wei Chen"},{"authorId":"1765218","name":"Wenjun Peng"},{"authorId":"2260850374","name":"Chao Zhang"},{"authorId":"2277237058","name":"Tong Xu"},{"authorId":"2261673614","name":"Xiangyu Zhao"},{"authorId":"2277462592","name":"Xian Wu"},{"authorId":"2237585282","name":"Yefeng Zheng"},{"authorId":"2265580543","name":"Enhong Chen"}],"abstract":"Information Extraction (IE) aims to extract structural knowledge from plain natural language texts. Recently, generative Large Language Models (LLMs) have demonstrated remarkable capabilities in text understanding and generation. As a result, numerous works have been proposed to integrate LLMs for IE tasks based on a generative paradigm. To conduct a comprehensive systematic review and exploration of LLM efforts for IE tasks, in this study, we survey the most recent advancements in this field. We first present an extensive overview by categorizing these works in terms of various IE subtasks and techniques, and then we empirically analyze the most advanced methods and discover the emerging trend of IE tasks with LLMs. Based on a thorough review conducted, we identify several insights in technique and promising research directions that deserve further exploration in future studies. We maintain a public repository and consistently update related works and resources on GitHub (LLM4IE repository)."}