{"paperId":"2b32f8c25f15344e27d9decbe9f2f15e4946c76f","externalIds":{"ArXiv":"2402.03082","DBLP":"journals/corr/abs-2402-03082","DOI":"10.48550/arXiv.2402.03082","CorpusId":267411887},"title":"Visual Text Meets Low-level Vision: A Comprehensive Survey on Visual Text Processing","openAccessPdf":{"url":"","status":null,"license":null,"disclaimer":"Notice: Paper or abstract available at https://arxiv.org/abs/2402.03082, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."},"authors":[{"authorId":"2282533923","name":"Yan Shu"},{"authorId":"2282543339","name":"Weichao Zeng"},{"authorId":"2282617354","name":"Zhenhang Li"},{"authorId":"2283265859","name":"Fangmin Zhao"},{"authorId":"49454803","name":"Yu ZHOU"}],"abstract":"Visual text, a pivotal element in both document and scene images, speaks volumes and attracts significant attention in the computer vision domain. Beyond visual text detection and recognition, the field of visual text processing has experienced a surge in research, driven by the advent of fundamental generative models. However, challenges persist due to the unique properties and features that distinguish text from general objects. Effectively leveraging these unique textual characteristics is crucial in visual text processing, as observed in our study. In this survey, we present a comprehensive, multi-perspective analysis of recent advancements in this field. Initially, we introduce a hierarchical taxonomy encompassing areas ranging from text image enhancement and restoration to text image manipulation, followed by different learning paradigms. Subsequently, we conduct an in-depth discussion of how specific textual features such as structure, stroke, semantics, style, and spatial context are seamlessly integrated into various tasks. Furthermore, we explore available public datasets and benchmark the reviewed methods on several widely-used datasets. Finally, we identify principal challenges and potential avenues for future research. Our aim is to establish this survey as a fundamental resource, fostering continued exploration and innovation in the dynamic area of visual text processing."}