{"paperId":"963c73762482ed9b5e62abed9db7183420dc9853","externalIds":{"DBLP":"journals/comsur/GuoWZSLTS25","ArXiv":"2405.01221","DOI":"10.1109/COMST.2024.3516819","CorpusId":269502190},"title":"A Survey on Semantic Communication Networks: Architecture, Security, and Privacy","openAccessPdf":{"url":"https://arxiv.org/pdf/2405.01221","status":"GREEN","license":null,"disclaimer":"Notice: Paper or abstract available at https://arxiv.org/abs/2405.01221, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."},"authors":[{"authorId":"2119113349","name":"Shaolong Guo"},{"authorId":"2108901244","name":"Yuntao Wang"},{"authorId":"1471296746","name":"Ning Zhang"},{"authorId":"2242847688","name":"Zhou Su"},{"authorId":"9533837","name":"T. Luan"},{"authorId":"151484195","name":"Zhiyi Tian"},{"authorId":"2267373446","name":"X. Shen"}],"abstract":"With the rapid advancement and deployment of intelligent agents and artificial general intelligence (AGI), a fundamental challenge for future networks is enabling efficient communications among agents. Unlike traditional human-centric, data-driven communication networks, the primary goal of agent-based communication is to facilitate coordination among agents. Therefore, task comprehension and collaboration become the key objectives of communications, rather than data synchronization. Semantic communication (SemCom) aims to align information and knowledge among agents to expedite task comprehension. While significant research has been conducted on SemCom for two-agent systems, the development of semantic communication networks (SemComNet) for multi-agent systems remains largely unexplored. In this paper, we provide a comprehensive and up-to-date survey of SemComNet, focusing on their fundamentals, security, and privacy aspects. We introduce a novel three-layer architecture for multi-agent interaction, comprising the control layer, semantic transmission layer, and cognitive sensing layer. We explore working modes and enabling technologies, and present a taxonomy of security and privacy threats, along with state-of-the-art defense mechanisms. Finally, we outline future research directions, paving the way toward intelligent, robust, and energy-efficient SemComNet. This survey represents the first comprehensive analysis of SemComNet, offering detailed insights into the core principles as well as associated security and privacy challenges."}