{"paperId":"772dcf6c3fdb4c7e9248205c2b6f5d169a53abbd","externalIds":{"DBLP":"journals/tkdd/EkleE24","ArXiv":"2406.00134","DOI":"10.1145/3669906","CorpusId":270126689},"title":"Anomaly Detection in Dynamic Graphs: A Comprehensive Survey","openAccessPdf":{"url":"https://dl.acm.org/doi/pdf/10.1145/3669906","status":"HYBRID","license":"mit","disclaimer":"Notice: Paper or abstract available at https://arxiv.org/abs/2406.00134, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."},"authors":[{"authorId":"2274387869","name":"Ocheme Anthony Ekle"},{"authorId":"2301506558","name":"William Eberle"}],"abstract":"This survey article presents a comprehensive and conceptual overview of anomaly detection (AD) using dynamic graphs. We focus on existing graph-based AD techniques and their applications to dynamic networks. The contributions of this survey article include the following: (i) a comparative study of existing surveys on AD; (ii) a Dynamic Graph-based anomaly detection (DGAD) review framework in which approaches for detecting anomalies in dynamic graphs are grouped based on traditional machine learning models, matrix transformations, probabilistic approaches, and deep learning approaches; (iii) a discussion of graphically representing both discrete and dynamic networks; and (iv) a discussion of the advantages of graph-based techniques for capturing the relational structure and complex interactions in dynamic graph data. Finally, this work identifies the potential challenges and future directions for detecting anomalies in dynamic networks. This DGAD survey approach aims to provide a valuable resource for researchers and practitioners by summarizing the strengths and limitations of each approach, highlighting current research trends, and identifying open challenges. In doing so, it can guide future research efforts and promote advancements in AD in dynamic graphs."}