{"paperId":"8a29eaf87faaf27f712c1bcb4203565d0baeb4a1","externalIds":{"DBLP":"journals/corr/abs-2405-11034","ArXiv":"2405.11034","DOI":"10.48550/arXiv.2405.11034","CorpusId":269921828},"title":"Safety in Graph Machine Learning: Threats and Safeguards","openAccessPdf":{"url":"","status":null,"license":null,"disclaimer":"Notice: Paper or abstract available at https://arxiv.org/abs/2405.11034, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."},"authors":[{"authorId":"2117075272","name":"Song Wang"},{"authorId":"123918726","name":"Yushun Dong"},{"authorId":"2134483590","name":"Binchi Zhang"},{"authorId":"2276579472","name":"Zihan Chen"},{"authorId":"2194727743","name":"Xingbo Fu"},{"authorId":"2302556971","name":"Yinhan He"},{"authorId":"2276579917","name":"Cong Shen"},{"authorId":"2117879943","name":"Chuxu Zhang"},{"authorId":"144539424","name":"N. Chawla"},{"authorId":"1737121128","name":"Jundong Li"}],"abstract":"Graph Machine Learning (Graph ML) has witnessed substantial advancements in recent years. With their remarkable ability to process graph-structured data, Graph ML techniques have been extensively utilized across diverse applications, including critical domains like finance, healthcare, and transportation. Despite their societal benefits, recent research highlights significant safety concerns associated with the widespread use of Graph ML models. Lacking safety-focused designs, these models can produce unreliable predictions, demonstrate poor generalizability, and compromise data confidentiality. In high-stakes scenarios such as financial fraud detection, these vulnerabilities could jeopardize both individuals and society at large. Therefore, it is imperative to prioritize the development of safety-oriented Graph ML models to mitigate these risks and enhance public confidence in their applications. In this survey paper, we explore three critical aspects vital for enhancing safety in Graph ML: reliability, generalizability, and confidentiality. We categorize and analyze threats to each aspect under three headings: model threats, data threats, and attack threats. This novel taxonomy guides our review of effective strategies to protect against these threats. Our systematic review lays a groundwork for future research aimed at developing practical, safety-centered Graph ML models. Furthermore, we highlight the significance of safe Graph ML practices and suggest promising avenues for further investigation in this crucial area."}