{"paperId":"46b36032a090c834112e32918aac6d4513e1ef36","externalIds":{"ArXiv":"2308.02457","DBLP":"journals/corr/abs-2308-02457","DOI":"10.48550/arXiv.2308.02457","CorpusId":260611397},"title":"A Survey on Temporal Knowledge Graph Completion: Taxonomy, Progress, and Prospects","openAccessPdf":{"url":"https://arxiv.org/pdf/2308.02457","status":"CLOSED","license":null,"disclaimer":"Notice: Paper or abstract available at https://arxiv.org/abs/2308.02457, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."},"authors":[{"authorId":"2163833353","name":"Jiapu Wang"},{"authorId":"2692910","name":"Boyue Wang"},{"authorId":"1471335567","name":"M. Qiu"},{"authorId":"2153326034","name":"Shirui Pan"},{"authorId":"2065364720","name":"Bo Xiong"},{"authorId":"2228148905","name":"Heng Liu"},{"authorId":"1382578305","name":"Linhao Luo"},{"authorId":"2145028549","name":"Tengfei Liu"},{"authorId":"2140879677","name":"Yongli Hu"},{"authorId":"1714354","name":"Baocai Yin"},{"authorId":"2153575689","name":"Wen Gao"}],"abstract":"Temporal characteristics are prominently evident in a substantial volume of knowledge, which underscores the pivotal role of Temporal Knowledge Graphs (TKGs) in both academia and industry. However, TKGs often suffer from incompleteness for three main reasons: the continuous emergence of new knowledge, the weakness of the algorithm for extracting structured information from unstructured data, and the lack of information in the source dataset. Thus, the task of Temporal Knowledge Graph Completion (TKGC) has attracted increasing attention, aiming to predict missing items based on the available information. In this paper, we provide a comprehensive review of TKGC methods and their details. Specifically, this paper mainly consists of three components, namely, 1)Background, which covers the preliminaries of TKGC methods, loss functions required for training, as well as the dataset and evaluation protocol; 2)Interpolation, that estimates and predicts the missing elements or set of elements through the relevant available information. It further categorizes related TKGC methods based on how to process temporal information; 3)Extrapolation, which typically focuses on continuous TKGs and predicts future events, and then classifies all extrapolation methods based on the algorithms they utilize. We further pinpoint the challenges and discuss future research directions of TKGC."}