{"paperId":"74b05bba46db21e589a2cc0f916f81069b0368ef","externalIds":{"DBLP":"journals/corr/abs-2305-00955","ArXiv":"2305.00955","DOI":"10.48550/arXiv.2305.00955","CorpusId":258426970},"title":"Bridging the Gap: A Survey on Integrating (Human) Feedback for Natural Language Generation","openAccessPdf":{"url":"http://arxiv.org/pdf/2305.00955","status":"CLOSED","license":null,"disclaimer":"Notice: Paper or abstract available at https://arxiv.org/abs/2305.00955, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."},"authors":[{"authorId":"2058640028","name":"Patrick Fernandes"},{"authorId":"21626987","name":"Aman Madaan"},{"authorId":"1381444447","name":"Emmy Liu"},{"authorId":"1748971692","name":"António Farinhas"},{"authorId":"144869806","name":"Pedro Henrique Martins"},{"authorId":"2138301112","name":"Amanda Bertsch"},{"authorId":"34876539","name":"José G. C. de Souza"},{"authorId":"2149163534","name":"Shuyan Zhou"},{"authorId":"35232494","name":"Tongshuang Sherry Wu"},{"authorId":"1700325","name":"Graham Neubig"},{"authorId":"1400227478","name":"André F. T. Martins"}],"abstract":"Many recent advances in natural language generation have been fueled by training large language models on internet-scale data. However, this paradigm can lead to models that generate toxic, inaccurate, and unhelpful content, and automatic evaluation metrics often fail to identify these behaviors. As models become more capable, human feedback is an invaluable signal for evaluating and improving models. This survey aims to provide an overview of the recent research that has leveraged human feedback to improve natural language generation. First, we introduce an encompassing formalization of feedback, and identify and organize existing research into a taxonomy following this formalization. Next, we discuss how feedback can be described by its format and objective, and cover the two approaches proposed to use feedback (either for training or decoding): directly using the feedback or training feedback models. We also discuss existing datasets for human-feedback data collection, and concerns surrounding feedback collection. Finally, we provide an overview of the nascent field of AI feedback, which exploits large language models to make judgments based on a set of principles and minimize the need for human intervention."}