{"paperId":"db739e4a0d5c05da9c74f9351057bf690612450d","externalIds":{"DBLP":"journals/corr/abs-2207-03444","ArXiv":"2207.03444","DOI":"10.1109/JPROC.2024.3403898","CorpusId":250334542},"title":"Fairness and Bias in Robot Learning","openAccessPdf":{"url":"https://arxiv.org/pdf/2207.03444","status":"GREEN","license":null,"disclaimer":"Notice: Paper or abstract available at https://arxiv.org/abs/2207.03444, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."},"authors":[{"authorId":"2072633704","name":"Laura Londoño"},{"authorId":"2306436839","name":"Juana Valeria Hurtado"},{"authorId":"2175250189","name":"Nora Hertz"},{"authorId":"2126833","name":"Philipp Kellmeyer"},{"authorId":"2093786561","name":"S. Voeneky"},{"authorId":"2131132945","name":"Abhinav Valada"}],"abstract":"Machine learning (ML) has significantly enhanced the abilities of robots, enabling them to perform a wide range of tasks in human environments and adapt to our uncertain real world. Recent works in various ML domains have highlighted the importance of accounting for fairness to ensure that these algorithms do not reproduce human biases and consequently lead to discriminatory outcomes. With robot learning systems increasingly performing more and more tasks in our everyday lives, it is crucial to understand the influence of such biases to prevent unintended behavior toward certain groups of people. In this work, we present the first survey on fairness in robot learning from an interdisciplinary perspective spanning technical, ethical, and legal challenges. We propose a taxonomy for sources of bias and the resulting types of discrimination due to them. Using examples from different robot learning domains, we examine scenarios of unfair outcomes and strategies to mitigate them. We present early advances in the field by covering different fairness definitions, ethical and legal considerations, and methods for fair robot learning. With this work, we aim to pave the road for groundbreaking developments in fair robot learning."}