{"paperId":"d4106eda39d2b55ffb533c6fd5793660ef4e8488","externalIds":{"DBLP":"journals/corr/abs-2206-04415","ArXiv":"2206.04415","DOI":"10.48550/arXiv.2206.04415","CorpusId":249538663},"title":"Deep Meta-learning in Recommendation Systems: A Survey","openAccessPdf":{"url":"https://arxiv.org/pdf/2206.04415","status":"GREEN","license":null,"disclaimer":"Notice: Paper or abstract available at https://arxiv.org/abs/2206.04415, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."},"authors":[{"authorId":"2117977668","name":"Chunyang Wang"},{"authorId":"153514206","name":"Yanmin Zhu"},{"authorId":"2143857288","name":"Haobing Liu"},{"authorId":"1412587564","name":"Tianzi Zang"},{"authorId":"2404977616","name":"Jiadi Yu"},{"authorId":"2058769931","name":"Feilong Tang"}],"abstract":"Deep neural network based recommendation systems have achieved great success as information filtering techniques in recent years. However, since model training from scratch requires sufficient data, deep learning-based recommendation methods still face the bottlenecks of insufficient data and computational inefficiency. Meta-learning, as an emerging paradigm that learns to improve the learning efficiency and generalization ability of algorithms, has shown its strength in tackling the data sparsity issue. Recently, a growing number of studies on deep meta-learning based recommenddation systems have emerged for improving the performance under recommendation scenarios where available data is limited, e.g. user cold-start and item cold-start. Therefore, this survey provides a timely and comprehensive overview of current deep meta-learning based recommendation methods. Specifically, we propose a taxonomy to discuss existing methods according to recommendation scenarios, meta-learning techniques, and meta-knowledge representations, which could provide the design space for meta-learning based recommendation methods. For each recommendation scenario, we further discuss technical details about how existing methods apply meta-learning to improve the generalization ability of recommendation models. Finally, we also point out several limitations in current research and highlight some promising directions for future research in this area."}