{"paperId":"60bd26bdb23ba353e5d79f161542dd074bc8391c","externalIds":{"DBLP":"conf/emnlp/YangPZCPW024","ArXiv":"2310.15654","DOI":"10.48550/arXiv.2310.15654","CorpusId":264439179},"title":"A Survey on Detection of LLMs-Generated Content","openAccessPdf":{"url":"","status":null,"license":null,"disclaimer":"Notice: Paper or abstract available at https://arxiv.org/abs/2310.15654, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."},"authors":[{"authorId":"2145170944","name":"Xianjun Yang"},{"authorId":"2256983134","name":"Liangming Pan"},{"authorId":"150345512","name":"Xuandong Zhao"},{"authorId":"2249915042","name":"Haifeng Chen"},{"authorId":"2253654665","name":"L. Petzold"},{"authorId":"2253904732","name":"William Yang Wang"},{"authorId":"2249879747","name":"Wei Cheng"}],"abstract":"The burgeoning capabilities of advanced large language models (LLMs) such as ChatGPT have led to an increase in synthetic content generation with implications across a variety of sectors, including media, cybersecurity, public discourse, and education. As such, the ability to detect LLMs-generated content has become of paramount importance. We aim to provide a detailed overview of existing detection strategies and benchmarks, scrutinizing their differences and identifying key challenges and prospects in the field, advocating for more adaptable and robust models to enhance detection accuracy. We also posit the necessity for a multi-faceted approach to defend against various attacks to counter the rapidly advancing capabilities of LLMs. To the best of our knowledge, this work is the first comprehensive survey on the detection in the era of LLMs. We hope it will provide a broad understanding of the current landscape of LLMs-generated content detection, offering a guiding reference for researchers and practitioners striving to uphold the integrity of digital information in an era increasingly dominated by synthetic content. The relevant papers are summarized and will be consistently updated at https://github.com/Xianjun-Yang/Awesome_papers_on_LLMs_detection.git."}