{"paperId":"941dd711ef05ca159213bb32ea57c268961252e9","externalIds":{"ArXiv":"2302.03525","DBLP":"journals/corr/abs-2302-03525","DOI":"10.48550/arXiv.2302.03525","CorpusId":256627449},"title":"Multi-Task Deep Recommender Systems: A Survey","openAccessPdf":{"url":"http://arxiv.org/pdf/2302.03525","status":"CLOSED","license":null,"disclaimer":"Notice: Paper or abstract available at https://arxiv.org/abs/2302.03525, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."},"authors":[{"authorId":"2185248657","name":"Yuhao Wang"},{"authorId":"3222510","name":"Ha T. Lam"},{"authorId":"2150070704","name":"Y. Wong"},{"authorId":"2204700561","name":"Ziru Liu"},{"authorId":"2116711312","name":"Xiang Zhao"},{"authorId":"2116640929","name":"Yichao Wang"},{"authorId":"92633145","name":"Bo Chen"},{"authorId":"3339005","name":"Huifeng Guo"},{"authorId":"2824766","name":"Ruiming Tang"}],"abstract":"Multi-task learning (MTL) aims at learning related tasks in a unified model to achieve mutual improvement among tasks considering their shared knowledge. It is an important topic in recommendation due to the demand for multi-task prediction considering performance and efficiency. Although MTL has been well studied and developed, there is still a lack of systematic review in the recommendation community. To fill the gap, we provide a comprehensive review of existing multi-task deep recommender systems (MTDRS) in this survey. To be specific, the problem definition of MTDRS is first given, and it is compared with other related areas. Next, the development of MTDRS is depicted and the taxonomy is introduced from the task relation and methodology aspects. Specifically, the task relation is categorized into parallel, cascaded, and auxiliary with main, while the methodology is grouped into parameter sharing, optimization, and training mechanism. The survey concludes by summarizing the application and public datasets of MTDRS and highlighting the challenges and future directions of the field."}