{"paperId":"d4f5c6b4ffc60ae04289a40fb0dcce136a122511","externalIds":{"DBLP":"journals/csur/PlaatWVBSB26","ArXiv":"2407.11511","DOI":"10.1145/3774896","CorpusId":271218853},"title":"Multi-Step Reasoning with Large Language Models, a Survey","openAccessPdf":{"url":"","status":null,"license":null,"disclaimer":"Notice: Paper or abstract available at https://arxiv.org/abs/2407.11511, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."},"authors":[{"authorId":"2562595","name":"A. Plaat"},{"authorId":"2117067803","name":"Annie Wong"},{"authorId":"1702730","name":"Suzan Verberne"},{"authorId":"2189563094","name":"Joost Broekens"},{"authorId":"2226014049","name":"Niki van Stein"},{"authorId":"2308017735","name":"T. Bäck"}],"abstract":"Large language models (LLMs) with billions of parameters exhibit in-context learning abilities, enabling few-shot learning on tasks that the model was not specifically trained for. Traditional models achieve breakthrough performance on language tasks, but do not perform well on basic reasoning benchmarks. However, a new in-context learning approach, Chain-of-thought, has demonstrated strong multi-step reasoning abilities on these benchmarks. The research on LLM reasoning abilities started with the question whether LLMs can solve grade school math word problems, and has expanded to other tasks in the past few years. This article reviews the field of multi-step reasoning with LLMs. We propose a taxonomy that identifies different ways to generate, evaluate, and control multi-step reasoning. We provide an in-depth coverage of core approaches and open problems, and we propose a research agenda for the near future. We find that multi-step reasoning approaches have progressed beyond math word problems, and can now successfully solve challenges in logic, combinatorial games, and robotics, sometimes by first generating code that is then executed by external tools. Many studies in multi-step methods use reinforcement learning for finetuning, external optimization loops, in-context reinforcement learning, and self-reflection."}