{"paperId":"23391745a65e9c677e712a4e0f594565ee5aadf1","externalIds":{"ArXiv":"2211.12875","CorpusId":261682075},"title":"A Survey of Deep Graph Clustering: Taxonomy, Challenge, Application, and Open Resource","openAccessPdf":{"url":"","status":null,"license":null,"disclaimer":"Notice: Paper or abstract available at https://arxiv.org/abs/2211.12875, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."},"authors":[{"authorId":"100576986","name":"Yue Liu"},{"authorId":"2239016316","name":"Jun Xia"},{"authorId":"2516087","name":"Sihang Zhou"},{"authorId":"2154476091","name":"Xihong Yang"},{"authorId":"2024445866","name":"K. Liang"},{"authorId":"2239052392","name":"Chenchen Fan"},{"authorId":"2238980002","name":"Zhuang Yan"},{"authorId":"2253952904","name":"Stan Z. Li"},{"authorId":"2130021053","name":"Xinwang Liu"},{"authorId":"2238954265","name":"Kunlun He"}],"abstract":"Graph clustering, which aims to divide nodes in the graph into several distinct clusters, is a fundamental yet challenging task. Benefiting from the powerful representation capability of deep learning, deep graph clustering methods have achieved great success in recent years. However, the corresponding survey paper is relatively scarce, and it is imminent to make a summary of this field. From this motivation, we conduct a comprehensive survey of deep graph clustering. Firstly, we introduce formulaic definition, evaluation, and development in this field. Secondly, the taxonomy of deep graph clustering methods is presented based on four different criteria, including graph type, network architecture, learning paradigm, and clustering method. Thirdly, we carefully analyze the existing methods via extensive experiments and summarize the challenges and opportunities from five perspectives, including graph data quality, stability, scalability, discriminative capability, and unknown cluster number. Besides, the applications of deep graph clustering methods in six domains, including computer vision, natural language processing, recommendation systems, social network analyses, bioinformatics, and medical science, are presented. Last but not least, this paper provides open resource supports, including 1) a collection (\\url{https://github.com/yueliu1999/Awesome-Deep-Graph-Clustering}) of state-of-the-art deep graph clustering methods (papers, codes, and datasets) and 2) a unified framework (\\url{https://github.com/Marigoldwu/A-Unified-Framework-for-Deep-Attribute-Graph-Clustering}) of deep graph clustering. We hope this work can serve as a quick guide and help researchers overcome challenges in this vibrant field."}