{"paperId":"ec4c8e2fad2456b4303c2ba98f0407a5554d9f4c","externalIds":{"DBLP":"journals/corr/abs-2408-04879","ArXiv":"2408.04879","DOI":"10.48550/arXiv.2408.04879","CorpusId":271843327},"title":"On the Element-Wise Representation and Reasoning in Zero-Shot Image Recognition: A Systematic Survey","openAccessPdf":{"url":"","status":null,"license":null,"disclaimer":"Notice: Paper or abstract available at https://arxiv.org/abs/2408.04879, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."},"authors":[{"authorId":"2157959709","name":"Jingcai Guo"},{"authorId":"2268393647","name":"Zhijie Rao"},{"authorId":"2315888937","name":"Zhi Chen"},{"authorId":"2184352472","name":"Song Guo"},{"authorId":"2278474382","name":"Jingren Zhou"},{"authorId":"2281943279","name":"Dacheng Tao"}],"abstract":"Zero-shot image recognition (ZSIR) aims to recognize and reason in unseen domains by learning generalized knowledge from limited data in the seen domain. The gist of ZSIR is constructing a well-aligned mapping between the input visual space and the target semantic space, which is a bottom-up paradigm inspired by the process by which humans observe the world. In recent years, ZSIR has witnessed significant progress on a broad spectrum, from theory to algorithm design, as well as widespread applications. However, to the best of our knowledge, there remains a lack of a systematic review of ZSIR from an element-wise perspective, i.e., learning fine-grained elements of data and their inferential associations. To fill the gap, this paper thoroughly investigates recent advances in element-wise ZSIR and provides a sound basis for its future development. Concretely, we first integrate three basic ZSIR tasks, i.e., object recognition, compositional recognition, and foundation model-based open-world recognition, into a unified element-wise paradigm and provide a detailed taxonomy and analysis of the main approaches. Next, we summarize the benchmarks, covering technical implementations, standardized datasets, and some more details as a library. Last, we sketch out related applications, discuss vital challenges, and suggest potential future directions."}