{"paperId":"ac0270e7af0b2b013156c888050be082c673c3cf","externalIds":{"DBLP":"journals/corr/abs-2403-06456","ArXiv":"2403.06456","DOI":"10.1145/3768575","CorpusId":268352508},"title":"A Survey of Learned Indexes for the Multi-dimensional Space","openAccessPdf":{"url":"","status":null,"license":null,"disclaimer":"Notice: Paper or abstract available at https://arxiv.org/abs/2403.06456, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."},"authors":[{"authorId":"2290837957","name":"Abdullah Al-Mamun"},{"authorId":"2290859188","name":"Hao Wu"},{"authorId":"2290866963","name":"Qiyang He"},{"authorId":"2155481570","name":"Jianguo Wang"},{"authorId":"1709661","name":"Walid G. Aref"}],"abstract":"A recent research trend involves treating database index structures as Machine Learning (ML) models. In this domain, single or multiple ML models are trained to learn the mapping from keys to positions inside a dataset. This class of indexes is known as “Learned Indexes.” Learned indexes have demonstrated improved search performance and reduced space requirements for one-dimensional data. The concept of one-dimensional learned indexes has naturally been extended to multi-dimensional (e.g., spatial) data, leading to the development of “Learned Multi-dimensional Indexes.” This survey presents a taxonomy that classifies and categorizes both learned one- and multi-dimensional indexes, and surveys the existing literature on learned indexes according to this taxonomy with an emphasis on learned multi-dimensional index structures. Specifically, it reviews the current state of this research area, explains the core concepts behind each proposed method, and classifies these methods based on several well-defined criteria. Additionally, we present a timeline to illustrate the evolution of research on learned indexes. Finally, we highlight several open challenges and future research directions in this emerging and highly active field."}