{"paperId":"53d3ba86d88ee1f02cb316775a8d6243677e153b","externalIds":{"DBLP":"journals/corr/abs-2307-09099","ArXiv":"2307.09099","DOI":"10.48550/arXiv.2307.09099","CorpusId":259951144},"title":"A Survey on Multi-Objective Neural Architecture Search","openAccessPdf":{"url":"https://arxiv.org/pdf/2307.09099","status":"CLOSED","license":null,"disclaimer":"Notice: Paper or abstract available at https://arxiv.org/abs/2307.09099, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."},"authors":[{"authorId":"1405663268","name":"Seyed Mahdi Shariatzadeh"},{"authorId":"144664641","name":"M. Fathy"},{"authorId":"1982877","name":"R. Berangi"},{"authorId":"2172221","name":"M. Shahverdy"}],"abstract":"Recently, the expert-crafted neural architectures is increasing overtaken by the utilization of neural architecture search (NAS) and automatic generation (and tuning) of network structures which has a close relation to the Hyperparameter Optimization and Auto Machine Learning (AutoML). After the earlier NAS attempts to optimize only the prediction accuracy, Multi-Objective Neural architecture Search (MONAS) has been attracting attentions which considers more goals such as computational complexity, power consumption, and size of the network for optimization, reaching a trade-off between the accuracy and other features like the computational cost. In this paper, we present an overview of principal and state-of-the-art works in the field of MONAS. Starting from a well-categorized taxonomy and formulation for the NAS, we address and correct some miscategorizations in previous surveys of the NAS field. We also provide a list of all known objectives used and add a number of new ones and elaborate their specifications. We have provides analyses about the most important objectives and shown that the stochastic properties of some the them should be differed from deterministic ones in the multi-objective optimization procedure of NAS. We finalize this paper with a number of future directions and topics in the field of MONAS."}