{"paperId":"a67a6d566bea9cce5824feccf14aaa87581e3871","externalIds":{"DBLP":"journals/eaai/CorreiaGKBK24","ArXiv":"2408.03747","DOI":"10.1016/j.engappai.2024.109323","CorpusId":271745256},"title":"Online Model-based Anomaly Detection in Multivariate Time Series: Taxonomy, Survey, Research Challenges and Future Directions","openAccessPdf":{"url":"https://doi.org/10.1016/j.engappai.2024.109323","status":"HYBRID","license":"CCBY","disclaimer":"Notice: Paper or abstract available at https://arxiv.org/abs/2408.03747, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."},"authors":[{"authorId":"2237990998","name":"Lucas Correia"},{"authorId":"2204009115","name":"Jan-Christoph Goos"},{"authorId":"2237990741","name":"Philipp Klein"},{"authorId":"2237990304","name":"Thomas H. W. Back"},{"authorId":"3160375","name":"Anna V. Kononova"}],"abstract":"Time-series anomaly detection plays an important role in engineering processes, like development, manufacturing and other operations involving dynamic systems. These processes can greatly benefit from advances in the field, as state-of-the-art approaches may aid in cases involving, for example, highly dimensional data. To provide the reader with understanding of the terminology, this survey introduces a novel taxonomy where a distinction between online and offline, and training and inference is made. Additionally, it presents the most popular data sets and evaluation metrics used in the literature, as well as a detailed analysis. Furthermore, this survey provides an extensive overview of the state-of-the-art model-based online semi- and unsupervised anomaly detection approaches for multivariate time-series data, categorising them into different model families and other properties. The biggest research challenge revolves around benchmarking, as currently there is no reliable way to compare different approaches against one another. This problem is two-fold: on the one hand, public data sets suffers from at least one fundamental flaw, while on the other hand, there is a lack of intuitive and representative evaluation metrics in the field. Moreover, the way most publications choose a detection threshold disregards real-world conditions, which hinders the application in the real world. To allow for tangible advances in the field, these issues must be addressed in future work."}