{"paperId":"09775ebd590d851e373219f14d5a3ef755a20aa9","externalIds":{"ArXiv":"2402.03017","CorpusId":267413098},"title":"A Complete Survey on Contemporary Methods, Emerging Paradigms and Hybrid Approaches for Few-Shot Learning","openAccessPdf":{"url":"","status":null,"license":null,"disclaimer":"Notice: Paper or abstract available at https://arxiv.org/abs/2402.03017, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."},"authors":[{"authorId":"2282540866","name":"Georgios Tsoumplekas"},{"authorId":"2028615824","name":"Vladislav Li"},{"authorId":"2248514455","name":"Vasileios Argyriou"},{"authorId":"46231049","name":"Anastasios Lytos"},{"authorId":"2173108675","name":"Eleftherios Fountoukidis"},{"authorId":"144461881","name":"Sotirios K Goudos"},{"authorId":"2244377626","name":"Ioannis D. Moscholios"},{"authorId":"1802117","name":"Panagiotis G. Sarigiannidis"}],"abstract":"Despite the widespread success of deep learning, its intense requirements for vast amounts of data and extensive training make it impractical for various real-world applications where data is scarce. In recent years, Few-Shot Learning (FSL) has emerged as a learning paradigm that aims to address these limitations by leveraging prior knowledge to enable rapid adaptation to novel learning tasks. Due to its properties that highly complement deep learning's data-intensive needs, FSL has seen significant growth in the past few years. This survey provides a comprehensive overview of both well-established methods as well as recent advancements in the FSL field. The presented taxonomy extends previously proposed ones by incorporating emerging FSL paradigms, such as in-context learning, along with novel categories within the meta-learning paradigm for FSL, including neural processes and probabilistic meta-learning. Furthermore, a holistic overview of FSL is provided by discussing hybrid FSL approaches that extend FSL beyond the typically examined supervised learning setting. The survey also explores FSL's diverse applications across various domains. Finally, recent trends shaping the field, outstanding challenges, and promising future research directions are discussed."}