{"paperId":"b190697d8106a555f525acec33c6a91c67b88483","externalIds":{"ArXiv":"2402.12715","CorpusId":267759715},"title":"The Clever Hans Mirage: A Comprehensive Survey on Spurious Correlations in Machine Learning","openAccessPdf":{"url":"","status":null,"license":null,"disclaimer":"Notice: Paper or abstract available at https://arxiv.org/abs/2402.12715, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."},"authors":[{"authorId":"122298411","name":"Wenqian Ye"},{"authorId":"3383040","name":"Guangtao Zheng"},{"authorId":"2258143637","name":"Xu Cao"},{"authorId":"2109267955","name":"Yunsheng Ma"},{"authorId":"2284823814","name":"Xia Hu"},{"authorId":"2260013753","name":"Aidong Zhang"}],"abstract":"Back in the early 20th century, a horse named Hans appeared to perform arithmetic and other intellectual tasks during exhibitions in Germany, while it actually relied solely on involuntary cues in the body language from the human trainer. Modern machine learning models are no different. These models are known to be sensitive to spurious correlations between non-essential features of the inputs (e.g., background, texture, and secondary objects) and the corresponding labels. Such features and their correlations with the labels are known as\"spurious\"because they tend to change with shifts in real-world data distributions, which can negatively impact the model's generalization and robustness. In this paper, we provide a comprehensive survey of this emerging issue, along with a fine-grained taxonomy of existing state-of-the-art methods for addressing spurious correlations in machine learning models. Additionally, we summarize existing datasets, benchmarks, and metrics to facilitate future research. The paper concludes with a discussion of the broader impacts, the recent advancements, and future challenges in the era of generative AI, aiming to provide valuable insights for researchers in the related domains of the machine learning community."}