{"paperId":"301b07ecba0864c5bad4039d6a0bc93687417443","externalIds":{"ArXiv":"2303.11666","PubMedCentral":"10901840","DBLP":"journals/corr/abs-2303-11666","DOI":"10.1016/j.xinn.2024.100590","CorpusId":257637133,"PubMed":"38426201"},"title":"A survey on causal inference for recommendation","openAccessPdf":{"url":"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC10901840","status":"GREEN","license":"CCBYNCND","disclaimer":"Notice: Paper or abstract available at https://arxiv.org/abs/2303.11666, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."},"authors":[{"authorId":"2212050339","name":"Huishi Luo"},{"authorId":"2162961864","name":"Fuzhen Zhuang"},{"authorId":"3360722","name":"Ruobing Xie"},{"authorId":"1968806","name":"Hengshu Zhu"},{"authorId":"2145351849","name":"Deqing Wang"}],"abstract":"Causal inference has recently garnered significant interest among recommender system (RS) researchers due to its ability to dissect cause-and-effect relationships and its broad applicability across multiple fields. It offers a framework to model the causality in RSs such as confounding effects and deal with counterfactual problems such as offline policy evaluation and data augmentation. Although there are already some valuable surveys on causal recommendations, they typically classify approaches based on the practical issues faced in RS, a classification that may disperse and fragment the unified causal theories. Considering RS researchers' unfamiliarity with causality, it is necessary yet challenging to comprehensively review relevant studies from a coherent causal theoretical perspective, thereby facilitating a deeper integration of causal inference in RS. This survey provides a systematic review of up-to-date papers in this area from a causal theory standpoint and traces the evolutionary development of RS methods within the same causal strategy. First, we introduce the fundamental concepts of causal inference as the basis of the following review. Subsequently, we propose a novel theory-driven taxonomy, categorizing existing methods based on the causal theory employed, namely those based on the potential outcome framework, the structural causal model, and general counterfactuals. The review then delves into the technical details of how existing methods apply causal inference to address particular recommender issues. Finally, we highlight some promising directions for future research in this field. Representative papers and open-source resources will be progressively available at https://github.com/Chrissie-Law/Causal-Inference-for-Recommendation."}