{"paperId":"027ac1dad95fa9f42c5e9d00a4de31214f437604","externalIds":{"ArXiv":"2407.01599","DBLP":"journals/corr/abs-2407-01599","DOI":"10.48550/arXiv.2407.01599","CorpusId":270878471},"title":"JailbreakZoo: Survey, Landscapes, and Horizons in Jailbreaking Large Language and Vision-Language Models","openAccessPdf":{"url":"","status":null,"license":null,"disclaimer":"Notice: Paper or abstract available at https://arxiv.org/abs/2407.01599, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."},"authors":[{"authorId":"2304364004","name":"Haibo Jin"},{"authorId":"2176954541","name":"Leyang Hu"},{"authorId":"2309267051","name":"Xinuo Li"},{"authorId":"2268429760","name":"Peiyan Zhang"},{"authorId":"2171675704","name":"Chonghan Chen"},{"authorId":"2305613890","name":"Jun Zhuang"},{"authorId":"2256769308","name":"Haohan Wang"}],"abstract":"The rapid evolution of artificial intelligence (AI) through developments in Large Language Models (LLMs) and Vision-Language Models (VLMs) has brought significant advancements across various technological domains. While these models enhance capabilities in natural language processing and visual interactive tasks, their growing adoption raises critical concerns regarding security and ethical alignment. This survey provides an extensive review of the emerging field of jailbreaking--deliberately circumventing the ethical and operational boundaries of LLMs and VLMs--and the consequent development of defense mechanisms. Our study categorizes jailbreaks into seven distinct types and elaborates on defense strategies that address these vulnerabilities. Through this comprehensive examination, we identify research gaps and propose directions for future studies to enhance the security frameworks of LLMs and VLMs. Our findings underscore the necessity for a unified perspective that integrates both jailbreak strategies and defensive solutions to foster a robust, secure, and reliable environment for the next generation of language models. More details can be found on our website: https://chonghan-chen.com/llm-jailbreak-zoo-survey/."}