{"paperId":"6ebc3414e9ef9284b6b41980d18a2711c84891c4","externalIds":{"DBLP":"journals/corr/abs-2311-06922","ArXiv":"2311.06922","DOI":"10.1177/02783649241230562","CorpusId":265149572},"title":"A survey on socially aware robot navigation: Taxonomy and future challenges","openAccessPdf":{"url":"https://publications.aston.ac.uk/id/eprint/46055/1/Singamaneni_et_al_AAM_2311.06922_Survey_on_Socially_Aware_Robot_Navigation_taxonomy_and_future_challenges.pdf","status":"GREEN","license":null,"disclaimer":"Notice: Paper or abstract available at https://arxiv.org/abs/2311.06922, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."},"authors":[{"authorId":"101099752","name":"P. Singamaneni"},{"authorId":"1500527586","name":"P. Bachiller-Burgos"},{"authorId":"2266391206","name":"Luis J. Manso"},{"authorId":"1808514","name":"A. Garrell"},{"authorId":"2244290748","name":"Alberto Sanfeliu"},{"authorId":"1710743","name":"A. Spalanzani"},{"authorId":"2242188631","name":"Rachid Alami"}],"abstract":"Socially aware robot navigation is gaining popularity with the increase in delivery and assistive robots. The research is further fueled by a need for socially aware navigation skills in autonomous vehicles to move safely and appropriately in spaces shared with humans. Although most of these are ground robots, drones are also entering the field. In this paper, we present a literature survey of the works on socially aware robot navigation in the past 10 years. We propose four different faceted taxonomies to navigate the literature and examine the field from four different perspectives. Through the taxonomic review, we discuss the current research directions and the extending scope of applications in various domains. Further, we put forward a list of current research opportunities and present a discussion on possible future challenges that are likely to emerge in the field."}