{"paperId":"28c6ac721f54544162865f41c5692e70d61bccab","externalIds":{"DBLP":"journals/fcsc/WangMFZYZCTCLZWW24","ArXiv":"2308.11432","DOI":"10.1007/s11704-024-40231-1","CorpusId":261064713},"title":"A survey on large language model based autonomous agents","openAccessPdf":{"url":"https://doi.org/10.1007/s11704-024-40231-1","status":"HYBRID","license":"CCBY","disclaimer":"Notice: Paper or abstract available at https://arxiv.org/abs/2308.11432, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."},"authors":[{"authorId":"2152509786","name":"Lei Wang"},{"authorId":"33754380","name":"Chengbang Ma"},{"authorId":"2163940136","name":"Xueyang Feng"},{"authorId":"2223760889","name":"Zeyu Zhang"},{"authorId":"11325431","name":"Hao-ran Yang"},{"authorId":"2144163813","name":"Jingsen Zhang"},{"authorId":"2128141801","name":"Zhi-Yang Chen"},{"authorId":"144010962","name":"Jiakai Tang"},{"authorId":"2144230136","name":"Xu Chen"},{"authorId":"2149202150","name":"Yankai Lin"},{"authorId":"2542603","name":"Wayne Xin Zhao"},{"authorId":"12457830","name":"Zhewei Wei"},{"authorId":"153693432","name":"Ji-rong Wen"}],"abstract":"Autonomous agents have long been a research focus in academic and industry communities. Previous research often focuses on training agents with limited knowledge within isolated environments, which diverges significantly from human learning processes, and makes the agents hard to achieve human-like decisions. Recently, through the acquisition of vast amounts of Web knowledge, large language models (LLMs) have shown potential in human-level intelligence, leading to a surge in research on LLM-based autonomous agents. In this paper, we present a comprehensive survey of these studies, delivering a systematic review of LLM-based autonomous agents from a holistic perspective. We first discuss the construction of LLM-based autonomous agents, proposing a unified framework that encompasses much of previous work. Then, we present a overview of the diverse applications of LLM-based autonomous agents in social science, natural science, and engineering. Finally, we delve into the evaluation strategies commonly used for LLM-based autonomous agents. Based on the previous studies, we also present several challenges and future directions in this field."}