{"paperId":"cc71261d05467495e7d34007ebbf8fe8b665647b","externalIds":{"ArXiv":"2306.14106","DBLP":"journals/corr/abs-2306-14106","DOI":"10.48550/arXiv.2306.14106","CorpusId":259251731},"title":"Semi-supervised Object Detection: A Survey on Recent Research and Progress","openAccessPdf":{"url":"http://arxiv.org/pdf/2306.14106","status":"CLOSED","license":null,"disclaimer":"Notice: Paper or abstract available at https://arxiv.org/abs/2306.14106, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."},"authors":[{"authorId":"2144873730","name":"Yanyang Wang"},{"authorId":"2565547","name":"Zhaoxiang Liu"},{"authorId":"143763659","name":"Shiguo Lian"}],"abstract":"In recent years, deep learning technology has been maturely applied in the field of object detection, and most algorithms tend to be supervised learning. However, a large amount of labeled data requires high costs of human resources, which brings about low efficiency and limitations. Semi-supervised object detection (SSOD) has been paid more and more attentions due to its high research value and practicability. It is designed to learn information by using small amounts of labeled data and large amounts of unlabeled data. In this paper, we present a comprehensive and up-to-date survey on the SSOD approaches from five aspects. We first briefly introduce several ways of data augmentation. Then, we dive the mainstream semi-supervised strategies into pseudo labels, consistent regularization, graph based and transfer learning based methods, and introduce some methods in challenging settings. We further present widely-used loss functions, and then we outline the common benchmark datasets and compare the accuracy among different representative approaches. Finally, we conclude this paper and present some promising research directions for the future. Our survey aims to provide researchers and practitioners new to the field as well as more advanced readers with a solid understanding of the main approaches developed over the past few years."}