{"paperId":"70ba95384664ab7becfd8196d20a46fe66112c91","externalIds":{"DBLP":"journals/ijcv/LiRJLWZWC25","ArXiv":"2308.09388","DOI":"10.1007/s11263-025-02570-9","CorpusId":261031011},"title":"Diffusion Models for Image Restoration and Enhancement: A Comprehensive Survey","openAccessPdf":{"url":"","status":null,"license":null,"disclaimer":"Notice: Paper or abstract available at https://arxiv.org/abs/2308.09388, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."},"authors":[{"authorId":"2232705096","name":"Xin Li"},{"authorId":"2232648762","name":"Yulin Ren"},{"authorId":"2149170492","name":"Xin Jin"},{"authorId":"40093162","name":"Cuiling Lan"},{"authorId":"2144803892","name":"X. Wang"},{"authorId":"1634494276","name":"Wenjun Zeng"},{"authorId":"48631088","name":"Xinchao Wang"},{"authorId":"31482866","name":"Zhibo Chen"}],"abstract":"Image restoration (IR) has been an indispensable and challenging task in the low-level vision field, which strives to improve the subjective quality of images distorted by various forms of degradation. Recently, the diffusion model has achieved significant advancements in the visual generation of AIGC, thereby raising an intuitive question, “whether the diffusion model can boost image restoration\". To answer this, some pioneering studies attempt to integrate diffusion models into the image restoration task, resulting in superior performances than previous GAN-based methods. Despite that, a comprehensive and enlightening survey on diffusion model-based image restoration remains scarce. In this paper, we are the first to present a comprehensive review of recent diffusion model-based methods on image restoration, encompassing the learning paradigm, conditional strategy, framework design, modeling strategy, and evaluation. Concretely, we first introduce the background of the diffusion model briefly and then present two prevalent workflows that exploit diffusion models in image restoration. Subsequently, we classify and emphasize the innovative designs using diffusion models for both IR and blind/real-world IR, intending to inspire future development. To evaluate existing methods thoroughly, we summarize the commonly used dataset, implementation details, and evaluation metrics. Additionally, we present the objective comparison for open-sourced methods across three tasks, including image super-resolution, deblurring, and inpainting. Ultimately, informed by the limitations in existing works, we propose nine potential and challenging directions for the future research of diffusion model-based IR, including sampling efficiency, model compression, distortion simulation and estimation, distortion invariant learning, and framework design. The repository is released at https://github.com/lixinustc/Awesome-diffusion-model-for-image-processing/"}