{"paperId":"c45754dd5abad1e421b48b8c59baefb53f17e288","externalIds":{"ArXiv":"2407.20181","DBLP":"journals/sigkdd/GerenBDAZ24","DOI":"10.1145/3715073.3715075","CorpusId":271534214},"title":"Blockchain for Large Language Model Security and Safety: A Holistic Survey","openAccessPdf":{"url":"http://arxiv.org/pdf/2407.20181","status":"GREEN","license":null,"disclaimer":"Notice: Paper or abstract available at https://arxiv.org/abs/2407.20181, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."},"authors":[{"authorId":"2313645862","name":"Caleb Geren"},{"authorId":"2313643448","name":"Amanda Board"},{"authorId":"21751647","name":"Gaby G. Dagher"},{"authorId":"2242923729","name":"Tim Andersen"},{"authorId":"2313639774","name":"Jun Zhuang"}],"abstract":"With the growing development and deployment of large language models (LLMs) in both industrial and academic fields, their security and safety concerns have become increasingly critical. However, recent studies indicate that LLMs face numerous vulnerabilities, including data poisoning, prompt injections, and unauthorized data exposure, which conventional methods have struggled to address fully. In parallel, blockchain technology, known for its data immutability and decentralized structure, offers a promising foundation for safeguarding LLMs. In this survey, we aim to comprehensively assess how to leverage blockchain technology to enhance LLMs' security and safety. Besides, we propose a new taxonomy of blockchain for large language models (BC4LLMs) to systematically categorize related works in this emerging field. Our analysis includes novel frameworks and definitions to delineate security and safety in the context of BC4LLMs, highlighting potential research directions and challenges at this intersection.Through this study, we aim to stimulate targeted advancements in blockchain-integrated LLM security."}