{"paperId":"e467ad57b7872a48b5210af756f5260dad8a5ab4","externalIds":{"ArXiv":"2210.04505","DBLP":"journals/corr/abs-2210-04505","DOI":"10.48550/arXiv.2210.04505","CorpusId":252780731},"title":"A Survey on Heterogeneous Federated Learning","openAccessPdf":{"url":"http://arxiv.org/pdf/2210.04505","status":"GREEN","license":null,"disclaimer":"Notice: Paper or abstract available at https://arxiv.org/abs/2210.04505, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."},"authors":[{"authorId":"2082157791","name":"Dashan Gao"},{"authorId":"2115586803","name":"Xin Yao"},{"authorId":"144286907","name":"Qian Yang"}],"abstract":"Federated learning (FL) has been proposed to protect data privacy and virtually assemble the isolated data silos by cooperatively training models among organizations without breaching privacy and security. However, FL faces heterogeneity from various aspects, including data space, statistical, and system heterogeneity. For example, collaborative organizations without conflict of interest often come from different areas and have heterogeneous data from different feature spaces. Participants may also want to train heterogeneous personalized local models due to non-IID and imbalanced data distribution and various resource-constrained devices. Therefore, heterogeneous FL is proposed to address the problem of heterogeneity in FL. In this survey, we comprehensively investigate the domain of heterogeneous FL in terms of data space, statistical, system, and model heterogeneity. We first give an overview of FL, including its definition and categorization. Then, We propose a precise taxonomy of heterogeneous FL settings for each type of heterogeneity according to the problem setting and learning objective. We also investigate the transfer learning methodologies to tackle the heterogeneity in FL. We further present the applications of heterogeneous FL. Finally, we highlight the challenges and opportunities and envision promising future research directions toward new framework design and trustworthy approaches."}