{"paperId":"2c7bee70ce519330953ca29742230bda626faaca","externalIds":{"DBLP":"journals/corr/abs-2309-09727","ArXiv":"2309.09727","DOI":"10.48550/arXiv.2309.09727","CorpusId":262044956},"title":"When Large Language Models Meet Citation: A Survey","openAccessPdf":{"url":"https://arxiv.org/pdf/2309.09727","status":"CLOSED","license":null,"disclaimer":"Notice: Paper or abstract available at https://arxiv.org/abs/2309.09727, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."},"authors":[{"authorId":"2145956344","name":"Yang Zhang"},{"authorId":"46395829","name":"Yufei Wang"},{"authorId":"2284725308","name":"Kai Wang"},{"authorId":"1713128","name":"Quan Z. Sheng"},{"authorId":"2115514578","name":"Lina Yao"},{"authorId":"143945626","name":"A. Mahmood"},{"authorId":"1390725100","name":"Wei Emma Zhang"},{"authorId":"2052934","name":"Rongying Zhao"}],"abstract":"Citations in scholarly work serve the essential purpose of acknowledging and crediting the original sources of knowledge that have been incorporated or referenced. Depending on their surrounding textual context, these citations are used for different motivations and purposes. Large Language Models (LLMs) could be helpful in capturing these fine-grained citation information via the corresponding textual context, thereby enabling a better understanding towards the literature. Furthermore, these citations also establish connections among scientific papers, providing high-quality inter-document relationships and human-constructed knowledge. Such information could be incorporated into LLMs pre-training and improve the text representation in LLMs. Therefore, in this paper, we offer a preliminary review of the mutually beneficial relationship between LLMs and citation analysis. Specifically, we review the application of LLMs for in-text citation analysis tasks, including citation classification, citation-based summarization, and citation recommendation. We then summarize the research pertinent to leveraging citation linkage knowledge to improve text representations of LLMs via citation prediction, network structure information, and inter-document relationship. We finally provide an overview of these contemporary methods and put forth potential promising avenues in combining LLMs and citation analysis for further investigation."}