{"paperId":"d00735241af700d21762d2f3ca00d920241a15a4","externalIds":{"DBLP":"journals/corr/abs-2309-01219","ArXiv":"2309.01219","DOI":"10.1162/coli.a.16","CorpusId":261530162},"title":"Siren's Song in the AI Ocean: A Survey on Hallucination in Large Language Models","openAccessPdf":{"url":"","status":null,"license":null,"disclaimer":"Notice: Paper or abstract available at https://arxiv.org/abs/2309.01219, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."},"authors":[{"authorId":"1895977079","name":"Yue Zhang"},{"authorId":"2110450452","name":"Yafu Li"},{"authorId":"152496687","name":"Leyang Cui"},{"authorId":"1724421","name":"Deng Cai"},{"authorId":"2978364","name":"Lemao Liu"},{"authorId":"2156525869","name":"Tingchen Fu"},{"authorId":"14799547","name":"Xinting Huang"},{"authorId":"2065703096","name":"Enbo Zhao"},{"authorId":"2257439415","name":"Yu Zhang"},{"authorId":"2109404730","name":"Yulong Chen"},{"authorId":"1800190","name":"Longyue Wang"},{"authorId":"1755919","name":"A. Luu"},{"authorId":"2237804371","name":"Wei Bi"},{"authorId":"8815141","name":"Freda Shi"},{"authorId":"34720053","name":"Shuming Shi"}],"abstract":"\n While large language models (LLMs) have demonstrated remarkable capabilities across a range of downstream tasks, a significant concern revolves around their propensity to exhibit hallucinations: LLMs occasionally generate content that diverges from the user input, contradicts previously generated context, or misaligns with established world knowledge. This phenomenon poses a substantial challenge to the reliability of LLMs in real-world scenarios. In this paper, we survey recent efforts on the detection, explanation, and mitigation of hallucination, with an emphasis on the unique challenges posed by LLMs. We present taxonomies of the LLM hallucination phenomena and evaluation benchmarks, analyze existing approaches aiming at mitigating LLM hallucination, and discuss potential directions for future research."}