{"paperId":"7fbf028793a5252941e358366f57837888fcbf11","externalIds":{"DBLP":"journals/corr/abs-2408-12599","ArXiv":"2408.12599","DOI":"10.48550/arXiv.2408.12599","CorpusId":271924120},"title":"Controllable Text Generation for Large Language Models: A Survey","openAccessPdf":{"url":"","status":null,"license":null,"disclaimer":"Notice: Paper or abstract available at https://arxiv.org/abs/2408.12599, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."},"authors":[{"authorId":"2268495952","name":"Xun Liang"},{"authorId":"2284861141","name":"Hanyu Wang"},{"authorId":"2299332188","name":"Yezhaohui Wang"},{"authorId":"2268434524","name":"Shichao Song"},{"authorId":"2303425635","name":"Jiawei Yang"},{"authorId":"2268393907","name":"Simin Niu"},{"authorId":"2290202026","name":"Jie Hu"},{"authorId":"2189970643","name":"Dan Liu"},{"authorId":"2316786952","name":"Shunyu Yao"},{"authorId":"2268399953","name":"Feiyu Xiong"},{"authorId":"2268429641","name":"Zhiyu Li"}],"abstract":"In Natural Language Processing (NLP), Large Language Models (LLMs) have demonstrated high text generation quality. However, in real-world applications, LLMs must meet increasingly complex requirements. Beyond avoiding misleading or inappropriate content, LLMs are also expected to cater to specific user needs, such as imitating particular writing styles or generating text with poetic richness. These varied demands have driven the development of Controllable Text Generation (CTG) techniques, which ensure that outputs adhere to predefined control conditions--such as safety, sentiment, thematic consistency, and linguistic style--while maintaining high standards of helpfulness, fluency, and diversity. This paper systematically reviews the latest advancements in CTG for LLMs, offering a comprehensive definition of its core concepts and clarifying the requirements for control conditions and text quality. We categorize CTG tasks into two primary types: content control and attribute control. The key methods are discussed, including model retraining, fine-tuning, reinforcement learning, prompt engineering, latent space manipulation, and decoding-time intervention. We analyze each method's characteristics, advantages, and limitations, providing nuanced insights for achieving generation control. Additionally, we review CTG evaluation methods, summarize its applications across domains, and address key challenges in current research, including reduced fluency and practicality. We also propose several appeals, such as placing greater emphasis on real-world applications in future research. This paper aims to offer valuable guidance to researchers and developers in the field. Our reference list and Chinese version are open-sourced at https://github.com/IAAR-Shanghai/CTGSurvey."}