{"paperId":"c14010990c9d75a6e836e1c86d42f405a5d3d0a6","externalIds":{"ArXiv":"2405.09589","DBLP":"conf/emnlp/SahooMG0JC24","DOI":"10.18653/v1/2024.findings-emnlp.685","CorpusId":269790923},"title":"A Comprehensive Survey of Hallucination in Large Language, Image, Video and Audio Foundation Models","openAccessPdf":{"url":"http://arxiv.org/pdf/2405.09589","status":"GREEN","license":null,"disclaimer":"Notice: Paper or abstract available at https://arxiv.org/abs/2405.09589, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."},"authors":[{"authorId":"2244661284","name":"Pranab Sahoo"},{"authorId":"2301455775","name":"Prabhash Meharia"},{"authorId":"2275156796","name":"Akash Ghosh"},{"authorId":"2244669276","name":"Sriparna Saha"},{"authorId":"2212131028","name":"Vinija Jain"},{"authorId":"2275226689","name":"Aman Chadha"}],"abstract":"The rapid advancement of foundation models (FMs) across language, image, audio, and video domains has shown remarkable capabilities in diverse tasks. However, the proliferation of FMs brings forth a critical challenge: the potential to generate hallucinated outputs, particularly in high-stakes applications. The tendency of foundation models to produce hallucinated content arguably represents the biggest hindrance to their widespread adoption in real-world scenarios, especially in domains where reliability and accuracy are paramount. This survey paper presents a comprehensive overview of recent developments that aim to identify and mitigate the problem of hallucination in FMs, spanning text, image, video, and audio modalities. By synthesizing recent advancements in detecting and mitigating hallucination across various modalities, the paper aims to provide valuable insights for researchers, developers, and practitioners. Essentially, it establishes a clear framework encompassing definition, taxonomy, and detection strategies for addressing hallucination in multimodal foundation models, laying the foundation for future research in this pivotal area."}