{"paperId":"8ac21a1545a907fc64b54cde36bf41415608cd7d","externalIds":{"DBLP":"journals/corr/abs-2401-08092","ArXiv":"2401.08092","DOI":"10.48550/arXiv.2401.08092","CorpusId":267027735},"title":"A Survey of Resource-efficient LLM and Multimodal Foundation Models","openAccessPdf":{"url":"","status":null,"license":null,"disclaimer":"Notice: Paper or abstract available at https://arxiv.org/abs/2401.08092, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."},"authors":[{"authorId":"2239403838","name":"Mengwei Xu"},{"authorId":"2238575108","name":"Wangsong Yin"},{"authorId":"1751449","name":"Dongqi Cai"},{"authorId":"2170360770","name":"Rongjie Yi"},{"authorId":"2238890503","name":"Daliang Xu"},{"authorId":"2108992600","name":"Qipeng Wang"},{"authorId":"2152565623","name":"Bingyang Wu"},{"authorId":"17763235","name":"Yihao Zhao"},{"authorId":"2279899528","name":"Chen Yang"},{"authorId":"2238072264","name":"Shihe Wang"},{"authorId":"2136450158","name":"Qiyang Zhang"},{"authorId":"2279828070","name":"Zhenyan Lu"},{"authorId":"2286677673","name":"Li Zhang"},{"authorId":"2166005800","name":"Shangguang Wang"},{"authorId":"2144416765","name":"Yuanchun Li"},{"authorId":"2257345567","name":"Yunxin Liu"},{"authorId":"2239060901","name":"Xin Jin"},{"authorId":"2237080638","name":"Xuanzhe Liu"}],"abstract":"Large foundation models, including large language models (LLMs), vision transformers (ViTs), diffusion, and LLM-based multimodal models, are revolutionizing the entire machine learning lifecycle, from training to deployment. However, the substantial advancements in versatility and performance these models offer come at a significant cost in terms of hardware resources. To support the growth of these large models in a scalable and environmentally sustainable way, there has been a considerable focus on developing resource-efficient strategies. This survey delves into the critical importance of such research, examining both algorithmic and systemic aspects. It offers a comprehensive analysis and valuable insights gleaned from existing literature, encompassing a broad array of topics from cutting-edge model architectures and training/serving algorithms to practical system designs and implementations. The goal of this survey is to provide an overarching understanding of how current approaches are tackling the resource challenges posed by large foundation models and to potentially inspire future breakthroughs in this field."}