{"paperId":"9dfba8d0fda3c6d8664ca14fe6d161c89bfa1e5f","externalIds":{"DBLP":"journals/corr/abs-2403-19852","ArXiv":"2403.19852","DOI":"10.1145/3637528.3671455","CorpusId":268793908},"title":"A Review of Graph Neural Networks in Epidemic Modeling","openAccessPdf":{"url":"https://dl.acm.org/doi/pdf/10.1145/3637528.3671455","status":"HYBRID","license":"other-oa","disclaimer":"Notice: Paper or abstract available at https://arxiv.org/abs/2403.19852, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."},"authors":[{"authorId":"2294315273","name":"Zewen Liu"},{"authorId":"2294175981","name":"Guancheng Wan"},{"authorId":"2282004274","name":"B. A. Prakash"},{"authorId":"2294175241","name":"Max S. Y. Lau"},{"authorId":"2282319889","name":"Wei Jin"}],"abstract":"Since the onset of the COVID-19 pandemic, there has been a growing interest in studying epidemiological models. Traditional mechanistic models mathematically describe the transmission mechanisms of infectious diseases. However, they often fall short when confronted with the growing challenges of today. Consequently, Graph Neural Networks (GNNs) have emerged as a progressively popular tool in epidemic research. In this paper, we endeavor to furnish a comprehensive review of GNNs in epidemic tasks and highlight potential future directions. To accomplish this objective, we introduce hierarchical taxonomies for both epidemic tasks and methodologies, offering a trajectory of development within this domain. For epidemic tasks, we establish a taxonomy akin to those typically employed within the epidemic domain. For methodology, we categorize existing work into Neural Models and Hybrid Models. Following this, we perform an exhaustive and systematic examination of the methodologies, encompassing both the tasks and their technical details. Furthermore, we discuss the limitations of existing methods from diverse perspectives and systematically propose future research directions. This survey aims to bridge literature gaps and promote the progression of this promising field. We hope that it will facilitate synergies between the communities of GNNs and epidemiology, and contribute to their collective progress."}