{"paperId":"1e909e2a8cdacdcdff125ebcc566f37cb869a1c8","externalIds":{"ArXiv":"2311.05232","DBLP":"journals/tois/HuangYMZFWCPFQL25","DOI":"10.1145/3703155","CorpusId":265067168},"title":"A Survey on Hallucination in Large Language Models: Principles, Taxonomy, Challenges, and Open Questions","openAccessPdf":{"url":"https://dl.acm.org/doi/pdf/10.1145/3703155","status":"BRONZE","license":null,"disclaimer":"Notice: Paper or abstract available at https://arxiv.org/abs/2311.05232, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."},"authors":[{"authorId":"2265930173","name":"Lei Huang"},{"authorId":"2248673673","name":"Weijiang Yu"},{"authorId":"2265878959","name":"Weitao Ma"},{"authorId":"2208739098","name":"Weihong Zhong"},{"authorId":"51056532","name":"Zhangyin Feng"},{"authorId":"2256768984","name":"Haotian Wang"},{"authorId":"1500384901","name":"Qianglong Chen"},{"authorId":"2247980601","name":"Weihua Peng"},{"authorId":"2674998","name":"Xiaocheng Feng"},{"authorId":"2257004102","name":"Bing Qin"},{"authorId":"2238862997","name":"Ting Liu"}],"abstract":"The emergence of large language models (LLMs) has marked a significant breakthrough in natural language processing (NLP), fueling a paradigm shift in information acquisition. Nevertheless, LLMs are prone to hallucination, generating plausible yet nonfactual content. This phenomenon raises significant concerns over the reliability of LLMs in real-world information retrieval (IR) systems and has attracted intensive research to detect and mitigate such hallucinations. Given the open-ended general-purpose attributes inherent to LLMs, LLM hallucinations present distinct challenges that diverge from prior task-specific models. This divergence highlights the urgency for a nuanced understanding and comprehensive overview of recent advances in LLM hallucinations. In this survey, we begin with an innovative taxonomy of hallucination in the era of LLM and then delve into the factors contributing to hallucinations. Subsequently, we present a thorough overview of hallucination detection methods and benchmarks. Our discussion then transfers to representative methodologies for mitigating LLM hallucinations. Additionally, we delve into the current limitations faced by retrieval-augmented LLMs in combating hallucinations, offering insights for developing more robust IR systems. Finally, we highlight the promising research directions on LLM hallucinations, including hallucination in large vision-language models and understanding of knowledge boundaries in LLM hallucinations."}