{"paperId":"f4e18d4aefc1ee0f88f0bb09fa5c17c74aad767e","externalIds":{"ArXiv":"2304.01391","DBLP":"journals/corr/abs-2304-01391","DOI":"10.1007/s11633-024-1519-z","CorpusId":257921453},"title":"Counterfactual Learning on Graphs: A Survey","openAccessPdf":{"url":"https://doi.org/10.1007/s11633-024-1519-z","status":"HYBRID","license":"CCBY","disclaimer":"Notice: Paper or abstract available at https://arxiv.org/abs/2304.01391, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."},"authors":[{"authorId":"2149465392","name":"Zhimeng Guo"},{"authorId":"33664431","name":"Teng Xiao"},{"authorId":"2284641919","name":"Zongyu Wu"},{"authorId":"1682418","name":"C. Aggarwal"},{"authorId":"2146672392","name":"Hui Liu"},{"authorId":"2116430057","name":"Suhang Wang"}],"abstract":"Graph-structured data are pervasive in the real-world such as social networks, molecular graphs and transaction networks. Graph neural networks (GNNs) have achieved great success in representation learning on graphs, facilitating various downstream tasks. However, GNNs have several drawbacks such as lacking interpretability, can easily inherit the bias of data and cannot model casual relations. Recently, counterfactual learning on graphs has shown promising results in alleviating these drawbacks. Various approaches have been proposed for counterfactual fairness, explainability, link prediction and other applications on graphs. To facilitate the development of this promising direction, in this survey, we categorize and comprehensively review papers on graph counterfactual learning. We divide existing methods into four categories based on problems studied. For each category, we provide background and motivating examples, a general framework summarizing existing works and a detailed review of these works. We point out promising future research directions at the intersection of graph-structured data, counterfactual learning, and real-world applications. To offer a comprehensive view of resources for future studies, we compile a collection of open-source implementations, public datasets, and commonly-used evaluation metrics. This survey aims to serve as a “one-stop-shop” for building a unified understanding of graph counterfactual learning categories and current resources."}