{"paperId":"6f4da84f3172533c6b6f73bf0d07a995950146f5","externalIds":{"DBLP":"journals/corr/abs-2406-10553","ArXiv":"2406.10553","DOI":"10.48550/arXiv.2406.10553","CorpusId":270559899},"title":"A Comprehensive Taxonomy and Analysis of Talking Head Synthesis: Techniques for Portrait Generation, Driving Mechanisms, and Editing","openAccessPdf":{"url":"","status":null,"license":null,"disclaimer":"Notice: Paper or abstract available at https://arxiv.org/abs/2406.10553, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."},"authors":[{"authorId":"2284619892","name":"Ming Meng"},{"authorId":"2304894562","name":"Yufei Zhao"},{"authorId":"2306989940","name":"Bo Zhang"},{"authorId":"2304903294","name":"Yonggui Zhu"},{"authorId":"2307277227","name":"Weimin Shi"},{"authorId":"2307010971","name":"Maxwell Wen"},{"authorId":"2307732183","name":"Zhaoxin Fan"}],"abstract":"Talking head synthesis, an advanced method for generating portrait videos from a still image driven by specific content, has garnered widespread attention in virtual reality, augmented reality and game production. Recently, significant breakthroughs have been made with the introduction of novel models such as the transformer and the diffusion model. Current methods can not only generate new content but also edit the generated material. This survey systematically reviews the technology, categorizing it into three pivotal domains: portrait generation, driven mechanisms, and editing techniques. We summarize milestone studies and critically analyze their innovations and shortcomings within each domain. Additionally, we organize an extensive collection of datasets and provide a thorough performance analysis of current methodologies based on various evaluation metrics, aiming to furnish a clear framework and robust data support for future research. Finally, we explore application scenarios of talking head synthesis, illustrate them with specific cases, and examine potential future directions."}