{"paperId":"be4d586ca8add316c14f24397f57f8c77e36cb9d","externalIds":{"ArXiv":"2404.16038","DBLP":"journals/corr/abs-2404-16038","DOI":"10.48550/arXiv.2404.16038","CorpusId":269362618},"title":"A Survey on Generative AI and LLM for Video Generation, Understanding, and Streaming","openAccessPdf":{"url":"","status":null,"license":null,"disclaimer":"Notice: Paper or abstract available at https://arxiv.org/abs/2404.16038, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."},"authors":[{"authorId":"2257030459","name":"Pengyuan Zhou"},{"authorId":"2280102803","name":"Lin Wang"},{"authorId":"2298409908","name":"Zhi Liu"},{"authorId":"2268029370","name":"Yanbin Hao"},{"authorId":"2280063809","name":"Pan Hui"},{"authorId":"1759241","name":"Sasu Tarkoma"},{"authorId":"1750871","name":"J. Kangasharju"}],"abstract":"This paper offers an insightful examination of how currently top-trending AI technologies, i.e., generative artificial intelligence (Generative AI) and large language models (LLMs), are reshaping the field of video technology, including video generation, understanding, and streaming. It highlights the innovative use of these technologies in producing highly realistic videos, a significant leap in bridging the gap between real-world dynamics and digital creation. The study also delves into the advanced capabilities of LLMs in video understanding, demonstrating their effectiveness in extracting meaningful information from visual content, thereby enhancing our interaction with videos. In the realm of video streaming, the paper discusses how LLMs contribute to more efficient and user-centric streaming experiences, adapting content delivery to individual viewer preferences. This comprehensive review navigates through the current achievements, ongoing challenges, and future possibilities of applying Generative AI and LLMs to video-related tasks, underscoring the immense potential these technologies hold for advancing the field of video technology related to multimedia, networking, and AI communities."}