{"paperId":"741a7faf9dbefd418cda878c61c5b839ecc02977","externalIds":{"DBLP":"journals/pami/ChenWDZXYHY24","ArXiv":"2209.13232","DOI":"10.1109/TPAMI.2024.3445463","CorpusId":252545348,"PubMed":"39159038"},"title":"A Survey on Graph Neural Networks and Graph Transformers in Computer Vision: A Task-Oriented Perspective","openAccessPdf":{"url":"http://arxiv.org/pdf/2209.13232","status":"GREEN","license":null,"disclaimer":"Notice: Paper or abstract available at https://arxiv.org/abs/2209.13232, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."},"authors":[{"authorId":"2145762695","name":"Chaoqi Chen"},{"authorId":"2118604443","name":"Yushuang Wu"},{"authorId":"1617851686","name":"Qiyuan Dai"},{"authorId":"2157473801","name":"Hong-Yu Zhou"},{"authorId":"2145273236","name":"Mutian Xu"},{"authorId":"3144952","name":"Sibei Yang"},{"authorId":"1763245","name":"Xiaoguang Han"},{"authorId":"1841911","name":"Yizhou Yu"}],"abstract":"Graph Neural Networks (GNNs) have gained momentum in graph representation learning and boosted the state of the art in a variety of areas, such as data mining (e.g., social network analysis and recommender systems), computer vision (e.g., object detection and point cloud learning), and natural language processing (e.g., relation extraction and sequence learning), to name a few. With the emergence of Transformers in natural language processing and computer vision, graph Transformers embed a graph structure into the Transformer architecture to overcome the limitations of local neighborhood aggregation while avoiding strict structural inductive biases. In this paper, we present a comprehensive review of GNNs and graph Transformers in computer vision from a task-oriented perspective. Specifically, we divide their applications in computer vision into five categories according to the modality of input data, i.e., 2D natural images, videos, 3D data, vision + language, and medical images. In each category, we further divide the applications according to a set of vision tasks. Such a task-oriented taxonomy allows us to examine how each task is tackled by different GNN-based approaches and how well these approaches perform. Based on the necessary preliminaries, we provide the definitions and challenges of the tasks, in-depth coverage of the representative approaches, as well as discussions regarding insights, limitations, and future directions."}