{"paperId":"730d555887dfb913e943996ad9dd3aa366c74a6d","externalIds":{"DBLP":"journals/eswa/ZengWNXY24","ArXiv":"2305.11881","DOI":"10.48550/arXiv.2305.11881","CorpusId":258833349},"title":"Self-Supervised Learning for Point Clouds Data: A Survey","openAccessPdf":{"url":"http://arxiv.org/pdf/2305.11881","status":"CLOSED","license":null,"disclaimer":"Notice: Paper or abstract available at https://arxiv.org/abs/2305.11881, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."},"authors":[{"authorId":"2055609565","name":"Changyu Zeng"},{"authorId":"49337119","name":"W. Wang"},{"authorId":"2153454948","name":"A. Nguyen"},{"authorId":"2105585150","name":"Yutao Yue"}],"abstract":"3D point clouds are a crucial type of data collected by LiDAR sensors and widely used in transportation applications due to its concise descriptions and accurate localization. Deep neural networks (DNNs) have achieved remarkable success in processing large amount of disordered and sparse 3D point clouds, especially in various computer vision tasks, such as pedestrian detection and vehicle recognition. Among all the learning paradigms, Self-Supervised Learning (SSL), an unsupervised training paradigm that mines effective information from the data itself, is considered as an essential solution to solve the time-consuming and labor-intensive data labelling problems via smart pre-training task design. This paper provides a comprehensive survey of recent advances on SSL for point clouds. We first present an innovative taxonomy, categorizing the existing SSL methods into four broad categories based on the pretexts' characteristics. Under each category, we then further categorize the methods into more fine-grained groups and summarize the strength and limitations of the representative methods. We also compare the performance of the notable SSL methods in literature on multiple downstream tasks on benchmark datasets both quantitatively and qualitatively. Finally, we propose a number of future research directions based on the identified limitations of existing SSL research on point clouds."}