{"paperId":"2353d6059b691d7667699ddc2a1f3b138c9f36e7","externalIds":{"ArXiv":"2408.08315","DBLP":"journals/corr/abs-2408-08315","DOI":"10.48550/arXiv.2408.08315","CorpusId":271892315},"title":"Segment Anything for Videos: A Systematic Survey","openAccessPdf":{"url":"","status":null,"license":null,"disclaimer":"Notice: Paper or abstract available at https://arxiv.org/abs/2408.08315, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."},"authors":[{"authorId":"2247661930","name":"Chunhui Zhang"},{"authorId":"2316366199","name":"Yawen Cui"},{"authorId":"2303907210","name":"Weilin Lin"},{"authorId":"2258319630","name":"Guanjie Huang"},{"authorId":"2316327252","name":"Yan Rong"},{"authorId":"2302827257","name":"Li Liu"},{"authorId":"2330188016","name":"Shiguang Shan"}],"abstract":"The recent wave of foundation models has witnessed tremendous success in computer vision (CV) and beyond, with the segment anything model (SAM) having sparked a passion for exploring task-agnostic visual foundation models. Empowered by its remarkable zero-shot generalization, SAM is currently challenging numerous traditional paradigms in CV, delivering extraordinary performance not only in various image segmentation and multi-modal segmentation (\\eg, text-to-mask) tasks, but also in the video domain. Additionally, the latest released SAM 2 is once again sparking research enthusiasm in the realm of promptable visual segmentation for both images and videos. However, existing surveys mainly focus on SAM in various image processing tasks, a comprehensive and in-depth review in the video domain is notably absent. To address this gap, this work conducts a systematic review on SAM for videos in the era of foundation models. As the first to review the progress of SAM for videos, this work focuses on its applications to various tasks by discussing its recent advances, and innovation opportunities of developing foundation models on broad applications. We begin with a brief introduction to the background of SAM and video-related research domains. Subsequently, we present a systematic taxonomy that categorizes existing methods into three key areas: video understanding, video generation, and video editing, analyzing and summarizing their advantages and limitations. Furthermore, comparative results of SAM-based and current state-of-the-art methods on representative benchmarks, as well as insightful analysis are offered. Finally, we discuss the challenges faced by current research and envision several future research directions in the field of SAM for video and beyond."}