{"paperId":"0c9bf7491c7a1d67ac2edc8cbaa10a778cca567d","externalIds":{"ArXiv":"2402.12608","DBLP":"journals/frai/KhatibNMGMAR24","PubMedCentral":"11558794","DOI":"10.3389/frai.2024.1388479","CorpusId":267760335,"PubMed":"39540199"},"title":"Patient-centric knowledge graphs: a survey of current methods, challenges, and applications","openAccessPdf":{"url":"","status":null,"license":"CCBY","disclaimer":"Notice: Paper or abstract available at https://arxiv.org/abs/2402.12608, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."},"authors":[{"authorId":"2284765833","name":"Hassan S. Al Khatib"},{"authorId":"2175998538","name":"Subash Neupane"},{"authorId":"1978739156","name":"Harish Kumar Manchukonda"},{"authorId":"40080937","name":"Noorbakhsh Amiri Golilarz"},{"authorId":"2284767922","name":"Sudip Mittal"},{"authorId":"2284767873","name":"Amin Amirlatifi"},{"authorId":"2066329536","name":"Shahram Rahimi"}],"abstract":"Patient-Centric Knowledge Graphs (PCKGs) represent an important shift in healthcare that focuses on individualized patient care by mapping the patient’s health information holistically and multi-dimensionally. PCKGs integrate various types of health data to provide healthcare professionals with a comprehensive understanding of a patient’s health, enabling more personalized and effective care. This literature review explores the methodologies, challenges, and opportunities associated with PCKGs, focusing on their role in integrating disparate healthcare data and enhancing patient care through a unified health perspective. In addition, this review also discusses the complexities of PCKG development, including ontology design, data integration techniques, knowledge extraction, and structured representation of knowledge. It highlights advanced techniques such as reasoning, semantic search, and inference mechanisms essential in constructing and evaluating PCKGs for actionable healthcare insights. We further explore the practical applications of PCKGs in personalized medicine, emphasizing their significance in improving disease prediction and formulating effective treatment plans. Overall, this review provides a foundational perspective on the current state-of-the-art and best practices of PCKGs, guiding future research and applications in this dynamic field."}