{"paperId":"5f7bd3dded6626d571c641ad74b4033b8e591441","externalIds":{"DBLP":"journals/corr/abs-2212-04634","ArXiv":"2212.04634","DOI":"10.48550/arXiv.2212.04634","CorpusId":254535810},"title":"Open-world Story Generation with Structured Knowledge Enhancement: A Comprehensive Survey","openAccessPdf":{"url":"https://arxiv.org/pdf/2212.04634","status":"GREEN","license":null,"disclaimer":"Notice: Paper or abstract available at https://arxiv.org/abs/2212.04634, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."},"authors":[{"authorId":"2182451800","name":"Yuxin Wang"},{"authorId":"2195462267","name":"Jieru Lin"},{"authorId":"2114173","name":"Zhiwei Yu"},{"authorId":"2146242085","name":"Wei Hu"},{"authorId":"2047947436","name":"Börje F. Karlsson"}],"abstract":"Storytelling and narrative are fundamental to human experience, intertwined with our social and cultural engagement. As such, researchers have long attempted to create systems that can generate stories automatically. In recent years, powered by deep learning and massive data resources, automatic story generation has shown significant advances. However, considerable challenges, like the need for global coherence in generated stories, still hamper generative models from reaching the same storytelling ability as human narrators. To tackle these challenges, many studies seek to inject structured knowledge into the generation process, which is referred to as structured knowledge-enhanced story generation. Incorporating external knowledge can enhance the logical coherence among story events, achieve better knowledge grounding, and alleviate over-generalization and repetition problems in stories. This survey provides the latest and comprehensive review of this research field: (i) we present a systematic taxonomy regarding how existing methods integrate structured knowledge into story generation; (ii) we summarize involved story corpora, structured knowledge datasets, and evaluation metrics; (iii) we give multidimensional insights into the challenges of knowledge-enhanced story generation and cast light on promising directions for future study."}