{"paperId":"5a0573a3c15d094e8b3d488c11a660773f631070","externalIds":{"DBLP":"conf/emnlp/AdilazuardaMLSA24","ArXiv":"2403.15412","ACL":"2024.emnlp-main.882","DOI":"10.48550/arXiv.2403.15412","CorpusId":268681473},"title":"Towards Measuring and Modeling “Culture” in LLMs: A Survey","openAccessPdf":{"url":"","status":null,"license":null,"disclaimer":"Notice: Paper or abstract available at https://arxiv.org/abs/2403.15412, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."},"authors":[{"authorId":"2191731497","name":"Farid Adilazuarda"},{"authorId":"2087482453","name":"Sagnik Mukherjee"},{"authorId":"2262446167","name":"Pradhyumna Lavania"},{"authorId":"2293352196","name":"Siddhant Singh"},{"authorId":"2262445503","name":"Ashutosh Dwivedi"},{"authorId":"8129718","name":"Alham Fikri Aji"},{"authorId":"2293317227","name":"Jacki O'Neill"},{"authorId":"2477939","name":"Ashutosh Modi"},{"authorId":"143990839","name":"M. Choudhury"}],"abstract":"We present a survey of more than 90 recent papers that aim to study cultural representation and inclusion in large language models (LLMs). We observe that none of the studies explicitly define “culture, which is a complex, multifaceted concept; instead, they probe the models on some specially designed datasets which represent certain aspects of “culture”. We call these aspects the proxies of culture, and organize them across two dimensions of demographic and semantic proxies. We also categorize the probing methods employed. Our analysis indicates that only certain aspects of “culture,” such as values and objectives, have been studied, leaving several other interesting and important facets, especially the multitude of semantic domains (Thompson et al., 2020) and aboutness (Hershcovich et al., 2022), unexplored. Two other crucial gaps are the lack of robustness of probing techniques and situated studies on the impact of cultural mis- and under-representation in LLM-based applications."}