{"paperId":"9164cbb9156e6a38429fdfff33371f259f493b8c","externalIds":{"DBLP":"journals/tbd/GuoBYLZLPS25","ArXiv":"2310.04987","DOI":"10.1109/TBDATA.2024.3489412","CorpusId":263829400},"title":"Data-Centric Graph Learning: A Survey","openAccessPdf":{"url":"https://arxiv.org/pdf/2310.04987","status":"GREEN","license":null,"disclaimer":"Notice: Paper or abstract available at https://arxiv.org/abs/2310.04987, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."},"authors":[{"authorId":"2257052319","name":"Cheng Yang"},{"authorId":"1491450638","name":"Deyu Bo"},{"authorId":"2227618460","name":"Jixi Liu"},{"authorId":"2257093642","name":"Yufei Peng"},{"authorId":"2257046991","name":"Boyu Chen"},{"authorId":"2256992208","name":"Haoran Dai"},{"authorId":"2256994772","name":"Ao Sun"},{"authorId":"2257366050","name":"Yue Yu"},{"authorId":"2257132924","name":"Yixin Xiao"},{"authorId":"2257376359","name":"Qi Zhang"},{"authorId":"2142731155","name":"Chuncheng Wang"},{"authorId":"2144777089","name":"Yuxin Guo"},{"authorId":"2257131498","name":"Chuan Shi"}],"abstract":"The history of artificial intelligence (AI) has witnessed the significant impact of high-quality data on various deep learning models, such as ImageNet for AlexNet and ResNet. Recently, instead of designing more complex neural architectures as model-centric approaches, the attention of AI community has shifted to data-centric ones, which focuses on better processing data to strengthen the ability of neural models. Graph learning, which operates on ubiquitous topological data, also plays an important role in the era of deep learning. In this survey, we comprehensively review graph learning approaches from the data-centric perspective, and aim to answer three crucial questions: (1) when to modify graph data, (2) what part of the graph data needs modification to unlock the potential of various graph models, and (3) how to safeguard graph models from problematic data influence. Accordingly, we propose a novel taxonomy based on the stages in the graph learning pipeline, and highlight the processing methods for different data structures in the graph data, i.e., topology, feature and label. Furthermore, we analyze some potential problems embedded in graph data and discuss how to solve them in a data-centric manner. Finally, we provide some promising future directions for data-centric graph learning."}