{"paperId":"84d99893ee24fc825e359598d44d602c45c4865e","externalIds":{"ArXiv":"2311.01043","DBLP":"journals/corr/abs-2311-01043","DOI":"10.48550/arXiv.2311.01043","CorpusId":264935408},"title":"LLM4Drive: A Survey of Large Language Models for Autonomous Driving","openAccessPdf":{"url":"","status":null,"license":null,"disclaimer":"Notice: Paper or abstract available at https://arxiv.org/abs/2311.01043, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."},"authors":[{"authorId":"2264665546","name":"Zhenjie Yang"},{"authorId":"1958998899","name":"Xiaosong Jia"},{"authorId":"2263118181","name":"Hongyang Li"},{"authorId":"2262560236","name":"Junchi Yan"}],"abstract":"Autonomous driving technology, a catalyst for revolutionizing transportation and urban mobility, has the tend to transition from rule-based systems to data-driven strategies. Traditional module-based systems are constrained by cumulative errors among cascaded modules and inflexible pre-set rules. In contrast, end-to-end autonomous driving systems have the potential to avoid error accumulation due to their fully data-driven training process, although they often lack transparency due to their\"black box\"nature, complicating the validation and traceability of decisions. Recently, large language models (LLMs) have demonstrated abilities including understanding context, logical reasoning, and generating answers. A natural thought is to utilize these abilities to empower autonomous driving. By combining LLM with foundation vision models, it could open the door to open-world understanding, reasoning, and few-shot learning, which current autonomous driving systems are lacking. In this paper, we systematically review a research line about \\textit{Large Language Models for Autonomous Driving (LLM4AD)}. This study evaluates the current state of technological advancements, distinctly outlining the principal challenges and prospective directions for the field. For the convenience of researchers in academia and industry, we provide real-time updates on the latest advances in the field as well as relevant open-source resources via the designated link: https://github.com/Thinklab-SJTU/Awesome-LLM4AD."}