{"paperId":"a0ae8d5d833881823b85450f88a437d97da8d83b","externalIds":{"DBLP":"journals/corr/abs-2406-06119","ArXiv":"2406.06119","DOI":"10.48550/arXiv.2406.06119","CorpusId":270372036},"title":"A Survey on Incomplete Multi-label Learning: Recent Advances and Future Trends","openAccessPdf":{"url":"","status":null,"license":null,"disclaimer":"Notice: Paper or abstract available at https://arxiv.org/abs/2406.06119, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."},"authors":[{"authorId":"2307049382","name":"Xiang Li"},{"authorId":"2276562912","name":"Jiexi Liu"},{"authorId":"2257125858","name":"Xinrui Wang"},{"authorId":"2276489541","name":"Songcan Chen"}],"abstract":"In reality, data often exhibit associations with multiple labels, making multi-label learning (MLL) become a prominent research topic. The last two decades have witnessed the success of MLL, which is indispensable from complete and accurate supervised information. However, obtaining such information in practice is always laborious and sometimes even impossible. To circumvent this dilemma, incomplete multi-label learning (InMLL) has emerged, aiming to learn from incomplete labeled data. To date, enormous InMLL works have been proposed to narrow the performance gap with complete MLL, whereas a systematic review for InMLL is still absent. In this paper, we not only attempt to fill the lacuna but also strive to pave the way for innovative research. Specifically, we retrospect the origin of InMLL, analyze the challenges of InMLL, and make a taxonomy of InMLL from the data-oriented and algorithm-oriented perspectives, respectively. Besides, we also present real applications of InMLL in various domains. More importantly, we highlight several potential future trends, including four open problems that are more in line with practice and three under-explored/unexplored techniques in addressing the challenges of InMLL, which may shed new light on developing novel research directions in the field of InMLL."}