{"paperId":"794b5f34aba92f1474b5dddef809fe9be5c250b6","externalIds":{"ArXiv":"2206.13732","DBLP":"journals/corr/abs-2206-13732","DOI":"10.1109/TBIOM.2024.3486345","CorpusId":250089416},"title":"A Comprehensive Survey on Deep Gait Recognition: Algorithms, Datasets, and Challenges","openAccessPdf":{"url":"https://arxiv.org/pdf/2206.13732","status":"GREEN","license":null,"disclaimer":"Notice: Paper or abstract available at https://arxiv.org/abs/2206.13732, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."},"authors":[{"authorId":"2158467691","name":"Chuanfu Shen"},{"authorId":"1719370","name":"Shiqi Yu"},{"authorId":"2141316809","name":"Jilong Wang"},{"authorId":"2160908364","name":"George Q. Huang"},{"authorId":"1693997","name":"Liang Wang"}],"abstract":"Gait recognition aims to identify a person at a distance, serving as a promising solution for long-distance and less-cooperation pedestrian recognition. Recently, significant advances in gait recognition have achieved inspiring success in many challenging scenarios by utilizing deep learning techniques. Against the backdrop that deep gait recognition has achieved almost perfect performance in laboratory datasets, much recent research has introduced new challenges for gait recognition, including robust deep representation modeling, in-the-wild gait recognition, and even recognition from new visual sensors such as infrared and depth cameras. Meanwhile, the increasing performance of gait recognition might also reveal concerns about biometrics security and privacy prevention for society. We provide a comprehensive survey on recent literature using deep learning and a discussion on the privacy and security of gait biometrics. This survey reviews the existing deep gait recognition methods through a novel view based on our proposed taxonomy. The proposed taxonomy differs from the conventional taxonomy of categorizing available gait recognition methods into the model- or appearance-based methods, while our taxonomic hierarchy considers deep gait recognition from two perspectives: deep representation learning and deep network architectures, illustrating the current approaches from both micro and macro levels. We also include up-to-date reviews of datasets and performance evaluations on diverse scenarios. Finally, we introduce privacy and security concerns on gait biometrics and discuss outstanding challenges and potential directions for future research."}