{"paperId":"55db03005681111f0c822c416ab473c49e00f04d","externalIds":{"ArXiv":"2204.08610","DBLP":"journals/corr/abs-2204-08610","DOI":"10.48550/arXiv.2204.08610","CorpusId":248240105},"title":"Image Data Augmentation for Deep Learning: A Survey","openAccessPdf":{"url":"http://arxiv.org/pdf/2204.08610","status":"GREEN","license":null,"disclaimer":"Notice: Paper or abstract available at https://arxiv.org/abs/2204.08610, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."},"authors":[{"authorId":"2163063524","name":"Suorong Yang"},{"authorId":"48104945","name":"Wei-Ting Xiao"},{"authorId":"31770991","name":"Mengcheng Zhang"},{"authorId":"2110946851","name":"Suhan Guo"},{"authorId":"2143574510","name":"Jian Zhao"},{"authorId":"1728090","name":"Shen Furao"}],"abstract":"Deep learning has achieved remarkable results in many computer vision tasks. Deep neural networks typically rely on large amounts of training data to avoid overfitting. However, labeled data for real-world applications may be limited. By improving the quantity and diversity of training data, data augmentation has become an inevitable part of deep learning model training with image data. As an effective way to improve the sufficiency and diversity of training data, data augmentation has become a necessary part of successful application of deep learning models on image data. In this paper, we systematically review different image data augmentation methods. We propose a taxonomy of reviewed methods and present the strengths and limitations of these methods. We also conduct extensive experiments with various data augmentation methods on three typical computer vision tasks, including semantic segmentation, image classification and object detection. Finally, we discuss current challenges faced by data augmentation and future research directions to put forward some useful research guidance."}