{"paperId":"2a89dbafb45e4f811114685a6327558bdb4d1141","externalIds":{"ArXiv":"2209.15179","DBLP":"journals/pami/WeiTJWYLSGW24","DOI":"10.1109/TPAMI.2024.3430860","CorpusId":252668821,"PubMed":"39024087"},"title":"Physical Adversarial Attack Meets Computer Vision: A Decade Survey","openAccessPdf":{"url":"https://arxiv.org/pdf/2209.15179","status":"GREEN","license":null,"disclaimer":"Notice: Paper or abstract available at https://arxiv.org/abs/2209.15179, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."},"authors":[{"authorId":"2186749480","name":"Hui Wei"},{"authorId":"2112388769","name":"Hao Tang"},{"authorId":"2100723008","name":"Xuemei Jia"},{"authorId":"5731610","name":"Han-Bing Yu"},{"authorId":"2186828480","name":"Zhubo Li"},{"authorId":"2108315911","name":"Zhixiang Wang"},{"authorId":"2128750265","name":"Shin’ichi Satoh"},{"authorId":"50219447","name":"Zheng Wang"}],"abstract":"Despite the impressive achievements of Deep Neural Networks (DNNs) in computer vision, their vulnerability to adversarial attacks remains a critical concern. Extensive research has demonstrated that incorporating sophisticated perturbations into input images can lead to a catastrophic degradation in DNNs’ performance. This perplexing phenomenon not only exists in the digital space but also in the physical world. Consequently, it becomes imperative to evaluate the security of DNNs-based systems to ensure their safe deployment in real-world scenarios, particularly in security-sensitive applications. To facilitate a profound understanding of this topic, this paper presents a comprehensive overview of physical adversarial attacks. First, we distill four general steps for launching physical adversarial attacks. Building upon this foundation, we uncover the pervasive role of artifacts carrying adversarial perturbations in the physical world. These artifacts influence each step. To denote them, we introduce a new term: adversarial medium. Then, we take the first step to systematically evaluate the performance of physical adversarial attacks, taking the adversarial medium as a first attempt. Our proposed evaluation metric, hiPAA, comprises six perspectives: Effectiveness, Stealthiness, Robustness, Practicability, Aesthetics, and Economics. We also provide comparative results across task categories, together with insightful observations and suggestions for future research directions."}