{"paperId":"dcaa74d2f9293a89db3e3c95759d0703ccc2d1c6","externalIds":{"ArXiv":"2407.17877","DBLP":"journals/corr/abs-2407-17877","DOI":"10.1016/j.inffus.2024.102601","CorpusId":271432104},"title":"Advancing 3D point cloud understanding through deep transfer learning: A comprehensive survey","openAccessPdf":{"url":"","status":"CLOSED","license":null,"disclaimer":"Notice: Paper or abstract available at https://arxiv.org/abs/2407.17877, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."},"authors":[{"authorId":"32036584","name":"S. Sohail"},{"authorId":"2130461741","name":"Yassine Himeur"},{"authorId":"70335909","name":"Hamza Kheddar"},{"authorId":"2273995819","name":"Abbes Amira"},{"authorId":"47647355","name":"F. Fadli"},{"authorId":"143666486","name":"Shadi Atalla"},{"authorId":"30135714","name":"Abigail Copiaco"},{"authorId":"1699827","name":"W. Mansoor"}],"abstract":"The 3D point cloud (3DPC) has significantly evolved and benefited from the advance of deep learning (DL). However, the latter faces various issues, including the lack of data or annotated data, the existence of a significant gap between training data and test data, and the requirement for high computational resources. To that end, deep transfer learning (DTL), which decreases dependency and costs by utilizing knowledge gained from a source data/task in training a target data/task, has been widely investigated. Numerous DTL frameworks have been suggested for aligning point clouds obtained from several scans of the same scene. Additionally, DA, which is a subset of DTL, has been modified to enhance the point cloud data's quality by dealing with noise and missing points. Ultimately, fine-tuning and DA approaches have demonstrated their effectiveness in addressing the distinct difficulties inherent in point cloud data. This paper presents the first review shedding light on this aspect. it provides a comprehensive overview of the latest techniques for understanding 3DPC using DTL and domain adaptation (DA). Accordingly, DTL's background is first presented along with the datasets and evaluation metrics. A well-defined taxonomy is introduced, and detailed comparisons are presented, considering different aspects such as different knowledge transfer strategies, and performance. The paper covers various applications, such as 3DPC object detection, semantic labeling, segmentation, classification, registration, downsampling/upsampling, and denoising. Furthermore, the article discusses the advantages and limitations of the presented frameworks, identifies open challenges, and suggests potential research directions."}