{"paperId":"03f0dd9ca39b84561ad88cfd1f4923f28557d8f3","externalIds":{"DBLP":"journals/tkde/LanLDLGQZ26","ArXiv":"2401.07518","DOI":"10.1109/TKDE.2025.3621181","CorpusId":266999439},"title":"Survey of Natural Language Processing for Education: Taxonomy, Systematic Review, and Future Trends","openAccessPdf":{"url":"","status":null,"license":null,"disclaimer":"Notice: Paper or abstract available at https://arxiv.org/abs/2401.07518, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."},"authors":[{"authorId":"2257016293","name":"Yunshi Lan"},{"authorId":"2279717500","name":"Xinyuan Li"},{"authorId":"2257480069","name":"Hanyue Du"},{"authorId":"2186042291","name":"Xuesong Lu"},{"authorId":"46572901","name":"Ming Gao"},{"authorId":"2172016","name":"Weining Qian"},{"authorId":"2249165200","name":"Aoying Zhou"}],"abstract":"Natural Language Processing (NLP) aims to analyze text or speech via techniques in the computer science field. It serves applications in the domains of healthcare, commerce, education, and so on. Particularly, NLP has been widely applied to the education domain and its applications have enormous potential to help teaching and learning. In this survey, we review recent advances in NLP with a focus on solving problems relevant to the education domain. In detail, we begin with introducing the related background and the real-world scenarios in education to which NLP techniques could contribute. Then, we present a taxonomy of NLP in the education domain and highlight typical NLP applications including question answering, question construction, automated assessment, and error correction. Next, we illustrate the task definition, challenges, and corresponding cutting-edge techniques based on the above taxonomy. In particular, LLM-involved methods are included for discussion due to the wide usage of LLMs in diverse NLP applications. After that, we showcase some off-the-shelf demonstrations in this domain, which are designed for educators or researchers. At last, we conclude with five promising directions for future research, including generalization over subjects and languages, deployed LLM-based systems for education, adaptive learning for teaching and learning, interpretability for education, and ethical consideration of NLP techniques."}