{"paperId":"c7e06504d95de61ce0ae8e1fe15e7f52e843409d","externalIds":{"ArXiv":"2401.02143","DBLP":"journals/corr/abs-2401-02143","DOI":"10.1145/3744918","CorpusId":266755885},"title":"Graph Neural Networks for Tabular Data Learning: A Survey with Taxonomy and Directions","openAccessPdf":{"url":"","status":null,"license":null,"disclaimer":"Notice: Paper or abstract available at https://arxiv.org/abs/2401.02143, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."},"authors":[{"authorId":"2277810141","name":"Cheng-Te Li"},{"authorId":"1896151979","name":"Yu-Che Tsai"},{"authorId":"2109675427","name":"Chih-Yao Chen"},{"authorId":"2030126978","name":"Jay Chiehen Liao"}],"abstract":"This survey dives into Tabular Data Learning (TDL) using Graph Neural Networks (GNNs), a domain where deep learning-based approaches have increasingly shown superior performance in both classification and regression tasks compared to traditional methods. We highlight a critical gap in deep neural TDL: the underrepresentation of latent correlations among data instances and feature values. GNNs, with their innate capability to model intricate relationships and interactions between diverse elements of tabular data, have garnered significant interest and application across TDL domains. Our survey provides a systematic review of the methods involved in designing and implementing GNNs for TDL (GNN4TDL). It encompasses a detailed investigation into the foundational aspects and an overview of GNN-based TDL methods, offering insights into their evolving landscape. We present a comprehensive taxonomy focused on constructing graph structures and representation learning within GNN-based TDL methods. We also examine various training plans, emphasize the integration of auxiliary tasks to enhance the representation quality. A critical part of our discussion is dedicated to the practical applications across a spectrum of GNN4TDL scenarios, exhibiting their versatility and impact. Last, we discuss the limitations and future directions, aiming at spurring advancements in GNN4TDL. This survey serves as a resource for researchers and practitioners, offering a thorough understanding of GNNs’ role in revolutionizing TDL and pointing toward future innovations in this promising area."}