{"paperId":"894d61c709ec6f61899703458d90b09c663d7b11","externalIds":{"DBLP":"journals/corr/abs-2306-14052","ArXiv":"2306.14052","DOI":"10.48550/arXiv.2306.14052","CorpusId":259251914},"title":"A Survey on Graph Neural Network Acceleration: Algorithms, Systems, and Customized Hardware","openAccessPdf":{"url":"http://arxiv.org/pdf/2306.14052","status":"CLOSED","license":null,"disclaimer":"Notice: Paper or abstract available at https://arxiv.org/abs/2306.14052, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."},"authors":[{"authorId":"2145408511","name":"Shichang Zhang"},{"authorId":"2242000525","name":"Atefeh Sohrabizadeh"},{"authorId":"2158998114","name":"Cheng Wan"},{"authorId":"12318198","name":"Zijie Huang"},{"authorId":"3407296","name":"Ziniu Hu"},{"authorId":"27035995","name":"Yewen Wang"},{"authorId":"3138925","name":"Yingyan Lin"},{"authorId":"2066032921","name":"J. Cong"},{"authorId":"2279734673","name":"Yizhou Sun"}],"abstract":"Graph neural networks (GNNs) are emerging for machine learning research on graph-structured data. GNNs achieve state-of-the-art performance on many tasks, but they face scalability challenges when it comes to real-world applications that have numerous data and strict latency requirements. Many studies have been conducted on how to accelerate GNNs in an effort to address these challenges. These acceleration techniques touch on various aspects of the GNN pipeline, from smart training and inference algorithms to efficient systems and customized hardware. As the amount of research on GNN acceleration has grown rapidly, there lacks a systematic treatment to provide a unified view and address the complexity of relevant works. In this survey, we provide a taxonomy of GNN acceleration, review the existing approaches, and suggest future research directions. Our taxonomic treatment of GNN acceleration connects the existing works and sets the stage for further development in this area."}