{"paperId":"5851121df5ce46be5faea265c868ec0beabfce96","externalIds":{"DBLP":"journals/corr/abs-2312-03863","ArXiv":"2312.03863","DOI":"10.48550/arXiv.2312.03863","CorpusId":266044196},"title":"Efficient Large Language Models: A Survey","openAccessPdf":{"url":"","status":null,"license":null,"disclaimer":"Notice: Paper or abstract available at https://arxiv.org/abs/2312.03863, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."},"authors":[{"authorId":"2240538849","name":"Zhongwei Wan"},{"authorId":"2272325489","name":"Xin Wang"},{"authorId":"2308344169","name":"Che Liu"},{"authorId":"2069557287","name":"Samiul Alam"},{"authorId":"2149514527","name":"Yu Zheng"},{"authorId":"2257350256","name":"Jiachen Liu"},{"authorId":"2271510352","name":"Zhongnan Qu"},{"authorId":"2272708319","name":"Shen Yan"},{"authorId":"2271748644","name":"Yi Zhu"},{"authorId":"2270914501","name":"Quanlu Zhang"},{"authorId":"2271369030","name":"Mosharaf Chowdhury"},{"authorId":"2290589932","name":"Mi Zhang"}],"abstract":"Large Language Models (LLMs) have demonstrated remarkable capabilities in important tasks such as natural language understanding and language generation, and thus have the potential to make a substantial impact on our society. Such capabilities, however, come with the considerable resources they demand, highlighting the strong need to develop effective techniques for addressing their efficiency challenges. In this survey, we provide a systematic and comprehensive review of efficient LLMs research. We organize the literature in a taxonomy consisting of three main categories, covering distinct yet interconnected efficient LLMs topics from model-centric, data-centric, and framework-centric perspective, respectively. We have also created a GitHub repository where we organize the papers featured in this survey at https://github.com/AIoT-MLSys-Lab/Efficient-LLMs-Survey. We will actively maintain the repository and incorporate new research as it emerges. We hope our survey can serve as a valuable resource to help researchers and practitioners gain a systematic understanding of efficient LLMs research and inspire them to contribute to this important and exciting field."}