{"paperId":"7455e482d71bf5fe476054bebae1ab4f7e6b8061","externalIds":{"ArXiv":"2405.02358","CorpusId":269605992},"title":"Empowering Time Series Analysis with Foundation Models: A Comprehensive Survey","openAccessPdf":{"url":"","status":null,"license":null,"disclaimer":"Notice: Paper or abstract available at https://arxiv.org/abs/2405.02358, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."},"authors":[{"authorId":"2300138168","name":"Jiexia Ye"},{"authorId":"2300132611","name":"Yongzi Yu"},{"authorId":"2300132310","name":"Weiqi Zhang"},{"authorId":"2380628236","name":"Le Wang"},{"authorId":"2300131841","name":"Jia Li"},{"authorId":"2173360","name":"F. Tsung"}],"abstract":"Time series data are ubiquitous across diverse real-world applications, making time series analysis critically important. Traditional approaches are largely task-specific, offering limited functionality and poor transferability. In recent years, foundation models have revolutionized NLP and CV with their remarkable cross-task transferability, zero-/few-shot learning capabilities, and multimodal integration capacity. This success has motivated increasing efforts to explore foundation models for addressing time series modeling challenges. Although some tutorials and surveys were published in the early stages of this field, the rapid pace of recent developments necessitates a more comprehensive and in-depth synthesis to cover the latest advances. Our survey aims to fill this gap by introducing a modality-aware, challenge-oriented perspective, which reveals how foundation models pre-trained on different modalities face distinct hurdles when adapted to time series tasks. Building on this perspective, we propose a taxonomy of existing works organized by pre-training modality (time series, language, and vision), analyze modality-specific challenges and categorize corresponding solutions, discussing their advantages and limitations. Beyond this, we review real-world applications to illustrate domain-specific advancements, provide open-source codes, and conclude with potential future research directions in this rapidly evolving field."}