{"paperId":"0d4eeccd938cedf7852f608e6e8ac430accb2ab3","externalIds":{"DBLP":"journals/dase/YinQCYZLXSZ25","ArXiv":"2401.11441","DOI":"10.1007/s41019-025-00308-8","CorpusId":267069383},"title":"On-Device Recommender Systems: A Comprehensive Survey","openAccessPdf":{"url":"","status":null,"license":null,"disclaimer":"Notice: Paper or abstract available at https://arxiv.org/abs/2401.11441, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."},"authors":[{"authorId":"2267513105","name":"Hongzhi Yin"},{"authorId":"2268398927","name":"Liang Qu"},{"authorId":"2280284088","name":"Tong Chen"},{"authorId":"2106755543","name":"Wei Yuan"},{"authorId":"1811416884","name":"Ruiqi Zheng"},{"authorId":"2161605203","name":"Jing Long"},{"authorId":"2280927862","name":"Xin Xia"},{"authorId":"2152862030","name":"Yuhui Shi"},{"authorId":"2280285337","name":"Chengqi Zhang"}],"abstract":"Recommender systems have been widely deployed in various real-world applications to help users identify content of interest from massive amounts of information. Traditional recommender systems work by collecting user-item interaction data in a cloud-based data center and training a centralized model to perform the recommendation service. However, such cloud-based recommender systems (CloudRSs) inevitably suffer from excessive resource consumption, response latency, as well as privacy and security risks concerning both data and models. Recently, driven by the advances in storage, communication, and computation capabilities of edge devices, there has been a shift of focus from CloudRSs to on-device recommender systems (DeviceRSs), which leverage the capabilities of edge devices to minimize centralized data storage requirements, reduce the response latency caused by communication overheads, and enhance user privacy and security by localizing data processing and model training. Despite the rapid rise of DeviceRSs, there is a clear absence of timely literature reviews that systematically introduce, categorize and contrast these methods. To bridge this gap, we aim to provide a comprehensive survey of DeviceRSs, covering three main aspects: (1) the deployment and inference of DeviceRSs, exploring how large recommendation models can be compressed and utilized within resource-constrained on-device environments; (2) the training and update of DeviceRSs, discussing how local data can be leveraged for model optimization on the device side; (3) the security and privacy of DeviceRSs, unveiling their potential vulnerability to malicious attacks and defensive strategies to safeguard these systems. Furthermore, we provide a fine-grained and systematic taxonomy of the methods involved in each aspect, followed by a discussion regarding challenges and future research directions. This is the first comprehensive survey on DeviceRSs that covers a spectrum of tasks to fit various needs. We believe this survey will help readers understand the current research status in this field, equip them with relevant technical foundations, and stimulate new research ideas for developing DeviceRSs."}