{"paperId":"7bdfb49883c0a0b8b754e3356887d7b3faff348e","externalIds":{"ArXiv":"2305.06360","DBLP":"journals/corr/abs-2305-06360","DOI":"10.1109/TNNLS.2024.3486109","CorpusId":258685261,"PubMed":"39531570"},"title":"Exploring the Landscape of Machine Unlearning: A Comprehensive Survey and Taxonomy","openAccessPdf":{"url":"","status":null,"license":null,"disclaimer":"Notice: Paper or abstract available at https://arxiv.org/abs/2305.06360, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."},"authors":[{"authorId":"2047535647","name":"T. Shaik"},{"authorId":"2070898550","name":"Xiaohui Tao"},{"authorId":"2117713837","name":"Haoran Xie"},{"authorId":"2157140217","name":"Lin Li"},{"authorId":"2149933153","name":"Xiaofeng Zhu"},{"authorId":"30750669","name":"Qingyuan Li"}],"abstract":"Machine unlearning (MU) is gaining increasing attention due to the need to remove or modify predictions made by machine learning (ML) models. While training models have become more efficient and accurate, the importance of unlearning previously learned information has become increasingly significant in fields such as privacy, security, and ethics. This article presents a comprehensive survey of MU, covering current state-of-the-art techniques and approaches, including data deletion, perturbation, and model updates. In addition, commonly used metrics and datasets are presented. This article also highlights the challenges that need to be addressed, including attack sophistication, standardization, transferability, interpretability, training data, and resource constraints. The contributions of this article include discussions about the potential benefits of MU and its future directions. Additionally, this article emphasizes the need for researchers and practitioners to continue exploring and refining unlearning techniques to ensure that ML models can adapt to changing circumstances while maintaining user trust. The importance of unlearning is further highlighted in making artificial intelligence (AI) more trustworthy and transparent, especially with the growing importance of AI across various domains that involve large amounts of personal user data."}