{"paperId":"1df754afa6d27b630ecf91d15bb1ae4ed12a194e","externalIds":{"ArXiv":"2309.01955","DBLP":"journals/corr/abs-2309-01955","DOI":"10.48550/arXiv.2309.01955","CorpusId":261530846},"title":"A Survey on Interpretable Cross-modal Reasoning","openAccessPdf":{"url":"https://arxiv.org/pdf/2309.01955","status":"CLOSED","license":null,"disclaimer":"Notice: Paper or abstract available at https://arxiv.org/abs/2309.01955, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."},"authors":[{"authorId":"2106686837","name":"Dizhan Xue"},{"authorId":"2070687","name":"Shengsheng Qian"},{"authorId":"2237943333","name":"Zuyi Zhou"},{"authorId":"2237947496","name":"Changsheng Xu"}],"abstract":"In recent years, cross-modal reasoning (CMR), the process of understanding and reasoning across different modalities, has emerged as a pivotal area with applications spanning from multimedia analysis to healthcare diagnostics. As the deployment of AI systems becomes more ubiquitous, the demand for transparency and comprehensibility in these systems' decision-making processes has intensified. This survey delves into the realm of interpretable cross-modal reasoning (I-CMR), where the objective is not only to achieve high predictive performance but also to provide human-understandable explanations for the results. This survey presents a comprehensive overview of the typical methods with a three-level taxonomy for I-CMR. Furthermore, this survey reviews the existing CMR datasets with annotations for explanations. Finally, this survey summarizes the challenges for I-CMR and discusses potential future directions. In conclusion, this survey aims to catalyze the progress of this emerging research area by providing researchers with a panoramic and comprehensive perspective, illuminating the state of the art and discerning the opportunities. The summarized methods, datasets, and other resources are available at https://github.com/ZuyiZhou/Awesome-Interpretable-Cross-modal-Reasoning."}