{"paperId":"a74a20be53e5767648b5970e30b2d81a9ba8293f","externalIds":{"ArXiv":"2402.05964","DBLP":"journals/corr/abs-2402-05964","DOI":"10.48550/arXiv.2402.05964","CorpusId":267617160},"title":"A Survey on Transformer Compression","openAccessPdf":{"url":"","status":null,"license":null,"disclaimer":"Notice: Paper or abstract available at https://arxiv.org/abs/2402.05964, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."},"authors":[{"authorId":"103603255","name":"Yehui Tang"},{"authorId":"2274472972","name":"Yunhe Wang"},{"authorId":"2148899357","name":"Jianyuan Guo"},{"authorId":"2273928979","name":"Zhijun Tu"},{"authorId":"2277423285","name":"Kai Han"},{"authorId":"4520244","name":"Hailin Hu"},{"authorId":"2259752319","name":"Dacheng Tao"}],"abstract":"Transformer plays a vital role in the realms of natural language processing (NLP) and computer vision (CV), specially for constructing large language models (LLM) and large vision models (LVM). Model compression methods reduce the memory and computational cost of Transformer, which is a necessary step to implement large language/vision models on practical devices. Given the unique architecture of Transformer, featuring alternative attention and feedforward neural network (FFN) modules, specific compression techniques are usually required. The efficiency of these compression methods is also paramount, as retraining large models on the entire training dataset is usually impractical. This survey provides a comprehensive review of recent compression methods, with a specific focus on their application to Transformer-based models. The compression methods are primarily categorized into pruning, quantization, knowledge distillation, and efficient architecture design (Mamba, RetNet, RWKV, etc.). In each category, we discuss compression methods for both language and vision tasks, highlighting common underlying principles. Finally, we delve into the relation between various compression methods, and discuss further directions in this domain."}