{"paperId":"c318fde5128b903ff90d8850edeb640ba2b17184","externalIds":{"DBLP":"journals/corr/abs-2407-00783","ArXiv":"2407.00783","DOI":"10.48550/arXiv.2407.00783","CorpusId":270869763,"PubMed":"41610358"},"title":"Diffusion Models and Representation Learning: A Survey","openAccessPdf":{"url":"","status":null,"license":null,"disclaimer":"Notice: Paper or abstract available at https://arxiv.org/abs/2407.00783, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."},"authors":[{"authorId":"2309173490","name":"Michael Fuest"},{"authorId":"2273647740","name":"Pingchuan Ma"},{"authorId":"2309172432","name":"Ming Gui"},{"authorId":"2273655571","name":"Johannes S. Fischer"},{"authorId":"2292259521","name":"Vincent Tao Hu"},{"authorId":"2257038709","name":"Bjorn Ommer"}],"abstract":"Diffusion Models are popular generative modeling methods in various vision tasks, attracting significant attention. They can be considered a unique instance of self-supervised learning methods due to their independence from label annotation. This survey explores the interplay between diffusion models and representation learning. It provides an overview of diffusion models' essential aspects, including mathematical foundations, popular denoising network architectures, and guidance methods. Various approaches related to diffusion models and representation learning are detailed. These include frameworks that leverage representations learned from pre-trained diffusion models for subsequent recognition tasks and methods that utilize advancements in representation and self-supervised learning to enhance diffusion models. This survey aims to offer a comprehensive overview of the taxonomy between diffusion models and representation learning, identifying key areas of existing concerns and potential exploration. Github link: https://github.com/dongzhuoyao/Diffusion-Representation-Learning-Survey-Taxonomy."}