{"paperId":"53f60a6bfb7e01cc2ca75f1098331340b3773507","externalIds":{"ArXiv":"2406.09559","DBLP":"journals/corr/abs-2406-09559","DOI":"10.48550/arXiv.2406.09559","CorpusId":270521667},"title":"Decoding the Diversity: A Review of the Indic AI Research Landscape","openAccessPdf":{"url":"","status":null,"license":null,"disclaimer":"Notice: Paper or abstract available at https://arxiv.org/abs/2406.09559, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."},"authors":[{"authorId":"2306783086","name":"KJ Sankalp"},{"authorId":"2212131028","name":"Vinija Jain"},{"authorId":"28967297","name":"S. Bhaduri"},{"authorId":"2061597440","name":"Tamoghna Roy"},{"authorId":"2275226689","name":"Aman Chadha"}],"abstract":"This review paper provides a comprehensive overview of large language model (LLM) research directions within Indic languages. Indic languages are those spoken in the Indian subcontinent, including India, Pakistan, Bangladesh, Sri Lanka, Nepal, and Bhutan, among others. These languages have a rich cultural and linguistic heritage and are spoken by over 1.5 billion people worldwide. With the tremendous market potential and growing demand for natural language processing (NLP) based applications in diverse languages, generative applications for Indic languages pose unique challenges and opportunities for research. Our paper deep dives into the recent advancements in Indic generative modeling, contributing with a taxonomy of research directions, tabulating 84 recent publications. Research directions surveyed in this paper include LLM development, fine-tuning existing LLMs, development of corpora, benchmarking and evaluation, as well as publications around specific techniques, tools, and applications. We found that researchers across the publications emphasize the challenges associated with limited data availability, lack of standardization, and the peculiar linguistic complexities of Indic languages. This work aims to serve as a valuable resource for researchers and practitioners working in the field of NLP, particularly those focused on Indic languages, and contributes to the development of more accurate and efficient LLM applications for these languages."}