{"paperId":"761b1c651aeead25be89a1c832bb9204031e8110","externalIds":{"DBLP":"journals/corr/abs-2402-10505","ArXiv":"2402.10505","DOI":"10.48550/arXiv.2402.10505","CorpusId":282940898},"title":"A Survey of Resilient Coordination for Cyber-Physical Systems Against Malicious Attacks","openAccessPdf":{"url":"","status":null,"license":null,"disclaimer":"Notice: Paper or abstract available at https://arxiv.org/abs/2402.10505, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."},"authors":[{"authorId":"2061181173","name":"Zirui Liao"},{"authorId":"2318647701","name":"Jian Shi"},{"authorId":"2108424223","name":"Yuwei Zhang"},{"authorId":"2279020166","name":"Shaoping Wang"},{"authorId":"2238397775","name":"Zhiyong Sun"}],"abstract":"Cyber-physical systems (CPSs) facilitate the integration of physical entities and cyber infrastructures through the utilization of pervasive computational resources and communication units, leading to improved efficiency, automation, and practical viability in both academia and industry. Due to its openness and distributed characteristics, a critical issue prevalent in CPSs is to guarantee resilience in presence of malicious attacks. This paper conducts a comprehensive survey of recent advances on resilient coordination for CPSs. Different from existing survey papers, we focus on the node injection attack and propose a novel taxonomy according to the multi-layered framework of CPS. Furthermore, miscellaneous resilient coordination problems are discussed in this survey. Specifically, some preliminaries and the fundamental problem settings are given at the beginning. Subsequently, based on a multi-layered framework of CPSs, promising results of resilient consensus are classified and reviewed from three perspectives: physical structure, communication mechanism, and network topology. Next, two typical application scenarios, i.e., multi-robot systems and smart grids are exemplified to extend resilient consensus to other coordination tasks. Particularly, we examine resilient containment and resilient distributed optimization problems, both of which demonstrate the applicability of resilient coordination approaches. Finally, potential avenues are highlighted for future research."}