{"paperId":"6180615110d86033887d0dc4feebe8e8a162346f","externalIds":{"DBLP":"journals/corr/abs-2405-12819","ArXiv":"2405.12819","DOI":"10.48550/arXiv.2405.12819","CorpusId":269930153},"title":"Large Language Models Meet NLP: A Survey","openAccessPdf":{"url":"","status":null,"license":null,"disclaimer":"Notice: Paper or abstract available at https://arxiv.org/abs/2405.12819, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."},"authors":[{"authorId":"2284759913","name":"Libo Qin"},{"authorId":"2133447633","name":"Qiguang Chen"},{"authorId":"2302496781","name":"Xiachong Feng"},{"authorId":"2302500646","name":"Yang Wu"},{"authorId":"2302418895","name":"Yongheng Zhang"},{"authorId":"2295785468","name":"Yinghui Li"},{"authorId":"2266810224","name":"Min Li"},{"authorId":"2262459819","name":"Wanxiang Che"},{"authorId":"2284755458","name":"Philip S. Yu"}],"abstract":"While large language models (LLMs) like ChatGPT have shown impressive capabilities in Natural Language Processing (NLP) tasks, a systematic investigation of their potential in this field remains largely unexplored. This study aims to address this gap by exploring the following questions: (1) How are LLMs currently applied to NLP tasks in the literature? (2) Have traditional NLP tasks already been solved with LLMs? (3) What is the future of the LLMs for NLP? To answer these questions, we take the first step to provide a comprehensive overview of LLMs in NLP. Specifically, we first introduce a unified taxonomy including (1) parameter-frozen paradigm and (2) parameter-tuning paradigm to offer a unified perspective for understanding the current progress of LLMs in NLP. Furthermore, we summarize the new frontiers and the corresponding challenges, aiming to inspire further groundbreaking advancements. We hope this work offers valuable insights into the potential and limitations of LLMs, while also serving as a practical guide for building effective LLMs in NLP."}