{"paperId":"2f158d090ffef32e066e7638655bd85072b9c515","externalIds":{"DBLP":"journals/corr/abs-2407-09777","ArXiv":"2407.09777","DOI":"10.1109/TNNLS.2025.3646122","CorpusId":271212650,"PubMed":"41525531"},"title":"Graph Transformers: A Survey","openAccessPdf":{"url":"","status":null,"license":null,"disclaimer":"Notice: Paper or abstract available at https://arxiv.org/abs/2407.09777, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."},"authors":[{"authorId":"98185945","name":"Ahsan Shehzad"},{"authorId":"2283308587","name":"Feng Xia"},{"authorId":"2187101639","name":"Shagufta Abid"},{"authorId":"1726114642","name":"Ciyuan Peng"},{"authorId":"50443544","name":"Shuo Yu"},{"authorId":"2312078401","name":"Dongyu Zhang"},{"authorId":"2250047391","name":"Karin M. Verspoor"}],"abstract":"Graph transformers are a recent advancement in machine learning, offering a new class of neural network models for graph-structured data. The synergy between transformers and graph learning demonstrates strong performance and versatility across various graph-related tasks. This survey provides an in-depth review of recent progress and challenges in graph transformer research. We begin with foundational concepts of graphs and transformers. We then explore design perspectives of graph transformers, focusing on how they integrate graph inductive biases and graph attention mechanisms into the transformer architecture. Furthermore, we propose a taxonomy classifying graph transformers based on depth, scalability, and pretraining strategies, summarizing key principles for effective development of graph transformer models. Beyond technical analysis, we discuss the applications of graph transformer models for node-level, edge-level, and graph-level tasks, exploring their potential in other application scenarios as well. Finally, we identify remaining challenges in the field, such as scalability and efficiency, generalization and robustness, interpretability and explainability, dynamic and complex graphs, as well as data quality and diversity, charting future directions for graph transformer research."}