{"paperId":"5562a6d5d72e4b576123c6848d02afa00dcae0ac","externalIds":{"DBLP":"journals/csur/ZhouXGWZXY25","ArXiv":"2212.09970","DOI":"10.1145/3732282","CorpusId":257037997},"title":"Data Augmentation on Graphs: A Technical Survey","openAccessPdf":{"url":"http://arxiv.org/pdf/2212.09970","status":"GREEN","license":null,"disclaimer":"Notice: Paper or abstract available at https://arxiv.org/abs/2212.09970, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."},"authors":[{"authorId":"2146367628","name":"Jiajun Zhou"},{"authorId":"2197076698","name":"Chenxuan Xie"},{"authorId":"1788122","name":"Z. Wen"},{"authorId":"2197532318","name":"Xiangyu Zhao"},{"authorId":"2159202690","name":"Qi Xuan"}],"abstract":"In recent years, graph representation learning has achieved remarkable success while suffering from low-quality data problems. As a mature technology to improve data quality in computer vision, data augmentation has also attracted increasing attention in graph domain. To advance research in this emerging direction, this survey provides a comprehensive review and summary of existing graph data augmentation (GDAug) techniques. Specifically, this survey first provides an overview of various feasible taxonomies and categorizes existing GDAug studies based on multi-scale graph elements. Subsequently, for each type of GDAug technique, this survey formalizes standardized technical definition, discuss the technical details, and provide schematic illustration. The survey also reviews domain-specific graph data augmentation techniques, including those for heterogeneous graphs, temporal graphs, spatio-temporal graphs, and hypergraphs. In addition, this survey provides a summary of available evaluation metrics and design guidelines for graph data augmentation. Lastly, it outlines the applications of GDAug at both the data and model levels, discusses open issues in the field, and looks forward to future directions. The latest advances in GDAug are summarized in GitHub.1"}