{"paperId":"d731ddba3bcb34bbf159f0d32984828220b646ce","externalIds":{"DBLP":"journals/csur/WengGGMYLC25","ArXiv":"2401.05446","DOI":"10.1145/3736574","CorpusId":266933089},"title":"Self-supervised Learning for Electroencephalogram: A Systematic Survey","openAccessPdf":{"url":"","status":null,"license":null,"disclaimer":"Notice: Paper or abstract available at https://arxiv.org/abs/2401.05446, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."},"authors":[{"authorId":"2211130990","name":"Weining Weng"},{"authorId":"2260374620","name":"Yang Gu"},{"authorId":"2178866385","name":"Shuai Guo"},{"authorId":"2187876562","name":"Yuan Ma"},{"authorId":"2208603070","name":"Zhaohua Yang"},{"authorId":"2279161898","name":"Yuchen Liu"},{"authorId":"2259969518","name":"Yiqiang Chen"}],"abstract":"Electroencephalography (EEG) is a non-invasive technique to record bioelectrical signals. Integrating supervised deep learning techniques with EEG signals has recently facilitated automatic analysis across diverse EEG-based tasks. However, the label issues of EEG signals have constrained the development of EEG-based deep models. Obtaining EEG annotations is difficult and requires domain experts to guide collection and labeling, and the variability of EEG signals among different subjects causes significant label shifts. To solve the above challenges, self-supervised learning (SSL) has been proposed to extract representations from unlabeled samples through well-designed pretext tasks. This article concentrates on integrating SSL frameworks with temporal EEG signals to achieve efficient representations and proposes a systematic survey of the SSL for EEG signals. In this article, (1) We introduce the concept and theory of self-supervised learning and typical SSL frameworks. (2) We provide a comprehensive survey of SSL for EEG analysis, including taxonomy, methodology, and technical details of the existing EEG-based SSL frameworks, and discuss the differences between these methods. (3) We investigate the adaptation of the SSL approach to various downstream tasks, including the task description and related benchmark datasets, and further explore its application in large-scale pre-trained foundation models for EEG signals. (4) Finally, we discuss the potential directions for future SSL-EEG research."}