{"paperId":"6dd1859af3f4856a0d3f9cca81c8d2121fb3979a","externalIds":{"DBLP":"journals/corr/abs-2303-13336","ArXiv":"2303.13336","DOI":"10.48550/arXiv.2303.13336","CorpusId":257913174},"title":"A Survey on Audio Diffusion Models: Text To Speech Synthesis and Enhancement in Generative AI","openAccessPdf":{"url":"http://arxiv.org/pdf/2303.13336","status":"CLOSED","license":null,"disclaimer":"Notice: Paper or abstract available at https://arxiv.org/abs/2303.13336, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."},"authors":[{"authorId":"48934876","name":"Chenshuang Zhang"},{"authorId":"31044159","name":"Chaoning Zhang"},{"authorId":"2211960167","name":"Sheng Zheng"},{"authorId":"50495602","name":"Mengchun Zhang"},{"authorId":"2154413361","name":"Maryam Qamar"},{"authorId":"40547898","name":"S. Bae"},{"authorId":"145017151","name":"In-So Kweon"}],"abstract":"Generative AI has demonstrated impressive performance in various fields, among which speech synthesis is an interesting direction. With the diffusion model as the most popular generative model, numerous works have attempted two active tasks: text to speech and speech enhancement. This work conducts a survey on audio diffusion model, which is complementary to existing surveys that either lack the recent progress of diffusion-based speech synthesis or highlight an overall picture of applying diffusion model in multiple fields. Specifically, this work first briefly introduces the background of audio and diffusion model. As for the text-to-speech task, we divide the methods into three categories based on the stage where diffusion model is adopted: acoustic model, vocoder and end-to-end framework. Moreover, we categorize various speech enhancement tasks by either certain signals are removed or added into the input speech. Comparisons of experimental results and discussions are also covered in this survey."}