{"paperId":"b486982fa7c68a8a08df1111ba9607119419c488","externalIds":{"DBLP":"journals/corr/abs-2305-19860","ArXiv":"2305.19860","DOI":"10.1007/s11280-024-01291-2","CorpusId":258987581},"title":"A survey on large language models for recommendation","openAccessPdf":{"url":"","status":"CLOSED","license":null,"disclaimer":"Notice: Paper or abstract available at https://arxiv.org/abs/2305.19860, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."},"authors":[{"authorId":"2386196704","name":"Likang Wu"},{"authorId":"2115548818","name":"Zhilan Zheng"},{"authorId":"2382872","name":"Zhaopeng Qiu"},{"authorId":"2144219662","name":"Hao Wang"},{"authorId":"2218562902","name":"Hongchao Gu"},{"authorId":"2218610917","name":"Tingjia Shen"},{"authorId":"2084610514","name":"Chuan Qin"},{"authorId":"2118043140","name":"Chen Zhu"},{"authorId":"1968806","name":"Hengshu Zhu"},{"authorId":"50384136","name":"Qi Liu"},{"authorId":"2093122576","name":"Hui Xiong"},{"authorId":"2173129111","name":"Enhong Chen"}],"abstract":"Large Language Models (LLMs) have emerged as powerful tools in the field of Natural Language Processing (NLP) and have recently gained significant attention in the domain of Recommendation Systems (RS). These models, trained on massive amounts of data using self-supervised learning, have demonstrated remarkable success in learning universal representations and have the potential to enhance various aspects of recommendation systems by some effective transfer techniques such as fine-tuning, prompt tuning, etc. The crucial aspect of harnessing the power of language models in enhancing recommendation quality is the utilization of their high-quality representations of textual features and their extensive coverage of external knowledge to establish correlations between items and users. To provide a comprehensive understanding of the existing LLM-based recommendation systems, this survey presents a taxonomy that categorizes these models into two major paradigms, respectively Discriminative LLM for Recommendation (DLLM4Rec) and Generative LLM for Recommendation (GLLM4Rec), with the latter being systematically sorted out for the first time. Furthermore, we systematically review and analyze existing LLM-based recommendation systems within each paradigm, providing insights into their methodologies, techniques, and performance. Additionally, we identify key challenges and several valuable findings to provide researchers and practitioners with inspiration. We have also created a GitHub repository to index relevant papers and resources on LLMs for recommendation (https://github.com/WLiK/LLM4Rec-Awesome-Papers)."}