{"paperId":"2c5d684f688e7f692356867552378fca8af3fe81","externalIds":{"DBLP":"journals/corr/abs-2408-00001","ArXiv":"2408.00001","DOI":"10.48550/arXiv.2408.00001","CorpusId":271600759},"title":"Replication in Visual Diffusion Models: A Survey and Outlook","openAccessPdf":{"url":"","status":null,"license":null,"disclaimer":"Notice: Paper or abstract available at https://arxiv.org/abs/2408.00001, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."},"authors":[{"authorId":"2108977186","name":"Wenhao Wang"},{"authorId":"2267731577","name":"Yifan Sun"},{"authorId":"15556978","name":"Zongxin Yang"},{"authorId":"2125634511","name":"Zhengdong Hu"},{"authorId":"2296990692","name":"Zhentao Tan"},{"authorId":"2297815073","name":"Yi Yang"}],"abstract":"Visual diffusion models have revolutionized the field of creative AI, producing high-quality and diverse content. However, they inevitably memorize training images or videos, subsequently replicating their concepts, content, or styles during inference. This phenomenon raises significant concerns about privacy, security, and copyright within generated outputs. In this survey, we provide the first comprehensive review of replication in visual diffusion models, marking a novel contribution to the field by systematically categorizing the existing studies into unveiling, understanding, and mitigating this phenomenon. Specifically, unveiling mainly refers to the methods used to detect replication instances. Understanding involves analyzing the underlying mechanisms and factors that contribute to this phenomenon. Mitigation focuses on developing strategies to reduce or eliminate replication. Beyond these aspects, we also review papers focusing on its real-world influence. For instance, in the context of healthcare, replication is critically worrying due to privacy concerns related to patient data. Finally, the paper concludes with a discussion of the ongoing challenges, such as the difficulty in detecting and benchmarking replication, and outlines future directions including the development of more robust mitigation techniques. By synthesizing insights from diverse studies, this paper aims to equip researchers and practitioners with a deeper understanding at the intersection between AI technology and social good. We release this project at https://github.com/WangWenhao0716/Awesome-Diffusion-Replication."}