{"paperId":"48cbad923c60ff4cfab54a52de491fa62268cf43","externalIds":{"DBLP":"journals/tmlr/MelnikLLYRR24","ArXiv":"2405.03150","DOI":"10.48550/arXiv.2405.03150","CorpusId":269606007},"title":"Video Diffusion Models: A Survey","openAccessPdf":{"url":"","status":null,"license":null,"disclaimer":"Notice: Paper or abstract available at https://arxiv.org/abs/2405.03150, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."},"authors":[{"authorId":"2064241494","name":"A. Melnik"},{"authorId":"2300098788","name":"Michal Ljubljanac"},{"authorId":"2110752472","name":"Cong Lu"},{"authorId":"2072779974","name":"Qi Yan"},{"authorId":"2268493042","name":"Weiming Ren"},{"authorId":"2257240279","name":"Helge J. Ritter"}],"abstract":"Diffusion generative models have recently become a powerful technique for creating and modifying high-quality, coherent video content. This survey provides a comprehensive overview of the critical components of diffusion models for video generation, including their applications, architectural design, and temporal dynamics modeling. The paper begins by discussing the core principles and mathematical formulations, then explores various architectural choices and methods for maintaining temporal consistency. A taxonomy of applications is presented, categorizing models based on input modalities such as text prompts, images, videos, and audio signals. Advancements in text-to-video generation are discussed to illustrate the state-of-the-art capabilities and limitations of current approaches. Additionally, the survey summarizes recent developments in training and evaluation practices, including the use of diverse video and image datasets and the adoption of various evaluation metrics to assess model performance. The survey concludes with an examination of ongoing challenges, such as generating longer videos and managing computational costs, and offers insights into potential future directions for the field. By consolidating the latest research and developments, this survey aims to serve as a valuable resource for researchers and practitioners working with video diffusion models. Website: https://github.com/ndrwmlnk/Awesome-Video-Diffusion-Models"}