{"paperId":"4b6bcfc8ed6716deee880726eeb83a4714fd7be9","externalIds":{"ArXiv":"2405.03110","DBLP":"journals/corr/abs-2405-03110","DOI":"10.48550/arXiv.2405.03110","CorpusId":269605454},"title":"Vector Quantization for Recommender Systems: A Review and Outlook","openAccessPdf":{"url":"","status":null,"license":null,"disclaimer":"Notice: Paper or abstract available at https://arxiv.org/abs/2405.03110, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."},"authors":[{"authorId":"150270469","name":"Qijiong Liu"},{"authorId":"2300177888","name":"Xiaoyu Dong"},{"authorId":"2300433378","name":"Jiaren Xiao"},{"authorId":"2257286538","name":"Nuo Chen"},{"authorId":"2258801777","name":"Hengchang Hu"},{"authorId":"2290237904","name":"Jieming Zhu"},{"authorId":"2115802321","name":"Chenxu Zhu"},{"authorId":"2257233277","name":"Tetsuya Sakai"},{"authorId":"2265517306","name":"Xiao-Ming Wu"}],"abstract":"Vector quantization, renowned for its unparalleled feature compression capabilities, has been a prominent topic in signal processing and machine learning research for several decades and remains widely utilized today. With the emergence of large models and generative AI, vector quantization has gained popularity in recommender systems, establishing itself as a preferred solution. This paper starts with a comprehensive review of vector quantization techniques. It then explores systematic taxonomies of vector quantization methods for recommender systems (VQ4Rec), examining their applications from multiple perspectives. Further, it provides a thorough introduction to research efforts in diverse recommendation scenarios, including efficiency-oriented approaches and quality-oriented approaches. Finally, the survey analyzes the remaining challenges and anticipates future trends in VQ4Rec, including the challenges associated with the training of vector quantization, the opportunities presented by large language models, and emerging trends in multimodal recommender systems. We hope this survey can pave the way for future researchers in the recommendation community and accelerate their exploration in this promising field."}