{"paperId":"1fe93167355c93856f3bb0fed499bdd640c24091","externalIds":{"ArXiv":"2409.05383","DBLP":"journals/corr/abs-2409-05383","DOI":"10.48550/arXiv.2409.05383","CorpusId":272524507},"title":"Deep Learning for Video Anomaly Detection: A Review","openAccessPdf":{"url":"","status":null,"license":null,"disclaimer":"Notice: Paper or abstract available at https://arxiv.org/abs/2409.05383, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."},"authors":[{"authorId":"2256331873","name":"Peng Wu"},{"authorId":"2320539347","name":"Chengyu Pan"},{"authorId":"2337777710","name":"Yuting Yan"},{"authorId":"2279722653","name":"Guansong Pang"},{"authorId":"2155302795","name":"Peng Wang"},{"authorId":"2254019885","name":"Yanning Zhang"}],"abstract":"Video anomaly detection (VAD) aims to discover behaviors or events deviating from the normality in videos. As a long-standing task in the field of computer vision, VAD has witnessed much good progress. In the era of deep learning, with the explosion of architectures of continuously growing capability and capacity, a great variety of deep learning based methods are constantly emerging for the VAD task, greatly improving the generalization ability of detection algorithms and broadening the application scenarios. Therefore, such a multitude of methods and a large body of literature make a comprehensive survey a pressing necessity. In this paper, we present an extensive and comprehensive research review, covering the spectrum of five different categories, namely, semi-supervised, weakly supervised, fully supervised, unsupervised and open-set supervised VAD, and we also delve into the latest VAD works based on pre-trained large models, remedying the limitations of past reviews in terms of only focusing on semi-supervised VAD and small model based methods. For the VAD task with different levels of supervision, we construct a well-organized taxonomy, profoundly discuss the characteristics of different types of methods, and show their performance comparisons. In addition, this review involves the public datasets, open-source codes, and evaluation metrics covering all the aforementioned VAD tasks. Finally, we provide several important research directions for the VAD community."}