{"paperId":"57d8d8aefbc39b748778dd9408d1e38bf655ae3d","externalIds":{"ArXiv":"2406.04253","DBLP":"journals/corr/abs-2406-04253","DOI":"10.48550/arXiv.2406.04253","CorpusId":270286232},"title":"A Survey on 3D Human Avatar Modeling - From Reconstruction to Generation","openAccessPdf":{"url":"","status":null,"license":null,"disclaimer":"Notice: Paper or abstract available at https://arxiv.org/abs/2406.04253, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."},"authors":[{"authorId":"2305122426","name":"Ruihe Wang"},{"authorId":"2163431765","name":"Yukang Cao"},{"authorId":"2305465092","name":"Kai Han"},{"authorId":"2198281849","name":"K. K. Wong"}],"abstract":"3D modeling has long been an important area in computer vision and computer graphics. Recently, thanks to the breakthroughs in neural representations and generative models, we witnessed a rapid development of 3D modeling. 3D human modeling, lying at the core of many real-world applications, such as gaming and animation, has attracted significant attention. Over the past few years, a large body of work on creating 3D human avatars has been introduced, forming a new and abundant knowledge base for 3D human modeling. The scale of the literature makes it difficult for individuals to keep track of all the works. This survey aims to provide a comprehensive overview of these emerging techniques for 3D human avatar modeling, from both reconstruction and generation perspectives. Firstly, we review representative methods for 3D human reconstruction, including methods based on pixel-aligned implicit function, neural radiance field, and 3D Gaussian Splatting, etc. We then summarize representative methods for 3D human generation, especially those using large language models like CLIP, diffusion models, and various 3D representations, which demonstrate state-of-the-art performance. Finally, we discuss our reflection on existing methods and open challenges for 3D human avatar modeling, shedding light on future research."}