{"paperId":"1e79e33c77b2d8eaf643af0e1f5003057d7356b2","externalIds":{"ArXiv":"2211.00216","DBLP":"journals/corr/abs-2211-00216","DOI":"10.1145/3648358","CorpusId":253244599},"title":"Distributed Graph Neural Network Training: A Survey","openAccessPdf":{"url":"https://arxiv.org/pdf/2211.00216","status":"GREEN","license":null,"disclaimer":"Notice: Paper or abstract available at https://arxiv.org/abs/2211.00216, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."},"authors":[{"authorId":"2237813","name":"Yingxia Shao"},{"authorId":"2120465346","name":"Hongzheng Li"},{"authorId":"2189438756","name":"Xizhi Gu"},{"authorId":"2087123822","name":"Hongbo Yin"},{"authorId":"2154547483","name":"Yawen Li"},{"authorId":"1720763480","name":"Xupeng Miao"},{"authorId":"2108232566","name":"Wentao Zhang"},{"authorId":"2068228300","name":"Bin Cui"},{"authorId":null,"name":"Lei Chen"}],"abstract":"Graph neural networks (GNNs) are a type of deep learning models that are trained on graphs and have been successfully applied in various domains. Despite the effectiveness of GNNs, it is still challenging for GNNs to efficiently scale to large graphs. As a remedy, distributed computing becomes a promising solution of training large-scale GNNs, since it is able to provide abundant computing resources. However, the dependency of graph structure increases the difficulty of achieving high-efficiency distributed GNN training, which suffers from the massive communication and workload imbalance. In recent years, many efforts have been made on distributed GNN training, and an array of training algorithms and systems have been proposed. Yet, there is a lack of systematic review of the optimization techniques for the distributed execution of GNN training. In this survey, we analyze three major challenges in distributed GNN training: massive feature communication, the loss of model accuracy, and workload imbalance. Then, we introduce a new taxonomy for the optimization techniques in distributed GNN training that address the above challenges. The new taxonomy classifies existing techniques into four categories: GNN data partition, GNN batch generation, GNN execution model, and GNN communication protocol. We carefully discuss the techniques in each category. In the conclusion, we summarize existing distributed GNN systems for multi–graphics processing units (GPUs), GPU-clusters and central processing unit (CPU)-clusters, respectively, and present a discussion about the future direction of distributed GNN training."}