{"paperId":"e999bd1eb04c4343ca725a2e461ee5d1806be11e","externalIds":{"ArXiv":"2312.05391","DBLP":"journals/corr/abs-2312-05391","DOI":"10.48550/arXiv.2312.05391","CorpusId":266162529},"title":"Loss Functions in the Era of Semantic Segmentation: A Survey and Outlook","openAccessPdf":{"url":"","status":null,"license":null,"disclaimer":"Notice: Paper or abstract available at https://arxiv.org/abs/2312.05391, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."},"authors":[{"authorId":"1763181","name":"Reza Azad"},{"authorId":"2273500217","name":"Moein Heidary"},{"authorId":"2247945495","name":"Kadir Yilmaz"},{"authorId":"2237423605","name":"Michael Huttemann"},{"authorId":"2172731416","name":"Sanaz Karimijafarbigloo"},{"authorId":"2107945355","name":"Yuli Wu"},{"authorId":"2274931566","name":"Anke Schmeink"},{"authorId":"1737693","name":"D. Merhof"}],"abstract":"Semantic image segmentation, the process of classifying each pixel in an image into a particular class, plays an important role in many visual understanding systems. As the predominant criterion for evaluating the performance of statistical models, loss functions are crucial for shaping the development of deep learning-based segmentation algorithms and improving their overall performance. To aid researchers in identifying the optimal loss function for their particular application, this survey provides a comprehensive and unified review of $25$ loss functions utilized in image segmentation. We provide a novel taxonomy and thorough review of how these loss functions are customized and leveraged in image segmentation, with a systematic categorization emphasizing their significant features and applications. Furthermore, to evaluate the efficacy of these methods in real-world scenarios, we propose unbiased evaluations of some distinct and renowned loss functions on established medical and natural image datasets. We conclude this review by identifying current challenges and unveiling future research opportunities. Finally, we have compiled the reviewed studies that have open-source implementations on our GitHub page."}