{"paperId":"b51d1946a6184946c93809d06942aa410c384203","externalIds":{"ArXiv":"2409.02795","DBLP":"journals/corr/abs-2409-02795","CorpusId":272397953},"title":"Towards a Unified View of Preference Learning for Large Language Models: A Survey","openAccessPdf":{"url":"","status":null,"license":null,"disclaimer":"Notice: Paper or abstract available at https://arxiv.org/abs/2409.02795, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."},"authors":[{"authorId":"2186406832","name":"Bofei Gao"},{"authorId":"66947198","name":"Feifan Song"},{"authorId":"2319604149","name":"Yibo Miao"},{"authorId":"2117632647","name":"Zefan Cai"},{"authorId":"2257389788","name":"Zhe Yang"},{"authorId":"2286955403","name":"Liang Chen"},{"authorId":"2266695201","name":"Helan Hu"},{"authorId":"1748844142","name":"Runxin Xu"},{"authorId":"2047143813","name":"Qingxiu Dong"},{"authorId":"2113919886","name":"Ce Zheng"},{"authorId":"2325151882","name":"Shanghaoran Quan"},{"authorId":"2304627872","name":"Wen Xiao"},{"authorId":"2319593518","name":"Ge Zhang"},{"authorId":"2134434187","name":"Daoguang Zan"},{"authorId":"2304717248","name":"Keming Lu"},{"authorId":"2249451832","name":"Bowen Yu"},{"authorId":"2248487202","name":"Dayiheng Liu"},{"authorId":"2248072386","name":"Zeyu Cui"},{"authorId":"2319616826","name":"Jian Yang"},{"authorId":"39058310","name":"Lei Sha"},{"authorId":"2284129758","name":"Houfeng Wang"},{"authorId":"2287829088","name":"Zhifang Sui"},{"authorId":"2284076735","name":"Peiyi Wang"},{"authorId":"2311842337","name":"Tianyu Liu"},{"authorId":"2261083637","name":"Baobao Chang"}],"abstract":"Large Language Models (LLMs) exhibit remarkably powerful capabilities. One of the crucial factors to achieve success is aligning the LLM's output with human preferences. This alignment process often requires only a small amount of data to efficiently enhance the LLM's performance. While effective, research in this area spans multiple domains, and the methods involved are relatively complex to understand. The relationships between different methods have been under-explored, limiting the development of the preference alignment. In light of this, we break down the existing popular alignment strategies into different components and provide a unified framework to study the current alignment strategies, thereby establishing connections among them. In this survey, we decompose all the strategies in preference learning into four components: model, data, feedback, and algorithm. This unified view offers an in-depth understanding of existing alignment algorithms and also opens up possibilities to synergize the strengths of different strategies. Furthermore, we present detailed working examples of prevalent existing algorithms to facilitate a comprehensive understanding for the readers. Finally, based on our unified perspective, we explore the challenges and future research directions for aligning large language models with human preferences."}