{"paperId":"96e4ecbbe0b1234bb8316d0f6779d78635584cad","externalIds":{"DBLP":"journals/corr/abs-2304-10755","ArXiv":"2304.10755","DOI":"10.48550/arXiv.2304.10755","CorpusId":258291741},"title":"Interpretable and Robust AI in EEG Systems: A Survey","openAccessPdf":{"url":"https://arxiv.org/pdf/2304.10755","status":"GREEN","license":null,"disclaimer":"Notice: Paper or abstract available at https://arxiv.org/abs/2304.10755, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."},"authors":[{"authorId":"1637883582","name":"Xin-qiu Zhou"},{"authorId":"2331614243","name":"Chenyu Liu"},{"authorId":"2810171","name":"Liming Zhai"},{"authorId":"47301741","name":"Ziyu Jia"},{"authorId":"145836900","name":"Cuntai Guan"},{"authorId":"2152802006","name":"Yang Liu"}],"abstract":"The close coupling of artificial intelligence (AI) and electroencephalography (EEG) has substantially advanced human-computer interaction (HCI) technologies in the AI era. Different from traditional EEG systems, the interpretability and robustness of AI-based EEG systems are becoming particularly crucial. The interpretability clarifies the inner working mechanisms of AI models and thus can gain the trust of users. The robustness reflects the AI's reliability against attacks and perturbations, which is essential for sensitive and fragile EEG signals. Thus the interpretability and robustness of AI in EEG systems have attracted increasing attention, and their research has achieved great progress recently. However, there is still no survey covering recent advances in this field. In this paper, we present the first comprehensive survey and summarize the interpretable and robust AI techniques for EEG systems. Specifically, we first propose a taxonomy of interpretability by characterizing it into three types: backpropagation, perturbation, and inherently interpretable methods. Then we classify the robustness mechanisms into four classes: noise and artifacts, human variability, data acquisition instability, and adversarial attacks. Finally, we identify several critical and unresolved challenges for interpretable and robust AI in EEG systems and further discuss their future directions."}