{"paperId":"cdf25a7977add35ce94dbcde099fe946a21ca13b","externalIds":{"ArXiv":"2409.01207","CorpusId":275118531},"title":"Towards General Industrial Intelligence: A Survey of Continual Large Models in Industrial IoT","openAccessPdf":{"url":"","status":null,"license":null,"disclaimer":"Notice: Paper or abstract available at https://arxiv.org/abs/2409.01207, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."},"authors":[{"authorId":"2156617825","name":"Jiao Chen"},{"authorId":"2324928346","name":"Jiayi He"},{"authorId":"2284100848","name":"Fangfang Chen"},{"authorId":"2257001218","name":"Zuohong Lv"},{"authorId":"2257337330","name":"Jianhua Tang"},{"authorId":"2319428184","name":"Weihua Li"},{"authorId":"2319386080","name":"Zuozhu Liu"},{"authorId":"2319500743","name":"Howard H. Yang"},{"authorId":"2319595053","name":"Guangjie Han"}],"abstract":"Industrial AI is transitioning from traditional deep learning models to large-scale transformer-based architectures, with the Industrial Internet of Things (IIoT) playing a pivotal role. IIoT evolves from a simple data pipeline to an intelligent infrastructure, enabling and enhancing these advanced AI systems. This survey explores the integration of IIoT with large models (LMs) and their potential applications in industrial environments. We focus on four primary types of industrial LMs: language-based, vision-based, time-series, and multimodal models. The lifecycle of LMs is segmented into four critical phases: data foundation, model training, model connectivity, and continuous evolution. First, we analyze how IIoT provides abundant and diverse data resources, supporting the training and fine-tuning of LMs. Second, we discuss how IIoT offers an efficient training infrastructure in low-latency and bandwidth-optimized environments. Third, we highlight the deployment advantages of LMs within IIoT, emphasizing IIoT's role as a connectivity nexus fostering emergent intelligence through modular design, dynamic routing, and model merging to enhance system scalability and adaptability. Finally, we demonstrate how IIoT supports continual learning mechanisms, enabling LMs to adapt to dynamic industrial conditions and ensure long-term effectiveness. This paper underscores IIoT's critical role in the evolution of industrial intelligence with large models, offering a theoretical framework and actionable insights for future research."}