{"paperId":"0a3a1c427f74d5ab78946a3092ad38cdfcd9a98a","externalIds":{"ArXiv":"2406.12844","DBLP":"journals/corr/abs-2406-12844","DOI":"10.48550/arXiv.2406.12844","CorpusId":270562277},"title":"Synergizing Foundation Models and Federated Learning: A Survey","openAccessPdf":{"url":"","status":null,"license":null,"disclaimer":"Notice: Paper or abstract available at https://arxiv.org/abs/2406.12844, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."},"authors":[{"authorId":"2153701276","name":"Shenghui Li"},{"authorId":"2238619310","name":"Fanghua Ye"},{"authorId":"2258710828","name":"Meng Fang"},{"authorId":"2243705178","name":"Jiaxu Zhao"},{"authorId":"2165520497","name":"Yun-Hin Chan"},{"authorId":"2257273234","name":"Edith C. H. Ngai"},{"authorId":"2240143937","name":"Thiemo Voigt"}],"abstract":"Over the past few years, the landscape of Artificial Intelligence (AI) has been reshaped by the emergence of Foundation Models (FMs). Pre-trained on massive datasets, these models exhibit exceptional performance across diverse downstream tasks through adaptation techniques like fine-tuning and prompt learning. More recently, the synergy of FMs and Federated Learning (FL) has emerged as a promising paradigm, often termed Federated Foundation Models (FedFM), allowing for collaborative model adaptation while preserving data privacy. This survey paper provides a systematic review of the current state of the art in FedFM, offering insights and guidance into the evolving landscape. Specifically, we present a comprehensive multi-tiered taxonomy based on three major dimensions, namely efficiency, adaptability, and trustworthiness. To facilitate practical implementation and experimental research, we undertake a thorough review of existing libraries and benchmarks. Furthermore, we discuss the diverse real-world applications of this paradigm across multiple domains. Finally, we outline promising research directions to foster future advancements in FedFM. Overall, this survey serves as a resource for researchers and practitioners, offering a thorough understanding of FedFM's role in revolutionizing privacy-preserving AI and pointing toward future innovations in this promising area. A periodically updated paper collection on FM-FL is available at https://github.com/lishenghui/awesome-fm-fl."}