{"paperId":"102c635a94eefbb662554cecc3443f693086b0c2","externalIds":{"ArXiv":"2405.10630","DBLP":"journals/corr/abs-2405-10630","DOI":"10.48550/arXiv.2405.10630","CorpusId":269899903},"title":"Medical Dialogue: A Survey of Categories, Methods, Evaluation and Challenges","openAccessPdf":{"url":"","status":null,"license":null,"disclaimer":"Notice: Paper or abstract available at https://arxiv.org/abs/2405.10630, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."},"authors":[{"authorId":"2261087633","name":"Xiaoming Shi"},{"authorId":"2109371626","name":"Zeming Liu"},{"authorId":"2302528265","name":"Li Du"},{"authorId":"2302477959","name":"Yuxuan Wang"},{"authorId":"2302212749","name":"Hongru Wang"},{"authorId":"2265608879","name":"Yuhang Guo"},{"authorId":"2287928656","name":"Tong Ruan"},{"authorId":"2280904043","name":"Jie Xu"},{"authorId":"2267720309","name":"Shaoting Zhang"}],"abstract":"This paper surveys and organizes research works on medical dialog systems, which is an important yet challenging task. Although these systems have been surveyed in the medical community from an application perspective, a systematic review from a rigorous technical perspective has to date remained noticeably absent. As a result, an overview of the categories, methods, and evaluation of medical dialogue systems remain limited and underspecified, hindering the further improvement of this area. To fill this gap, we investigate an initial pool of 325 papers from well-known computer science, and natural language processing conferences and journals, and make an overview. Recently, large language models have shown strong model capacity on downstream tasks, which also reshaped medical dialog systems' foundation. Despite the alluring practical application value, current medical dialogue systems still suffer from problems. To this end, this paper lists the grand challenges of medical dialog systems, especially of large language models."}