{"paperId":"6b3a5072a0e536bbb89b4b8cbc3fd7c1e95220c8","externalIds":{"DBLP":"journals/corr/abs-2405-17495","ArXiv":"2405.17495","DOI":"10.1145/3720539","CorpusId":270067657},"title":"Vertical Federated Learning for Effectiveness, Security, Applicability: A Survey","openAccessPdf":{"url":"https://arxiv.org/pdf/2405.17495","status":"GREEN","license":null,"disclaimer":"Notice: Paper or abstract available at https://arxiv.org/abs/2405.17495, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."},"authors":[{"authorId":"2266392323","name":"Mang Ye"},{"authorId":"2281008240","name":"Wei Shen"},{"authorId":"2237966212","name":"Bo Du"},{"authorId":"21628132","name":"E. Snezhko"},{"authorId":"2241550508","name":"Vassili Kovalev"},{"authorId":"83069217","name":"PongChi Yuen"}],"abstract":"Vertical Federated Learning (VFL) is a privacy-preserving distributed learning paradigm where different parties collaboratively learn models with partitioned features of shared samples without leaking private data. Recent research has shown promising results addressing various challenges in VFL, highlighting its potential for practical applications in cross-domain collaboration. However, the corresponding research is scattered and lacks organization. To advance VFL research, this survey offers a systematic overview of recent developments. First, we provide a history and background introduction, along with a summary of the general training protocol of VFL. We then revisit the taxonomy in recent reviews and analyze limitations in-depth. For a comprehensive and structured discussion, we synthesize recent research from three fundamental perspectives: effectiveness, security, and applicability. Finally, we discuss several critical future research directions in VFL, which will facilitate the developments in this field. We provide a collection of research lists and periodically update them at https://github.com/shentt67/VFL_Survey."}