{"paperId":"16baffb978763f349cc496cb0a908f0774e977a8","externalIds":{"DBLP":"journals/nn/JuFGLLQQSSXYYZWLZ24","ArXiv":"2304.05055","DOI":"10.1016/j.neunet.2024.106207","CorpusId":258060205,"PubMed":"38442651"},"title":"A Comprehensive Survey on Deep Graph Representation Learning","openAccessPdf":{"url":"https://arxiv.org/pdf/2304.05055","status":"GREEN","license":null,"disclaimer":"Notice: Paper or abstract available at https://arxiv.org/abs/2304.05055, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."},"authors":[{"authorId":"2154453854","name":"Wei Ju"},{"authorId":"2072875510","name":"Zheng Fang"},{"authorId":"2112579634","name":"Yiyang Gu"},{"authorId":"2109372136","name":"Zequn Liu"},{"authorId":"50059334","name":"Qingqing Long"},{"authorId":"1504635093","name":"Ziyue Qiao"},{"authorId":"2420154","name":"Yifang Qin"},{"authorId":"2115733983","name":"Jianhao Shen"},{"authorId":"150105578","name":"Fangce Sun"},{"authorId":"3384837","name":"Zhiping Xiao"},{"authorId":"2156028239","name":"Junwei Yang"},{"authorId":"2214118441","name":"Jingyang Yuan"},{"authorId":"2124210104","name":"Yusheng Zhao"},{"authorId":"145263905","name":"Xiao Luo"},{"authorId":"2118541421","name":"Ming Zhang"}],"abstract":"Graph representation learning aims to effectively encode high-dimensional sparse graph-structured data into low-dimensional dense vectors, which is a fundamental task that has been widely studied in a range of fields, including machine learning and data mining. Classic graph embedding methods follow the basic idea that the embedding vectors of interconnected nodes in the graph can still maintain a relatively close distance, thereby preserving the structural information between the nodes in the graph. However, this is sub-optimal due to: (i) traditional methods have limited model capacity which limits the learning performance; (ii) existing techniques typically rely on unsupervised learning strategies and fail to couple with the latest learning paradigms; (iii) representation learning and downstream tasks are dependent on each other which should be jointly enhanced. With the remarkable success of deep learning, deep graph representation learning has shown great potential and advantages over shallow (traditional) methods, there exist a large number of deep graph representation learning techniques have been proposed in the past decade, especially graph neural networks. In this survey, we conduct a comprehensive survey on current deep graph representation learning algorithms by proposing a new taxonomy of existing state-of-the-art literature. Specifically, we systematically summarize the essential components of graph representation learning and categorize existing approaches by the ways of graph neural network architectures and the most recent advanced learning paradigms. Moreover, this survey also provides the practical and promising applications of deep graph representation learning. Last but not least, we state new perspectives and suggest challenging directions which deserve further investigations in the future."}