{"paperId":"c35b8dad08e11a77c249c0aed2b2f7f9ba853acd","externalIds":{"DBLP":"journals/corr/abs-2404-02039","ArXiv":"2404.02039","DOI":"10.48550/arXiv.2404.02039","CorpusId":268856673},"title":"A Survey on Large Language Model-Based Game Agents","openAccessPdf":{"url":"","status":null,"license":null,"disclaimer":"Notice: Paper or abstract available at https://arxiv.org/abs/2404.02039, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."},"authors":[{"authorId":"2254156032","name":"Sihao Hu"},{"authorId":"2253860508","name":"Tiansheng Huang"},{"authorId":"2046866873","name":"Fatih Ilhan"},{"authorId":"2066601176","name":"S. Tekin"},{"authorId":"2238141480","name":"Gaowen Liu"},{"authorId":"2828296","name":"R. Kompella"},{"authorId":"2254270304","name":"Ling Liu"}],"abstract":"Game environments provide rich, controllable settings that stimulate many aspects of real-world complexity. As such, game agents offer a valuable testbed for exploring capabilities relevant to Artificial General Intelligence. Recently, the emergence of Large Language Models (LLMs) provides new opportunities to endow these agents with generalizable reasoning, memory, and adaptability in complex game environments. This survey offers an up-to-date review of LLM-based game agents (LLMGAs) through a unified reference architecture. At the single-agent level, we synthesize existing studies around three core components: memory, reasoning, and perception-action interfaces, which jointly characterize how language enables agents to perceive, think, and act. At the multi-agent level, we outline how communication protocols and organizational models support coordination, role differentiation, and large-scale social behaviors. To contextualize these designs, we introduce a challenge-centered taxonomy linking six major game genres to their dominant agent requirements, from low-latency control in action games to open-ended goal formation in sandbox worlds. A curated list of related papers is available at https://github.com/git-disl/awesome-LLM-game-agent-papers"}