{"paperId":"bfc5770dd7c4a3ba90d9a660909ed6936b001efd","externalIds":{"ArXiv":"2306.04945","DBLP":"journals/corr/abs-2306-04945","DOI":"10.48550/arXiv.2306.04945","CorpusId":259108865},"title":"Modern Data Pricing Models: Taxonomy and Comprehensive Survey","openAccessPdf":{"url":"http://arxiv.org/pdf/2306.04945","status":"CLOSED","license":null,"disclaimer":"Notice: Paper or abstract available at https://arxiv.org/abs/2306.04945, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."},"authors":[{"authorId":"1934246","name":"Xiaoye Miao"},{"authorId":"47837729","name":"Huanhuan Peng"},{"authorId":"2210947922","name":"Xinyu Huang"},{"authorId":"2115384591","name":"Lu Chen"},{"authorId":"1409828392","name":"Yunjun Gao"},{"authorId":"2152938218","name":"Jianwei Yin"}],"abstract":"Data play an increasingly important role in smart data analytics, which facilitate many data-driven applications. The goal of various data markets aims to alleviate the issue of isolated data islands, so as to benefit data circulation. The problem of data pricing is indispensable yet challenging in data trade. In this paper, we conduct a comprehensive survey on the modern data pricing solutions. We divide the data pricing solutions into three major strategies and thirteen models, including query pricing strategy, feature-based data pricing strategy, and pricing strategy in machine learning. It is so far the first attempt to classify so many existing data pricing models. Moreover, we not only elaborate the thirteen specific pricing models within each pricing strategy, but also make in-depth analyses among these models. We also conclude five research directions for the data pricing field, and put forward some novel and interesting data pricing topics. This paper aims at gaining better insights, and directing the future research towards practical and sophisticated pricing mechanisms for better data trade and share."}