{"paperId":"0479547a69ffa48fe106137eba8358a9d8a2cc48","externalIds":{"ArXiv":"2405.17935","DBLP":"journals/corr/abs-2405-17935","DOI":"10.1007/s11704-024-40678-2","CorpusId":270067624},"title":"Tool learning with large language models: a survey","openAccessPdf":{"url":"","status":null,"license":null,"disclaimer":"Notice: Paper or abstract available at https://arxiv.org/abs/2405.17935, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."},"authors":[{"authorId":"2303401638","name":"Changle Qu"},{"authorId":"2155892801","name":"Sunhao Dai"},{"authorId":"2274221772","name":"Xiaochi Wei"},{"authorId":"2274199835","name":"Hengyi Cai"},{"authorId":"2237948548","name":"Shuaiqiang Wang"},{"authorId":"2243455567","name":"Dawei Yin"},{"authorId":"2304023172","name":"Jun Xu"},{"authorId":"2113341834","name":"Jirong Wen"}],"abstract":"Recently, tool learning with large language models (LLMs) has emerged as a promising paradigm for augmenting the capabilities of LLMs to tackle highly complex problems. Despite growing attention and rapid advancements in this field, the existing literature remains fragmented and lacks systematic organization, posing barriers to entry for newcomers. This gap motivates us to conduct a comprehensive survey of existing works on tool learning with LLMs. In this survey, we focus on reviewing existing literature from the two primary aspects (1) why tool learning is beneficial and (2) how tool learning is implemented, enabling a comprehensive understanding of tool learning with LLMs. We first explore the “why” by reviewing both the benefits of tool integration and the inherent benefits of the tool learning paradigm from six specific aspects. In terms of “how”, we systematically review the literature according to a taxonomy of four key stages in the tool learning workflow: task planning, tool selection, tool calling, and response generation. Additionally, we provide a detailed summary of existing benchmarks and evaluation methods, categorizing them according to their relevance to different stages. Finally, we discuss current challenges and outline potential future directions, aiming to inspire both researchers and industrial developers to further explore this emerging and promising area."}