{"paperId":"a0e40d9a07fdc5848ef2f10d9b63f5c28e0cec03","externalIds":{"DBLP":"journals/corr/abs-2305-11537","ArXiv":"2305.11537","DOI":"10.48550/arXiv.2305.11537","CorpusId":258823036},"title":"Trustworthy Federated Learning: A Survey","openAccessPdf":{"url":"http://arxiv.org/pdf/2305.11537","status":"CLOSED","license":null,"disclaimer":"Notice: Paper or abstract available at https://arxiv.org/abs/2305.11537, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."},"authors":[{"authorId":"1622963157","name":"A. Tariq"},{"authorId":"2394689","name":"M. Serhani"},{"authorId":"3032985","name":"F. Sallabi"},{"authorId":"117605364","name":"Tariq Qayyum"},{"authorId":"2559225","name":"E. Barka"},{"authorId":"145674819","name":"K. Shuaib"}],"abstract":"Federated Learning (FL) has emerged as a significant advancement in the field of Artificial Intelligence (AI), enabling collaborative model training across distributed devices while maintaining data privacy. As the importance of FL increases, addressing trustworthiness issues in its various aspects becomes crucial. In this survey, we provide an extensive overview of the current state of Trustworthy FL, exploring existing solutions and well-defined pillars relevant to Trustworthy . Despite the growth in literature on trustworthy centralized Machine Learning (ML)/Deep Learning (DL), further efforts are necessary to identify trustworthiness pillars and evaluation metrics specific to FL models, as well as to develop solutions for computing trustworthiness levels. We propose a taxonomy that encompasses three main pillars: Interpretability, Fairness, and Security&Privacy. Each pillar represents a dimension of trust, further broken down into different notions. Our survey covers trustworthiness challenges at every level in FL settings. We present a comprehensive architecture of Trustworthy FL, addressing the fundamental principles underlying the concept, and offer an in-depth analysis of trust assessment mechanisms. In conclusion, we identify key research challenges related to every aspect of Trustworthy FL and suggest future research directions. This comprehensive survey serves as a valuable resource for researchers and practitioners working on the development and implementation of Trustworthy FL systems, contributing to a more secure and reliable AI landscape."}