{"paperId":"001cca7910f507f7f75b8402b826c2dc07afef00","externalIds":{"DBLP":"journals/corr/abs-2401-00625","ArXiv":"2401.00625","DOI":"10.48550/arXiv.2401.00625","CorpusId":266693677},"title":"Beyond Efficiency: A Systematic Survey of Resource-Efficient Large Language Models","openAccessPdf":{"url":"","status":null,"license":null,"disclaimer":"Notice: Paper or abstract available at https://arxiv.org/abs/2401.00625, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."},"authors":[{"authorId":"7583867","name":"Guangji Bai"},{"authorId":"1712184172","name":"Zheng Chai"},{"authorId":"2219702470","name":"Chen Ling"},{"authorId":"2130352205","name":"Shiyu Wang"},{"authorId":"2277715552","name":"Jiaying Lu"},{"authorId":"2277696647","name":"Nan Zhang"},{"authorId":"2277246146","name":"Tingwei Shi"},{"authorId":"2220480304","name":"Ziyang Yu"},{"authorId":"2277246079","name":"Mengdan Zhu"},{"authorId":"2225551885","name":"Yifei Zhang"},{"authorId":"2238138844","name":"Carl Yang"},{"authorId":"2257750793","name":"Yue Cheng"},{"authorId":"2253942086","name":"Liang Zhao"}],"abstract":"The burgeoning field of Large Language Models (LLMs), exemplified by sophisticated models like OpenAI's ChatGPT, represents a significant advancement in artificial intelligence. These models, however, bring forth substantial challenges in the high consumption of computational, memory, energy, and financial resources, especially in environments with limited resource capabilities. This survey aims to systematically address these challenges by reviewing a broad spectrum of techniques designed to enhance the resource efficiency of LLMs. We categorize methods based on their optimization focus: computational, memory, energy, financial, and network resources and their applicability across various stages of an LLM's lifecycle, including architecture design, pretraining, finetuning, and system design. Additionally, the survey introduces a nuanced categorization of resource efficiency techniques by their specific resource types, which uncovers the intricate relationships and mappings between various resources and corresponding optimization techniques. A standardized set of evaluation metrics and datasets is also presented to facilitate consistent and fair comparisons across different models and techniques. By offering a comprehensive overview of the current sota and identifying open research avenues, this survey serves as a foundational reference for researchers and practitioners, aiding them in developing more sustainable and efficient LLMs in a rapidly evolving landscape."}