{"paperId":"e3c7262cb541bf6e72e4e932e9369424dc6a0551","externalIds":{"DBLP":"journals/corr/abs-2404-02817","ArXiv":"2404.02817","DOI":"10.1109/TMECH.2024.3452509","CorpusId":268875890},"title":"A Survey of Optimization-Based Task and Motion Planning: From Classical to Learning Approaches","openAccessPdf":{"url":"","status":null,"license":null,"disclaimer":"Notice: Paper or abstract available at https://arxiv.org/abs/2404.02817, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."},"authors":[{"authorId":"2214963761","name":"Zhigen Zhao"},{"authorId":"2232588215","name":"Shuo Cheng"},{"authorId":"2110668031","name":"Yan Ding"},{"authorId":"2121298138","name":"Ziyi Zhou"},{"authorId":"2257315750","name":"Shiqi Zhang"},{"authorId":"2260291195","name":"Danfei Xu"},{"authorId":"2258781763","name":"Ye Zhao"}],"abstract":"Task and motion planning (TAMP) integrates high-level task planning and low-level motion planning to equip robots with the autonomy to effectively reason over long-horizon, dynamic tasks. Optimization-based TAMP focuses on hybrid optimization approaches that define goal conditions via objective functions and are capable of handling open-ended goals, robotic dynamics, and physical interaction between the robot and the environment. Therefore, optimization-based TAMP is particularly suited to solve highly complex, contact-rich locomotion and manipulation problems. This survey provides a comprehensive review on optimization-based TAMP, covering first, planning domain representations, including action description languages and temporal logic, second, individual solution strategies for components of TAMP, including AI planning and trajectory optimization (TO), and finally, the dynamic interplay between logic-based task planning and model-based TO. A particular focus of this survey is to highlight the algorithm structures to efficiently solve TAMP, especially hierarchical and distributed approaches. In addition, the survey emphasizes the synergy between the classical methods and contemporary learning-based innovations, such as large language models. Furthermore, the future research directions for TAMP is discussed in this survey, highlighting both algorithmic and application-specific challenges."}