{"paperId":"d6d0945a663bd5892ab4055cc54f63357baa4f94","externalIds":{"ArXiv":"2403.11821","DBLP":"journals/tvcg/HartwigESKPPGBR25","DOI":"10.1109/TVCG.2025.3585077","CorpusId":275954373,"PubMed":"40591468"},"title":"A Survey on Quality Metrics for Text-to-Image Generation","openAccessPdf":{"url":"","status":null,"license":null,"disclaimer":"Notice: Paper or abstract available at https://arxiv.org/abs/2403.11821, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."},"authors":[{"authorId":"2059953651","name":"Sebastian Hartwig"},{"authorId":"2068931589","name":"Dominik Engel"},{"authorId":"2237803100","name":"Leon Sick"},{"authorId":"1988768858","name":"H. Kniesel"},{"authorId":"2106231920","name":"Tristan Payer"},{"authorId":"2302687585","name":"Poonam Poonam"},{"authorId":"2239205058","name":"Michael Glöckler"},{"authorId":"51222025","name":"Alex Bäuerle"},{"authorId":"2237803635","name":"Timo Ropinski"}],"abstract":"AI-based text-to-image models do not only excel at generating realistic images, they also give designers more and more fine-grained control over the image content. Consequently, these approaches have gathered increased attention within the computer graphics research community, which has been historically devoted towards traditional rendering techniques, that offer precise control over scene parameters (e.g., objects, materials, and lighting). While the quality of conventionally rendered images is assessed through well established image quality metrics, such as SSIM or PSNR, the unique challenges of text-to-image generation require other, dedicated quality metrics. These metrics must be able to not only measure overall image quality, but also how well images reflect given text prompts, whereby the control of scene and rendering parameters is interweaved. Within this survey, we provide a comprehensive overview of such text-to-image quality metrics, and propose a taxonomy to categorize these metrics. Our taxonomy is grounded in the assumption, that there are two main quality criteria, namely compositional quality and general quality, that contribute to the overall image quality. Besides the metrics, this survey covers dedicated text-to-image benchmark datasets, over which the metrics are frequently computed. Finally, we identify limitations and open challenges in the field of text-to-image generation, and derive guidelines for practitioners conducting text-to-image evaluation."}