{"paperId":"20c358cb4482cecc0bdeb65278435459ac4bb541","externalIds":{"ArXiv":"2304.13807","DBLP":"journals/corr/abs-2304-13807","DOI":"10.48550/arXiv.2304.13807","CorpusId":258352430},"title":"A Survey on Solving and Discovering Differential Equations Using Deep Neural Networks","openAccessPdf":{"url":"http://arxiv.org/pdf/2304.13807","status":"GREEN","license":null,"disclaimer":"Notice: Paper or abstract available at https://arxiv.org/abs/2304.13807, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."},"authors":[{"authorId":"91717841","name":"Hyeonjung Jung"},{"authorId":"152697699","name":"Jayant Gupta"},{"authorId":"2212139082","name":"Bharat Jayaprakash"},{"authorId":"52182265","name":"Matthew J. Eagon"},{"authorId":"2087050931","name":"H. Selvam"},{"authorId":"2135942296","name":"Carl Molnar"},{"authorId":"2945490","name":"W. Northrop"},{"authorId":"2113354821","name":"Shashi Shekhar"}],"abstract":"Ordinary and partial differential equations (DE) are used extensively in scientific and mathematical domains to model physical systems. Current literature has focused primarily on deep neural network (DNN) based methods for solving a specific DE or a family of DEs. Research communities with a history of using DE models may view DNN-based differential equation solvers (DNN-DEs) as a faster and transferable alternative to current numerical methods. However, there is a lack of systematic surveys detailing the use of DNN-DE methods across physical application domains and a generalized taxonomy to guide future research. This paper surveys and classifies previous works and provides an educational tutorial for senior practitioners, professionals, and graduate students in engineering and computer science. First, we propose a taxonomy to navigate domains of DE systems studied under the umbrella of DNN-DE. Second, we examine the theory and performance of the Physics Informed Neural Network (PINN) to demonstrate how the influential DNN-DE architecture mathematically solves a system of equations. Third, to reinforce the key ideas of solving and discovery of DEs using DNN, we provide a tutorial using DeepXDE, a Python package for developing PINNs, to develop DNN-DEs for solving and discovering a classic DE, the linear transport equation."}