{"paperId":"81a4fd3004df0eb05d6c1cef96ad33d5407820df","externalIds":{"DBLP":"journals/tnn/WuPCLZY21","MAG":"2907492528","ArXiv":"1901.00596","DOI":"10.1109/TNNLS.2020.2978386","CorpusId":57375753,"PubMed":"32217482"},"title":"A Comprehensive Survey on Graph Neural Networks","openAccessPdf":{"url":"https://doi.org/10.1109/tnnls.2020.2978386","status":"HYBRID","license":"publisher-specific-oa","disclaimer":"Notice: Paper or abstract available at https://arxiv.org/abs/1901.00596, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."},"authors":[{"authorId":"2109557884","name":"Zonghan Wu"},{"authorId":"2585415","name":"Shirui Pan"},{"authorId":"31370754","name":"Fengwen Chen"},{"authorId":"2062835","name":"Guodong Long"},{"authorId":"48934799","name":"Chengqi Zhang"},{"authorId":"144019071","name":"Philip S. Yu"}],"abstract":"Deep learning has revolutionized many machine learning tasks in recent years, ranging from image classification and video processing to speech recognition and natural language understanding. The data in these tasks are typically represented in the Euclidean space. However, there is an increasing number of applications, where data are generated from non-Euclidean domains and are represented as graphs with complex relationships and interdependency between objects. The complexity of graph data has imposed significant challenges on the existing machine learning algorithms. Recently, many studies on extending deep learning approaches for graph data have emerged. In this article, we provide a comprehensive overview of graph neural networks (GNNs) in data mining and machine learning fields. We propose a new taxonomy to divide the state-of-the-art GNNs into four categories, namely, recurrent GNNs, convolutional GNNs, graph autoencoders, and spatial–temporal GNNs. We further discuss the applications of GNNs across various domains and summarize the open-source codes, benchmark data sets, and model evaluation of GNNs. Finally, we propose potential research directions in this rapidly growing field."}