{"paperId":"9212ba44efe8890f9825b7d91adb775ef13772e5","externalIds":{"ArXiv":"2302.08571","DOI":"10.3390/ai4030039","CorpusId":257020072},"title":"A Comprehensive Review and a Taxonomy of Edge Machine Learning: Requirements, Paradigms, and Techniques","openAccessPdf":{"url":"https://www.mdpi.com/2673-2688/4/3/39/pdf?version=1694599479","status":"GOLD","license":"CCBY","disclaimer":"Notice: Paper or abstract available at https://arxiv.org/abs/2302.08571, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."},"authors":[{"authorId":"35660603","name":"Wenbin Li"},{"authorId":"1726350","name":"Hakim Hacid"},{"authorId":"1967677","name":"Ebtesam Almazrouei"},{"authorId":"145118318","name":"M. Debbah"}],"abstract":"The union of Edge Computing (EC) and Artificial Intelligence (AI) has brought forward the Edge AI concept to provide intelligent solutions close to the end-user environment, for privacy preservation, low latency to real-time performance, and resource optimization. Machine Learning (ML), as the most advanced branch of AI in the past few years, has shown encouraging results and applications in the edge environment. Nevertheless, edge-powered ML solutions are more complex to realize due to the joint constraints from both edge computing and AI domains, and the corresponding solutions are expected to be efficient and adapted in technologies such as data processing, model compression, distributed inference, and advanced learning paradigms for Edge ML requirements. Despite the fact that a great deal of the attention garnered by Edge ML is gained in both the academic and industrial communities, we noticed the lack of a complete survey on existing Edge ML technologies to provide a common understanding of this concept. To tackle this, this paper aims at providing a comprehensive taxonomy and a systematic review of Edge ML techniques, focusing on the soft computing aspects of existing paradigms and techniques. We start by identifying the Edge ML requirements driven by the joint constraints. We then extensively survey more than twenty paradigms and techniques along with their representative work, covering two main parts: edge inference, and edge learning. In particular, we analyze how each technique fits into Edge ML by meeting a subset of the identified requirements. We also summarize Edge ML frameworks and open issues to shed light on future directions for Edge ML."}