{"paperId":"13261129251c9e8891cff02c3aee15c4df6a5630","externalIds":{"DBLP":"journals/corr/abs-2312-15234","ArXiv":"2312.15234","DOI":"10.1145/3754448","CorpusId":266551872},"title":"Towards Efficient Generative Large Language Model Serving: A Survey from Algorithms to Systems","openAccessPdf":{"url":"","status":null,"license":null,"disclaimer":"Notice: Paper or abstract available at https://arxiv.org/abs/2312.15234, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."},"authors":[{"authorId":"2270842291","name":"Xupeng Miao"},{"authorId":"2276435285","name":"Gabriele Oliaro"},{"authorId":"2185953295","name":"Zhihao Zhang"},{"authorId":"2217941981","name":"Xinhao Cheng"},{"authorId":"2166926593","name":"Hongyi Jin"},{"authorId":"2276535126","name":"Tianqi Chen"},{"authorId":"2271058444","name":"Zhihao Jia"}],"abstract":"In the rapidly evolving landscape of artificial intelligence (AI), generative large language models (LLMs) stand at the forefront, revolutionizing how we interact with our data. However, the computational intensity and memory consumption of deploying these models present substantial challenges in terms of serving efficiency, particularly in scenarios demanding low latency and high throughput. This survey addresses the imperative need for efficient LLM serving methodologies from a machine learning system (MLSys) research perspective, standing at the crux of advanced AI innovations and practical system optimizations. We provide in-depth analysis, covering a spectrum of solutions, ranging from cutting-edge algorithmic modifications to groundbreaking changes in system designs. The survey aims to provide a comprehensive understanding of the current state and future directions in efficient LLM serving, offering valuable insights for researchers and practitioners in overcoming the barriers of effective LLM deployment, thereby reshaping the future of AI."}