{"paperId":"4906654ecb2d42cfee13f46bebe2ec02bb6442b1","externalIds":{"DBLP":"journals/corr/abs-2406-00936","ArXiv":"2406.00936","DOI":"10.48550/arXiv.2406.00936","CorpusId":270216385},"title":"A Survey of Useful LLM Evaluation","openAccessPdf":{"url":"","status":null,"license":null,"disclaimer":"Notice: Paper or abstract available at https://arxiv.org/abs/2406.00936, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."},"authors":[{"authorId":"2304518297","name":"Ji-Lun Peng"},{"authorId":"2294318054","name":"Sijia Cheng"},{"authorId":"2304478854","name":"Egil Diau"},{"authorId":"2304479371","name":"Yung-Yu Shih"},{"authorId":"2294305437","name":"Po-Heng Chen"},{"authorId":"1557269413","name":"Yen-Ting Lin"},{"authorId":"2269063224","name":"Yun-Nung Chen"}],"abstract":"LLMs have gotten attention across various research domains due to their exceptional performance on a wide range of complex tasks. Therefore, refined methods to evaluate the capabilities of LLMs are needed to determine the tasks and responsibility they should undertake. Our study mainly discussed how LLMs, as useful tools, should be effectively assessed. We proposed the two-stage framework: from ``core ability'' to ``agent'', clearly explaining how LLMs can be applied based on their specific capabilities, along with the evaluation methods in each stage. Core ability refers to the capabilities that LLMs need in order to generate high-quality natural language texts. After confirming LLMs possess core ability, they can solve real-world and complex tasks as agent. In the\"core ability\"stage, we discussed the reasoning ability, societal impact, and domain knowledge of LLMs. In the ``agent'' stage, we demonstrated embodied action, planning, and tool learning of LLMs agent applications. Finally, we examined the challenges currently confronting the evaluation methods for LLMs, as well as the directions for future development."}