{"paperId":"73d4a4e39eafc5884247f6cacf42228476ae3b54","externalIds":{"DBLP":"journals/csur/ZhangCSWTSC26","ArXiv":"2309.02057","DOI":"10.1145/3757057","CorpusId":261556958},"title":"Robust Recommender System: A Survey and Future Directions","openAccessPdf":{"url":"","status":null,"license":null,"disclaimer":"Notice: Paper or abstract available at https://arxiv.org/abs/2309.02057, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."},"authors":[{"authorId":"1923171","name":"Kaike Zhang"},{"authorId":"2057766936","name":"Qi Cao"},{"authorId":"143770118","name":"Fei Sun"},{"authorId":"2144364879","name":"Yunfan Wu"},{"authorId":"32504908","name":"Shuchang Tao"},{"authorId":"2476503","name":"Huawei Shen"},{"authorId":"2110251463","name":"Xueqi Cheng"}],"abstract":"With the rapid growth of information, recommender systems have become integral for providing personalized suggestions and overcoming information overload. However, their practical deployment often encounters “dirty” data, where noise or malicious information can lead to abnormal recommendations. Research on improving robustness of recommender systems against such dirty data has thus gained significant attention. This survey provides a comprehensive review of recent work on robust recommender systems. We first present a taxonomy to organize current techniques for withstanding malicious attacks and natural noise. We then explore state-of-the-art methods in each category, including fraudster detection, adversarial training, certifiable robust training for defending against malicious attacks, and regularization, purification, self-supervised learning for defending against malicious attacks. Additionally, we summarize evaluation metrics and commonly used datasets for assessing robustness. We discuss robustness across varying recommendation scenarios and its interplay with other properties like accuracy, interpretability, privacy, and fairness. Finally, we delve into open issues and future research directions in this emerging field. Our goal is to provide readers with a comprehensive understanding of robust recommender systems and to identify key pathways for future research and development. To facilitate ongoing exploration, we maintain a continuously updated GitHub repository with related research: https://github.com/Kaike-Zhang/Robust-Recommender-System."}